[
  {
    "job_url": "https://www.seek.com.au/job/87226319?type=standard&ref=search-standalone#sol=72c95f2673a0f4767132b100f601ae383edb9676",
    "raw_data_path": "data\\raw\\Unknown_Company_Graduate Software Engineer_87226319_20250926_133311",
    "parsed_data": {
      "seek_url": "https://www.seek.com.au/job/87226319?type=standard&ref=search-standalone#sol=72c95f2673a0f4767132b100f601ae383edb9676",
      "job_detail_title": "Graduate Software Engineer",
      "job_detail_location": "Brisbane QLD(Hybrid)",
      "job_detail_classifications": "Engineering - Software (Information & Communication Technology)",
      "job_detail_work_type": "Full time",
      "job_detail_salary": "",
      "jobAdDetails": "At Swyftx, we’re on a mission to build a more open and accessible financial system, one that empowers the next generation of wealth builders, savers, borrowers, and businesses. With over 1.2 million business and retail clients, we’ve grown into one of APAC’s leading digital asset platforms, and now we’re taking things further by bridging the worlds of crypto and traditional finance. If you’re excited by big challenges, real impact, and a team that does things differently you’ll fit right in.Are you a passionate and proactive software engineering graduate ready to kickstart your career? Swyftx is looking for a Graduate Software Engineer to join our dynamic Research & Development team. This is a unique opportunity to grow your technical skills and contribute to a leading Australian crypto exchange.What You'll DoAs a key member of our team, you'll work alongside experienced engineers to develop and enhance high-quality software solutions across various platforms and technologies. Your main responsibilities will include:Learning and Contributing: Get hands-on experience by coding and contributing to the development of our platform, with a focus on mastering technologies likeJavaScriptandNode.js.Collaborating: Participate in code reviews, provide constructive feedback, and work closely with senior engineers and cross-functional teams (like Product and Design) to deliver integrated solutions.Growing Your Skills: Continuously learn and improve your technical expertise, stay up-to-date with industry trends, and participate in a culture of continuous development.Problem-Solving: Assist in troubleshooting, debugging, and resolving technical issues, while developing your problem-solving skills under the guidance of our experienced team.Taking Ownership: Actively participate in team meetings, share your progress, and contribute to the team's overall success.What We're Looking ForWe're seeking a recent graduate with a strong passion for technology and a desire to grow. You should have:A recent degree in Computer Science, IT, or a related field.A strong eagerness to learn and improve your technical expertise.Working knowledge ofJavaScript,TypeScript,Node.js, andReactis preferred.An understanding of databases (both relational like MySQL and NoSQL like MongoDB).Familiarity with cloud services (AWS, Azure, etc.) is a plus.The ability to write clean, error-free code and an analytical mindset for designing effective solutions.A proactive, self-motivated attitude and the ability to manage your time effectively in a fast-paced environment.Strong communication and collaboration skills to work effectively within a team.Some of our perks and benefits include:Fully stocked kitchen, breakfast and lunch foods, unlimited fresh fruit and snacks.An inhouse barista and weekly catered lunches on a Wednesday.Unlimited fee-free trading.Career growth, training, mentorship, and development opportunities.Social activities, game breaks and end of month awards.At Swyftx, we're not just building a diverse and dynamic environment; we're celebrating it. We value and embrace the unique experiences, qualities, and characteristics that each member of our team brings, and we're committed to cultivating an inclusive workspace where everyone feels valued, respected, and empowered to do their best work.If you are driven by excellence, a deep commitment to integrity, and an unwavering drive to make an impact then click ‘apply now’.We have an internal Talent Acquisition function, and therefore are not accepting approaches from recruitment agencies."
    },
    "extraction_time": "2025-09-26T13:33:16.321256"
  },
  {
    "job_url": "https://www.seek.com.au/job/86925000?type=standard&ref=search-standalone#sol=d7875a15f7e43b32f2237f3fbf273f069df95a95",
    "raw_data_path": "data\\raw\\Unknown_Company_Graduate Software Engineer_86925000_20250926_133201",
    "parsed_data": {
      "seek_url": "https://www.seek.com.au/job/86925000?type=standard&ref=search-standalone#sol=d7875a15f7e43b32f2237f3fbf273f069df95a95",
      "job_detail_title": "Graduate Software Engineer",
      "job_detail_location": "Brisbane QLD",
      "job_detail_classifications": "Engineering - Software (Information & Communication Technology)",
      "job_detail_work_type": "Full time",
      "job_detail_salary": "$78,000 – $82,000 per year",
      "jobAdDetails": "Join our Brisbane CBD team and kick-start your career with a leading SaaS platform that helps organisations manage grants, contracts and projects. We work with Agile practices, modern cloud technologies and have a supportive culture that’s all about helping you grow and build great software.DetailsWhat You'll DoAs a Graduate Software Engineer, you’ll:- Help design, code, test and roll out new software features.- Work with a modern cloud technology stack.- Team up with developers, testers, architects, and analysts in an Agile environment.- Write clean, maintainable code and take part in code reviews.- Pick up new tools and technologies as you go.Who We’re Looking ForYou’re someone who:- Has (or is close to finishing) a Bachelor’s degree in Computer Science, IT, or similar.- Understands object-oriented programming and how web apps work.- Has hands-on coding experience — maybe through university, internships or your own projects.- Is curious about both frontend and backend development.- Communicates well and works great in a team.- Is excited to learn and build and ship real software that makes a difference.Why Join Us?- Build software that creates real-world impact for communities around the world.- Learn Amazon Web Services cloud technologies on the job.- Grow alongside experienced developers and solution architects.- Be part of a supportive and inclusive culture.- Work from our centrally located Brisbane CBD office.Job Facts- Location: Brisbane CBD, QLD- Type: Permanent, Full-Time- Start Date: Immediate Start Available- Application Deadline: 26 September 2025- Required Documents:CVFull academic transcriptCover letter- Security Requirement: A National Police Check will be required before employmentYour Code- Got a code portfolio or GitHub profile? We’d love to see it."
    },
    "extraction_time": "2025-09-26T13:32:05.407980"
  },
  {
    "job_url": "https://www.seek.com.au/job/87344923?type=standard&ref=search-standalone#sol=c286d1a0ac0ebc4651b7bbc9f51e5553ebb1c4c4",
    "raw_data_path": "data\\raw\\Unknown_Company_Software Engineer_87344923_20250926_133200",
    "parsed_data": {
      "seek_url": "https://www.seek.com.au/job/87344923?type=standard&ref=search-standalone#sol=c286d1a0ac0ebc4651b7bbc9f51e5553ebb1c4c4",
      "job_detail_title": "Software Engineer",
      "job_detail_location": "Brisbane QLD",
      "job_detail_classifications": "Engineering - Software (Information & Communication Technology)",
      "job_detail_work_type": "Full time",
      "job_detail_salary": "",
      "jobAdDetails": "Tanda is seeking an ambitious software engineer with hands-on experience building products to join our Product Team at an Intermediate level. In the last 2 years Tanda has released two new Software Products - Payroll and HR and there’s plans to launch and grow many more. The product team powers our Workforce Management, HR and Payroll products and deploys 30+ changes per day. We have been strongly encouraging our team to adopt AI in the areas it makes sense to - we want to be on the forefront of these new tools and new ways of working.Tanda values moving fast, and our interview process reflects that. It’s two steps - a 30min phone call with the Head of Engineering, and then an in office pair programming session with the hiring manager and another member of the team.The traits we value at all levels are:Curiosity - you like to learn, and don’t make the same mistakes twice.Initiative - within reason, you are self-driven and always looking to make an impact. The more senior you get, the more we expect you to be manager of one.Problem solving - you are methodical in your approach to breaking apart problems and figuring out how to solve them in the best way possible under the constraints you face.Our platform is built using Ruby on Rails and we also use Javascript, PostgreSQL, AWS, and Docker in our stack.  If you haven’t used Ruby on Rails before - that’s ok, experience with a comparable web framework to Rails (Laravel, Django) is a good fit. We care more about the person than specific skills. Training and development will be provided following commencement. As Tanda scales up rapidly, there are plenty of exciting challenges for developers to take on, with real outcomes and benefits for both yourself and the business.The scale you will be working with:Two regions - APAC & EuropeOur APAC workload is consistently running at ~40,000 RPMHundreds of thousands of background jobs processed per daySome of Australia’s largest employers use our product - Domino’s, GYG, Best & Less, and Starbucks are just a few of the companies we work withWhat Success Looks LikeWithin your first year, you'll:Build knowledge about our codebase and business domainBe involved in building (and maybe even lead) several features for our products - at the start you’ll have support as you learn the code base, and after a year we expect you to be solving problems more autonomously without as much guidance.Participate in your first on-call rotationGrow the scope of what you work on rapidlyBe a helpful sounding board for the team - you’re able to debate different approaches, trade offs and help the team come to good solutions.About YouYou do not need a university degree for this role - we value real world impact and projects over certificates.As an Intermediate Engineer, we don’t expect you to have any relevant skills in our stack when you first start (though it is a bonus). What we do expect is you are excited to learn, willing to be challenged in your work, and open to feedback so you can improve. You enjoy problem solving & have an innate sense of curiosity.As a Senior Engineer, we do expect you have had hands on experience building with Ruby on Rails. We also expect you to be aware of common Rails performance problems & how to resolve them. As a Senior, you understand there is nuance, and are not dogmatic & maintain flexibility in your beliefs. You have a high bar & help others to meet it.You can expect to have a lot of ownership over your work. We enjoy working with curious people who take initiative and demand a high bar for themselves and the team they work with.Why Apply?See your impactWe’re a small engineering team, but our product is global. You can personally have a huge impact on our customers’ productivity.We’re not always sprintingOur development cycle uses the Shape Up framework.  Unlike a lot of “agile” frameworks - we have dedicated ‘cool-down’ time to breathe; using it to fix bugs, refactor, focus on professional development, and try out new technical possibilities.Experience amazing opportunitiesWe recognise when people are exceptional, and as a scale-up, we’re flexible enough to give people new opportunities to excel, both in existing teams and in new teams/roles.Solve deep and interesting problemsWorkforce management is an innovative industry, and creative solutions are a necessity to thrive.A genuinely great company cultureEnjoy fully stocked food and beverage fridges, book club, monthly “demo days” where everyone celebrates their best work, board game nights, and much more!Further Benefits✓ Real projects: We hire based on real demand, not based on arbitrary hiring rounds✓ Experience: You won’t be shielded from customers or responsibility✓ Culture: You will be part of a team that is passionate about what they do and don’t suffer boredom easily✓ Team retreat: a full company retreat usually held at a coastal location for two nights✓ Professional Development: an annual professional development budget per person, industry conferences, and support for those who want to speak at conferences representing TandaAbout TandaTanda is an established, fast-growing tech company. We are on a mission to build Australia’s leading all-in-one workforce management platform. Our vision is to eliminate employment friction for shift and hourly workers, reducing the world’s unemployment rate. Our main activities centre around engineering, marketing, sales, research, and supporting functions. We build software that helps businesses manage their rostering, time & attendance, staffing optimisation, employee engagement, payroll, and labour compliance.We service thousands of Australian clients from our Brisbane headquarters and globally with offices in Chicago and London.If these challenges sound interesting - reach out to us for a chat!"
    },
    "extraction_time": "2025-09-26T13:32:05.942309"
  },
  {
    "job_url": "https://www.seek.com.au/job/86971771?type=standard&ref=search-standalone#sol=6d0418e392286fd73a9a4076fcf9b287aea71533",
    "raw_data_path": "data\\raw\\Unknown_Company_Software Engineer_86971771_20250926_133335",
    "parsed_data": {
      "seek_url": "https://www.seek.com.au/job/86971771?type=standard&ref=search-standalone#sol=6d0418e392286fd73a9a4076fcf9b287aea71533",
      "job_detail_title": "Software Engineer",
      "job_detail_location": "Brisbane QLD(Hybrid)",
      "job_detail_classifications": "Engineering - Software (Information & Communication Technology)",
      "job_detail_work_type": "Full time",
      "job_detail_salary": "",
      "jobAdDetails": "At Deswik, software engineering is more than just writing code—it’s about crafting smart, scalable solutions that transform how mining operations are planned and run. Our engineers work on cutting-edge tools that blend technical excellence with real-world impact, all within a collaborative and forward-thinking environment.Deswik.OPSis our advanced shift planning and execution platform that helps mines plan, monitor, and manage production in real time. You’ll build smart tools that boost productivity, reduce bottlenecks, and connect technical planning with operational execution—all in a collaborative, high-impact environment.We’re growing, so we’re looking for 2 new members for our 2 Deswik.OPS teams.What You’ll DoChallenge yourself with enterprise systems development work on our sophisticated short term shift planning web application (Deswik.OPS).Collaborate with a team of hard-working, friendly engineers who care about what they do.Work within an iterative development process to deliver new features to our global customersTechnical Skills | What you’ll bringAs a skilled software engineer you will be adaptable to different technical environments, with demonstrated commercial experience in the following technologies:C# .NET (or if you have used C++ or Java or similar languages then that’s cool too)HTML5, CSS3, JavaScript (AJAX, JSON, etc) & TypescriptModern front end JavaScript frameworksASP.net, .NET CoreSQL Server and some use of ORM (Entity Framework or similar)Automated testing techniques and frameworksAbout youEnjoy collaboration in a cross-functional team of friendly and skilled software developersBachelor of Computer Science, Software Engineering or similar.Commitment to code quality and maintainabilityBonus points for experience in a product-based environment with a customer-centric culture.Why Choose Deswik?At Deswik, we offer more than just a job - we provide a career with purpose, balance, and growth. Here’s what sets us apart:Work in a team that values good software engineering practicesCompetitive Remuneration– Your expertise is valued and rewardedAnnual Bonus– Celebrate your contribution to our shared successPeer Recognition– Be acknowledged by your team for the impact you makeHybrid Flexibility– 3 days in-office, 2 days WFH for balance and focusWellbeing Support– Access to our Employee Assistance Program (EAP) for confidential mental health and wellbeing servicesInclusive Culture– Collaborative, low-ego, and engineering-led environmentLearning Academy– 24/7 access to self-paced learning and career developmentPaid Parental Leave– Company-funded support for growing familiesSocial Activities– Optional fun like pool and chess competitionsModern Office– Brisbane CBD location, close to public transportKitchen Perks– Free coffee, soft drinks, and regular company updates over morning teaGlobal Scale. Local Soul.Deswikis a global technology company delivering integrated software and consulting solutions for the mining and rail industries. Acquired by Sandvik, we have global reach and stability without losing the engineering-led culture that started in Brisbane. Our solutions arePractical. Powerful. Proven.We’re one of the few places where you can work on industrial-grade software with startup-style autonomy and enterprise-level impact. Our teams solve complex challenges in simulation, optimisation, and data modelling far beyond the typical dashboard or e-commerce app.If you're tired of chasing specs or building yet another internal tool, Deswik offers the chance to create software that literally moves the world. You’ll work alongside low-ego experts in a collaborative, global environment where your ideas matter.With over 470 employees across 17 offices in 12 countries, our Brisbane HQ is home to 170+ software engineers, mathematicians, and mining professionals—driving the future of mining tech from the heart of the city.Ready to build something that matters?Apply now to join a team where your code powers real-world decisions, and your career grows with purpose.Please note: we are only considering applications from Australian citizens, permanent residents or individuals on a valid work visa that do not require sponsorship.Agencies: please don’t send us unsolicited applications."
    },
    "extraction_time": "2025-09-26T13:33:41.307764"
  },
  {
    "job_url": "https://www.seek.com.au/job/87350659?type=standard&ref=search-standalone#sol=a41c271b1f8815f4f84450052504eafd4c441577",
    "raw_data_path": "data\\raw\\Unknown_Company_Software Engineer_87350659_20250926_133336",
    "parsed_data": {
      "seek_url": "https://www.seek.com.au/job/87350659?type=standard&ref=search-standalone#sol=a41c271b1f8815f4f84450052504eafd4c441577",
      "job_detail_title": "Software Engineer",
      "job_detail_location": "Brisbane QLD(Remote)",
      "job_detail_classifications": "Engineering - Software (Information & Communication Technology)",
      "job_detail_work_type": "Full time",
      "job_detail_salary": "$110,000 – $160,000 per year",
      "jobAdDetails": "KurrawongAI is looking for a software engineer to join our small team of specialist software professionals working on Knowledge Graphs and AI.This is a full-time role, based in Brisbane, but work-from-home with occasional team get-togethers.KurrawongAI is a small, Australian, specialist Knowledge Graph + AI company that provides data system consultation, software development and system management to government and industry clients. We are increasingly building our own KG + AI platform products, based on the things our clients find useful. We have a unique set of clients who are interested in semantic data and we have staff with academic, government and industry experience in this area.Currently we are working on several high-impact projects such as the development and delivery of a national biodiversity database for government Environmental Impact Assessment decision making and geology AI systems for mining companies. We are also working extensively within international data standards organisations and are now developing a 3D spatial data standard for graph technology. We are small but have a couple of areas of world-leading capability.We use a range of 3rd party and in-house developed applications for projects and need a proficient software developer to take responsibility for the continued development delivery of several of these, and to also join our pool of consulting engineers.Of immediate need is the configuration and extension of an open source Java graph database, the maintenance and extension of a number of our Python API tools and deployment of some of these via different cloud platforms.Regarding career development: we want people to develop and grow. We are a small company but one that is growing and taking on ever larger and more important projects. A person performing well in this role will be able to grow with us and move into software leadership, technical specialist or senior consultant roles.Essential:Australian CitizenshipBased in Brisbane or close SEQRequired experience:Software development lifecycleJava and/or Python programmingWorking in a team of software developersInfracode for cloud environment deploymentsDesirable experience:JavaScript programming experienceGIS systemsOpen source software contribution experienceQualifications:A tertiary qualification in engineering, IT or related technical fieldKey Responsibilities:Maintain and develop KurrawongAI’s own and 3rd party applicationsFacilitate Kurrawong staff and clients’ use of the applications via documentation and trainingDeploy applications for projects on different cloud platforms using infracodeWork on projects using the applications as part of KurrawongAI’s team of consulting engineersCareer stage:We are interested in candidates who, as long as they meet the Essential and Required Experience points above, may have just a few to very many years in the software/IT field. We will tailor the role and remuneration to match experience through negotiation."
    },
    "extraction_time": "2025-09-26T13:33:40.988267"
  },
  {
    "job_url": "https://www.seek.com.au/job/87315783?type=standard&ref=search-standalone#sol=395dd9669480f0e9c9539034c47dd1ba43ec3b51",
    "raw_data_path": "data\\raw\\Unknown_Company_Software Engineer_87315783_20250926_133333",
    "parsed_data": {
      "seek_url": "https://www.seek.com.au/job/87315783?type=standard&ref=search-standalone#sol=395dd9669480f0e9c9539034c47dd1ba43ec3b51",
      "job_detail_title": "Software Engineer",
      "job_detail_location": "Fortitude Valley, Brisbane QLD(Hybrid)",
      "job_detail_classifications": "Engineering - Software (Information & Communication Technology)",
      "job_detail_work_type": "Full time",
      "job_detail_salary": "",
      "jobAdDetails": "Help shape the future of health servicesAt Honeysuckle Health, we’re on a mission to help people lead healthier lives by connecting them with effective, affordable and personalised care. Through digital and telephonic health programs, data-driven insights and strong industry partnerships, we’re building a more connected and value-driven healthcare system for all Australians. We’re a wholly owned member of the nib Group and are merging with nib’s digital health company, Midnight Health, to form an integrated health services organisation offering a broad suite of health programs and services.This next chapter will see us expanding our impact and accelerating the development of innovative health solutions, and we’re looking for a Business Analyst to support the technical migration of our operations onto Midnight Health’s innovative platform.About the role:We're looking for a Software Engineer to join our team, where you'll play a pivotal role in enhancing our consumer brands and integrating new services across various healthcare providers. Your primary focus will be on crafting an exceptional patient experience while rapidly implementing innovative initiatives.Leveraging your background, you'll bring to life the creative concepts developed by our product managers and design team. A strong grasp of modern cloud technologies and mobile-first development principles, with a keen emphasis on security and service design, is crucial for this position.  Working closely with our product and engineering team, you'll be instrumental in shaping our architectural decisions. Your expertise will be vital in developing and implementing workflows across our platform that support our patients in being able to access healthcare wherever they are.Here's some of what you will be working on as part of your role:Developing, testing and maintaining code which facilitates our digital healthcare platformTranslating designs and wireframes into high-quality, reliable codeEnsuring our software is stable, secure, resilient and documentedDeveloping features to enhance the user experienceEnsuring web and application design is optimised for varying browsers and device typesEnsuring web and application design is optimised for maximum speed and scalabilityWorking with our product, marketing and patient support teams to establish and deliver on business requirementsUnderstanding and developing the requirements for integrating new technology partners across various healthcare sectorsContributing to and developing the overall system architectureDeveloping and implementing measures for enhanced security of system and patient dataWork with Data & Insights team to develop business reporting functionsSkills and experience that will help you to be successful in this role:University education or similar experienceMinimum 3-5 years in a similar role with strong delivery experiencePrevious experience in working with Python, Django, Postgres, RESTful api’s, Typescript, React, SQL, Docker, AWSThorough understanding of Data structures, classes, APIs and web appsBroad knowledge of Cloud (AWS) concepts, services and cloud architecture best practicesExperience and knowledge in Authentication and AuthorisationAbility to work autonomously and within a diverse team environmentGood communication skillsSomeone looking to join a fast-paced startup environment with big ambitionsWhy join us?Play a key role in one of the most exciting healthtech businesses in AustraliaFlexible hybrid working from our Brisbane HQEmployee health insurance discounts, paid parental leave and educational assistanceCollaborative, purpose-driven teamOpportunities for career growth in a dynamic, fast-paced environmentVisit honeysucklehealth.com.au and midnight.health to learn more about what we doAll applications are strictly confidential. Applicants must have full rights to work in Australia.Ready to build a Healthier Future? Apply now and be part of a team that’s changing lives every day. Submit your cover letter and CV and let’s make healthcare history together!As far as recruiters go, our internal People & Culture team has this role covered, so we will not accept unsolicited agency resumes."
    },
    "extraction_time": "2025-09-26T13:33:38.380702"
  },
  {
    "job_url": "https://www.seek.com.au/job/87323369?type=standard&ref=search-standalone#sol=ded62092708e0d8cbe87467bcf50916622070678",
    "raw_data_path": "data\\raw\\Unknown_Company_Software Engineer_87323369_20250926_133402",
    "parsed_data": {
      "seek_url": "https://www.seek.com.au/job/87323369?type=standard&ref=search-standalone#sol=ded62092708e0d8cbe87467bcf50916622070678",
      "job_detail_title": "Software Engineer",
      "job_detail_location": "Milton, Brisbane QLD(Hybrid)",
      "job_detail_classifications": "Developers/Programmers (Information & Communication Technology)",
      "job_detail_work_type": "Full time",
      "job_detail_salary": "",
      "jobAdDetails": "Software EngineerQTAC is a not-for-profit organisation that provides and operates an equitable and centralised tertiary entrance system on behalf of our member and participating institutions to provide comprehensive information for prospective applicants. The institutions that participate in QTAC determine their own admission requirements and QTAC ensures that these admission rules and procedures are administered in a transparent, consistent and equitable manner.Are you an experienced software engineer looking for a change? This is your opportunity to give back to the community by joining a growing not-for-profit, community-focused organisation that supports young people to access education prospects.Reporting to the Chief Information Officer, this is an exciting and varied position that works closely with talented development and project teams supporting BAU and project work. As a Software Engineer at QTAC you will contribute to the information technology of the organisation by implementing systems that are functional, accessible and fit for purpose. The position undertakes the development and maintenance of all bespoke software.You will benefit from:An immediate startA respected and stable organisationA positive and rewarding team cultureUp-to-date technology and a modern office environmentWork from home flexibilityRecognition for successDoing work that matters as we pioneer innovative and cutting-edge services to tertiary institutions and year 11 and 12 studentsOur unique QTAC culture - with fun team activities and inclusive social events, we celebrate achievements and take immense pride and accountability for the work that we do and the impact we have.Our culture of growth and development while retaining an inclusive and family feel, along with work/life balance, will ensure you have the support you need to make a success of your next career move. Join our fast-paced, and ambitious organisation and enjoy making a significant impact and being part of our exciting growth story.You will:Maintain a detailed understanding of QTAC business operations, processes and systemsMonitor all systems and identify current issues and risks and take remedial action as required to correct faultsContribute to the implementation of continuous integration and continuous deploymentIdentify and implement potential system enhancements to improve business processes and services offeredAct as a technical resource for internal and external projectsAssist with the development, acquisition, implementation and maintenance of softwareAssist in monitoring production application and performance tuningUndertake periods of on call and out of hours services as neededRequired Skills and ExperienceYou must have:Experience in developing languages such as Java or KotlinExperience working with Spring Boot MicroservicesExperience using JPA/HibernateExperience developing using cloud computing services such as AWS or AzureYou may also have:Experience in developing frontend web applicationsExperience in web application frameworks such as AngularExperience in hands-on application development and maintenanceExperience problem solving and debugging skillsExperience in relational database systems: SQL Server, PostgreSQLFamiliarity with Document based database systems such as MongoDBAn understanding of Event Driven ArchitectureExperience developing Rest APIsExperience with distributed development and version control systems such as GitExperience in automated testing using JUnitBachelor’s degree in Computer Science or ComputingThis is a permanent position based in Milton, Qld with a Hybrid Work from Home and Office (2 Days per week) arrangement.Please note, you must have full rights to work in Australia to be considered for this role."
    },
    "extraction_time": "2025-09-26T13:34:07.508737"
  },
  {
    "job_url": "https://www.seek.com.au/job/87386045?type=standard&ref=search-standalone#sol=a3e4c98f3a006ef808828bbc9e2d14e95a26446b",
    "raw_data_path": "data\\raw\\Unknown_Company_Software Engineer Robotics_87386045_20250926_133358",
    "parsed_data": {
      "seek_url": "https://www.seek.com.au/job/87386045?type=standard&ref=search-standalone#sol=a3e4c98f3a006ef808828bbc9e2d14e95a26446b",
      "job_detail_title": "Software Engineer (Robotics)",
      "job_detail_location": "Newstead, Brisbane QLD(Hybrid)",
      "job_detail_classifications": "Engineering - Software (Information & Communication Technology)",
      "job_detail_work_type": "Full time",
      "job_detail_salary": "$70,000 – $75,000 per year",
      "jobAdDetails": "About UsConvergence Medical (www.convergenceortho.com) is a Brisbane-based medical surgical robotics start-up developing the V01, the world’s first arthroscopic surgical robot. Our mission is to transform arthroscopy (minimally invasive keyhole joint surgery) through advanced robotics, precision engineering, and clinical innovation.We are expanding our team and seeking a Robotics Software Engineer with proven experience. This role sits at the cutting edge of surgical robotics and offers the opportunity to contribute directly to one of the most exciting medtech projects globally.The RoleAs a Robotics Software Engineer, you will design, develop, and commercialise software solutions for the V01 robotic platform. This is a hands-on role where you’ll collaborate across hardware, product, and quality teams to ensure our robotic systems meet the highest standards for performance, compliance, and clinical usability.This role is ideal for an engineer who thrives in fast-paced, highly regulated environments, and wants to apply both technical expertise and product leadership to bring world-first technology to market.Key ResponsibilitiesSoftware Development & EngineeringDevelop and maintain robotic software systems across frontend and backend components.Design, implement, and test software solutions for surgical robotics applications.Debug and troubleshoot issues across the technology stack.Apply advanced algorithms and mathematical principles to solve robotics challenges.Develop frontend applications (React Native) and backend services/APIs.Integrate scalable architecture with cloud-based services.Product Commercialisation LeadershipLead initiatives to transition software from development to commercial release.Develop and implement release strategies including pipelines, QA processes, and regulatory compliance.Work with product and business teams to align software with commercial needs.Establish and maintain commercial-ready documentation.Team CollaborationCollaborate with cross-functional teams including hardware engineers, product managers, and QA.Participate in agile workflows (sprint planning, stand-ups, retrospectives).Communicate technical concepts effectively to both technical and non-technical stakeholders.Quality Assurance & Continuous ImprovementImplement automated testing and CI/CD pipelines.Monitor performance and reliability in commercial environments.Ensure compliance with industry standards and regulatory frameworks.Drive continuous improvement in processes and technical optimisation.About You – Essential RequirementsDemonstrated experience taking in Software Engineering, preferably in robotics.Strong programming expertise in Python (plus other modern languages).Proficiency in mathematical/algorithmic applications for robotics or complex systems.Frontend development experience (React Native strongly preferred).Knowledge of cloud services and scalable architecture.Excellent problem-solving and analytical skills.Strong communicator with the ability to work independently and take ownership.Why Join Us?Be part of a mission-driven start-up developing world-first surgical robotics technology.Opportunity to influence product direction and grow with the company as we scale globally.Work alongside globally recognised surgeons, engineers, and commercial leaders.A dynamic, collaborative, and innovative culture where your work directly shapes patient outcomes."
    },
    "extraction_time": "2025-09-26T13:34:03.009913"
  },
  {
    "job_url": "https://www.seek.com.au/job/87277607?type=standard&ref=search-standalone#sol=76f02eaed2137b26aeafb09b714a90908328f68d",
    "raw_data_path": "data\\raw\\Unknown_Company_Developer_87277607_20250926_133358",
    "parsed_data": {
      "seek_url": "https://www.seek.com.au/job/87277607?type=standard&ref=search-standalone#sol=76f02eaed2137b26aeafb09b714a90908328f68d",
      "job_detail_title": "Developer",
      "job_detail_location": "Brisbane QLD",
      "job_detail_classifications": "Developers/Programmers (Information & Communication Technology)",
      "job_detail_work_type": "Full time",
      "job_detail_salary": "$85,000 – $105,000 per year",
      "jobAdDetails": "Do you thrive on solving problems, love learning, and want your work to make a real impact? We’re looking for a developer who is keen to roll up their sleeves, contribute ideas, and grow with a team that values curiosity, collaboration, and getting things done to support schools in safeguarding what matters most: children’s media and data privacy.About uspixevety is an internationally award-winning ISO27001 certified Australian-owned company delivering a unique consent-driven media management platform and mobile application to hundreds of schools in Australia, NZ, parts of Asia, the US, Canada and the UK. The company aims to be the most trusted media sharing service provider for online communities, delivering ethical, privacy-driven solutions to empower safer community media sharing, image protection, and connectivity. Child image protection is the core of pixevety’s purpose. https://pixevety.com/The roleBased in our Brisbane CDB office with our onsite technology and customer support teams, you will be responsible for contributing to the design, development and support of our ‘live’ applications and technology ecosystem that helps schools protect images and manage media responsibly.We are looking for someone with high-energy, a positive can-do mindset, eager to learn and open to feedback. Someone with an interest in problem-solving, not just coding. This is a fantastic opportunity for results-orientated individuals that enjoy working in a fast-paced yet collaborative work environment that is on a major growth trajectory. The ideal candidate is team-oriented, proactive, with excellent written and verbal communication skills.Responsibilities:Design and develop high-quality software solutions adhering to best practices and coding standards.Collaborate with cross-functional teams to define, design, and deliver new features and enhancements.Conduct thorough testing and debugging to ensure applications are error-free and meet performance benchmarks.Participate in code reviews and provide constructive input and feedback to team members.Troubleshoot and resolve issues reported by customers or internal stakeholders in a timely manner.Stay updated with industry trends and technologies to propose innovative solutions.Required skills and experience:Degree in Information Technology or equivalent.3+ years of experience as a software developer with a success in delivering complex solutions to customers.Experienced in software languages C#, .Net Core and TypeScript/JavaScript.Competent with relational database technologies (SQL Server, PostgreSQL)Can take part in all aspects of the software development lifecycle with an agile mindset.Excellent written and oral communication skills.Ability to problem-solve and understand the needs of consumers.Eagerness and willingness to learn and apply new technologies.Ability to work in a team or work independently.Ability to maintain confidentiality of company and customer information.Desired attributes:Exposure to AWS Infrastructure as code and services.Interest or exposure to Angular, React Native and React.Understands microservice architectures and RESTful APIs.Understands continuous integration and deployment pipelines.Hands on experience with containerised software (e.g. Docker).Be part of a mission to design technology for an Australian-owned company that safeguards data and protects children around the world.If you are energised by reading this job description, we want to hear from you. Please attach a PDF version of your resume and an accompanying Cover Letter with your application. Please do not just send us a resume, we want to hear your story and what excites you about this opportunity to work at pixevety.Applicants must have full rights to work in Australia and be able to work full-time in our office based in the Brisbane CBD.No recruiters please"
    },
    "extraction_time": "2025-09-26T13:34:03.216657"
  },
  {
    "job_url": "https://www.seek.com.au/job/86901308?type=standard&ref=search-standalone#sol=2347cd743518284c6f34c2cc3dab6e4cc20efcf3",
    "raw_data_path": "data\\raw\\Unknown_Company_Software Engineer_86901308_20250926_133428",
    "parsed_data": {
      "seek_url": "https://www.seek.com.au/job/86901308?type=standard&ref=search-standalone#sol=2347cd743518284c6f34c2cc3dab6e4cc20efcf3",
      "job_detail_title": "Software Engineer",
      "job_detail_location": "Brisbane QLD(Hybrid)",
      "job_detail_classifications": "Engineering - Software (Information & Communication Technology)",
      "job_detail_work_type": "Full time",
      "job_detail_salary": "",
      "jobAdDetails": "At Deswik, we don’t just write code—we engineer solutions that shape the future of mining. From simulation engines to optimisation algorithms, our software powers smarter decisions in one of the world’s most complex industries.We’re looking forthree software engineersto join our growingBOLT, ORB and RACE teamsto contribute to products that optimise rail and mining operations globally.What you’ll doWork in one of our established product teams with active and engaged customersTurn functional requirements into smart, scalable technical solutionsCollaborate on architecture and design with experienced engineersBreak down complex problems into clear, actionable tasksWrite automated tests and build test plans to ensure reliabilityDocument features for both users and internal teamsTech you’ll useWe’re open to different backgrounds, but here’s a bit about our stack:Python 3, SQLAlchemy, Pandas, PlotlyTypeScript, React (beneficial but not required)Docker, AWS ECS, PostgreSQLIn-house declarative Python/TS frameworkC++ and optimization toolsYou might be a fit if you have:Commercial experience developing software products, ideally in a SaaS contextStrong grasp of architecture, design principles, and clean, maintainable codeExperience with Python 3 preferred; other interpreted languages consideredFamiliarity with TypeScript, React, or C++ is a bonusComfortable working with non-technical stakeholders and solving real-world problemsA degree in Computer Science, Software Engineering, or similarReview code and designs to uphold quality and share best practicesBenefitsCompetitive salary + annual BonusFlexible, hybrid schedule – 2 days WFH and 3 days in-officeInclusive and collaborative culture that values innovationA team that values best practice software engineering practicesCompany paid parental leaveAccess to our extensive internal Learning Academy for 24/7 access to self-paced learningSocial activities (if you want) – think social Pool & Chess competitionsContemporary office in Brisbane’s CBD, close to public transportA fully appointed kitchen with a variety of coffee machines (read: free coffee), free soft drinks and regular company updates over morning teaAbout DeswikDeswik is a global technology leader that delivers integrated software solutions and specialized consulting for the mining and rail industries. With our world-class expertise and innovative solutions, we empower our customers to achieve success.Our head office in Brisbane is our software development hub of 170+ employees.Operating since 2008 in the global market, Deswik employs 470+ experienced mining professionals, software engineers and mathematicians across the globe to support our global customer base.Ready to build something that matters?Apply now and join a team where technical excellence meets real-world impact.Please note:we are only considering applications from Australian citizens, permanent residents or individuals on a valid work visa that do not require sponsorship.Agencies: please don’t send us unsolicited applications."
    },
    "extraction_time": "2025-09-26T13:34:32.341795"
  },
  {
    "job_url": "https://www.seek.com.au/job/87058062?type=standard&ref=search-standalone#sol=473ba92ade74cc4f05899d03417feca239045d27",
    "raw_data_path": "data\\raw\\Unknown_Company_Grad to Mid-Level Engineers - _87058062_20250926_133426",
    "parsed_data": {
      "seek_url": "https://www.seek.com.au/job/87058062?type=standard&ref=search-standalone#sol=473ba92ade74cc4f05899d03417feca239045d27",
      "job_detail_title": "Grad to Mid-Level Engineers - 100% Remote - Multiple positions",
      "job_detail_location": "Brisbane QLD(Remote)",
      "job_detail_classifications": "Developers/Programmers (Information & Communication Technology)",
      "job_detail_work_type": "Full time",
      "job_detail_salary": "",
      "jobAdDetails": "Welcome to Optizmo, a thriving remote-first SaaS powerhouse with a global presence in Australia and the USA. Our groundbreaking products have taken the world by storm, with prestigious Fortune 500 companies like Uber, Salesforce, and Citrix among our clientele.As a data-driven innovator, we collect, analyse, and process a staggering two trillion records every month while operating some of the world's most high-traffic websites.The OpportunityOur phenomenal success has spurred a period of incredible growth as we being branching out into new products and services while enhancing our established core. We're now on the lookout for dynamic full-stack developers ranging from junior to mid levels. Joining one of our exceptional cross-functional agile teams, you'll lean from the best while immersing yourself in our vibrant company culture.At Optizmo, we champion a relaxed and supportive atmosphere, fostering a space where you can excel in everything from infrastructure and AI to front-end design and product management. Within your team, your voice will matter and your contributions will shape the products we create.The Tech You'll MasterModern software architecture patternsNode/React/Typescript/GoLeverage AI Services, such as Claude Code and CursorAPIs, Messaging microservicesBDD and TDD testingCI/CDInfrastructure as codeAWS/Azure/CloudflareDatabases (PostgreSQL & NoSQL)Monitoring/loggingInfosecThe Perks That Set Us ApartFull ownership of the products you create, from inception to executionA remote-first, work-from-home company - we've been this way for 15 years and will never change.A flat organisational structure championing a \"best idea wins\" mentalityUnparalleled opportunities for growth, learning from the best in the industry and developing in-demand skillsEmbark on a journey of discovery and growth with Optizmo, where your talent and passion will come alive."
    },
    "extraction_time": "2025-09-26T13:34:31.250698"
  },
  {
    "job_url": "https://www.seek.com.au/job/86794682?type=standard&ref=search-standalone#sol=9b056e866e1127fdae2946b9768d6508c371cc11",
    "raw_data_path": "data\\raw\\Unknown_Company_Software Engineer_86794682_20250926_133500",
    "parsed_data": {
      "seek_url": "https://www.seek.com.au/job/86794682?type=standard&ref=search-standalone#sol=9b056e866e1127fdae2946b9768d6508c371cc11",
      "job_detail_title": "Software Engineer",
      "job_detail_location": "Brisbane QLD(Hybrid)",
      "job_detail_classifications": "Engineering - Software (Information & Communication Technology)",
      "job_detail_work_type": "Full time",
      "job_detail_salary": "",
      "jobAdDetails": "At Trilogy Care, AI isn’t a side project, it’s how we build.We’re hiring engineers who think AI-first and want to apply that mindset to transform health & care tech. If you’re looking to engineer with AI as part of your everyday toolkit, this is where your work makes an immediate impact.We’re not just tweaking an old system - we’re rebuilding the future of aged care from the ground up, powered by AI, automation and cloud-native tech. As an industry first-mover in practical AI, we’ve embedded real autonomy, experimentation and velocity into the heart of our tech team. Every employee from engineering to front-line care has access to generative AI tools at their fingertips. You’ll be part of a fast-growing product and engineering function solving deeply human challenges with modern tools, agile ways of working, and a chance to create real social impact.About the RoleAs a Mid-Level Software Engineer, you’ll work across a full-stack environment to design, develop, and support modern web and mobile applications. You’ll write clean, maintainable code, contribute to shared UI frameworks, and collaborate with product, UX, backend, and QA teams to deliver accessible, scalable, and secure features. You’ll also play a key role in how cloud-native tools, AI-driven insights, and rich UI components come together to support decision-making and transform care delivery.What You'll DoBuild & DeliverDesign and develop modern web and mobile applications using React, Vue, TypeScript, Next.js, and React Native (Expo or similar frameworks)Integrate frontend applications with secure and reliable API endpointsBuild accessible, scalable, and maintainable features that support real-world impactOptimise applications for performance, accessibility, security, and complianceCollaborate & ContributePartner with product managers, UX/designers, backend engineers, QA, and security teams to deliver production-grade featuresTranslate requirements, specs, and user stories into actionable technical deliverablesContribute to shared UI frameworks, frontend patterns, and design systemsParticipate in architecture and design discussions, shaping the future of our platformQuality & ExcellenceWrite clean, reusable, and testable code with strong documentationSupport CI/CD pipelines and test automation to ensure fast and reliable deliveryConduct code reviews, peer programming, and knowledge sharing to lift engineering standardsWhat You'll Bring3–5 years’ experience in frontend or full-stack developmentProficiency in React, Vue, TypeScript, JavaScript, Next.js and mobile development with React Native/ExpoStrong understanding of REST APIs, responsive UI, accessibility, and performance optimisationExperience with Git workflows, Agile environments, and modern testing frameworks (Jest, Cypress, Playwright)Problem-solving mindset with the ability to balance delivery speed, scalability, and maintainabilityCollaborative approach, working effectively with cross-functional teamsAdaptable, inclusive, and committed to fostering a positive team cultureBonus points forFamiliarity with WCAG 2.2 and accessible designExposure to backend/serverless (Node.js, .NET, PHP) and cloud platforms (AWS, Azure)Experience with DevOps tools (GitHub Actions, Docker)Background in SaaS, healthcare, or compliance-regulated environmentsInterest in AI-driven features and emerging technologiesWhy Trilogy Care?Expansive new King Street office with excellent facilities, close to public transport, cafes, restaurants and supermarketsVibrant team culture and regular social eventsCareer mapping and progression opportunities across digital and data teamsSalary packaging to boost your take-home payAccess to Fitness Passport to support your health and wellbeingEAP support for you and your immediate familyEmployee discounts on groceries, fuel, utility bills, wellness and moreHybrid working environmentPlease noteTo join our team, you’ll need to have full Australian work rights. As part of our standard recruitment process, we’ll also conduct a working rights check, police check and request professional references during onboarding.We appreciate the interest of recruitment agencies but kindly ask that resumes not be submitted unless a prior agreement is in place. Trilogy Care will not accept responsibility for any fees related to unsolicited resumes."
    },
    "extraction_time": "2025-09-26T13:35:05.783945"
  },
  {
    "job_url": "https://www.seek.com.au/job/87469330?type=standard&ref=search-standalone#sol=967570402a578ae00fa9b9c2f5ea87cbd4ea1c09",
    "raw_data_path": "data\\raw\\Unknown_Company_Software Engineer_87469330_20250926_133526",
    "parsed_data": {
      "seek_url": "https://www.seek.com.au/job/87469330?type=standard&ref=search-standalone#sol=967570402a578ae00fa9b9c2f5ea87cbd4ea1c09",
      "job_detail_title": "Software Engineer",
      "job_detail_location": "Brisbane QLD(Hybrid)",
      "job_detail_classifications": "Engineering - Software (Information & Communication Technology)",
      "job_detail_work_type": "Full time",
      "job_detail_salary": "",
      "jobAdDetails": "The Opportunity - Software Engineer -MQ-28The Boeing MQ-28 Ghost Bat is a globally-significant program that will deliver a disruptive advantage to support Defence operational capabilities.As we continue to accelerate the development program, and expand the aircraft flight envelope through the test program, we are seeking the very best talent from a diverse range of backgrounds to help grow and contribute to our innovative team.Boeing Defence Australia (BDA) are looking for a Software Engineer to join the MQ-28 Program.This role is based in Brisbane and reports into the MQ-28 Missions Systems Engineering Manager.Responsibilities:Supports the design, development, test, and maintenance of software throughout the end-to-end lifecycle that meets industry, customer, safety, and regulation standards.Assists with review, analysis and translation of customer requirements into initial design of software products.Supports development, maintenance, enhancement and optimisation of software products and functionality for systems integration.Supports development, documentation and maintenance of architectures, requirements, algorithms, interfaces and designs for software products.Supports debugging and resolution of issues identified to ensure the reliability and efficiency of software products.Supports implementation of current and emerging technologies, tools, frameworks and changes in regulations relevant to software development.Supports development, establishment, monitoring and improvement of software processes, tools and key performance metrics that align projects with organizational goals and industry benchmarks.Supports execution and documentation of software research and development projects.Experience and QualificationsStrong C++ and/or Python skills.Skills or domain knowledge in Mission systems, sensor integration, messaging protocols and data exchange highly desirable.Past experience with Automated Test Frameworks is desirable.Past experience in software development for Defence software applications is desirable.Tertiary qualifications in Software Engineering, Computer Science, Mechatronics and/or Electrical Engineering.Applicants must be Australian Citizens to meet Defence security requirements.What's on offer?Boeing values the health and wellbeing of our employees and offer true flexibility including working from home, compressed work weeks, and opportunities for part time arrangements, allowing you to balance your career with what is important to you outside of work.Other benefits:Work on cutting edge projects with opportunities to work across platforms.Attractive remuneration and annual bonus.Formal mentoring and training as well as on the job learning.Formal reward and recognition program.Access discounts for health insurance, travel and accommodation.Paid study leave, paid parental leave and Defence leave.Salary packaging options available.Health and wellbeing benefits including annual flu vaccinations and Employee Assistance Program.Social and community groups.BDA works with strong links with our global Boeing community and we strongly encourage collaboration with our international counterparts.We are committed to building a diverse and inclusive workplace. Female applicants, people of Aboriginal or Torres Strait Island descent and veterans are encouraged to apply.If you are ready to join an innovative industry leader and would like to register your interest in working for Boeing, please click Apply Now."
    },
    "extraction_time": "2025-09-26T13:35:32.192235"
  },
  {
    "job_url": "https://www.seek.com.au/job/87066700?type=standard&ref=search-standalone#sol=325fe472f41758ecee569dabede4143f4a58f9ed",
    "raw_data_path": "data\\raw\\Unknown_Company_Software Engineer_87066700_20250926_133525",
    "parsed_data": {
      "seek_url": "https://www.seek.com.au/job/87066700?type=standard&ref=search-standalone#sol=325fe472f41758ecee569dabede4143f4a58f9ed",
      "job_detail_title": "Software Engineer",
      "job_detail_location": "Brisbane QLD(Hybrid)",
      "job_detail_classifications": "Engineering - Software (Information & Communication Technology)",
      "job_detail_work_type": "Full time",
      "job_detail_salary": "",
      "jobAdDetails": "Who We AreiSelect and Compare the Market are trusted, well-known brands dedicated to helping millions of Australians compare and buy personal finance and household products such as insurance, energy, and loans. Together, we provide a seamless, customer-focused experience that makes it easier for Australians to find the right products to suit their needs.What You’ll Be DoingWe're looking for a Software Engineer who loves solving real problems with clean, scalable code. Someone who wants a say in how things get built and enjoys working with people who feel the same.As a Software Engineer with us, you’ll get to:Build great software– Deliver secure, scalable products with clean code and solid standards, while helping lift the team’s quality of workShape our tech direction– Have a say in architecture, design patterns and the stack. We value smart questions and fresh ideas!Work the modern way– Agile, DevSecOps, automation, CI/CD, event-driven architectures and cloud-first are part of how we buildCollaborate widely– Turn ideas into working solutions with product owners, PMs, and architects, explaining tech in plain languageKeep learning and sharing– Stay curious, explore new tools, and help the team grow through knowledge sharingWe’re big on modern practices and we hold ourselves to high standards, but we keep things practical. No endless process for the sake of process. Just solid engineering, delivered well. From AI and multi-agent systems to AWS, Java 21, CI/CD, Playwright and MCP, chances are it’s already in our stack.What’s In It For YouAt Compare the Market and iSelect, we’re all about helping people make smart choices – and joining us might just be yours. We offer an environment where your ideas are heard, your contributions are valued, and your growth genuinely matters. Collaboration is part of our DNA, and you’ll be joining a supportive, forward-thinking team where you can do meaningful work (and be recognised for it!)We’re guided by three shared values that shape how we work, how we treat each other, and how we show up for our customers - Drive, Noble Intent and All Together.Plus, we offer a range of great perks to help you thrive both in and out of work:Vibrant and social community who have annual celebrations, family fun days and regular eventsEnjoy flexible work arrangements, including the option of one day working from home each week or a 9-day fortnightEnjoy additional leave days - ‘ME’ leave and ‘Volunteer Day’ leaveEmployee discounts on car and home and contents insuranceIncome protection insurance provided to support you in the event of non-work-related illness or injuryWhat Sets You ApartWe’d love to hear from natural collaborators with:3+ years of software development experience in full-stack environmentsExpertise in JavaScript (React) and/or Java, and Node.jsExperience with AWS cloud technologies, serverless and event-driven architecturesExperience with modern CI/CD practices, observability, and end-to-end software developmentExperience in regulated industries and hybrid delivery models is desirableInterested? Let’s talk.At Compare the Market and iSelect we’re proud to be an Equal Opportunity Employer and we embrace diversity.This role is available to candidates with unlimited Australian working rights only. Sponsorship is not available.Compare the Market and iSelect are committed to protecting your privacy. All applications and personal information are kept confidential and securely stored in line with Australian privacy laws, used only for recruitment purposes, and not shared with third parties outside the Auto and General Holdings Group without your consent."
    },
    "extraction_time": "2025-09-26T13:35:31.719698"
  },
  {
    "job_url": "https://www.seek.com.au/job/87407795?type=standard&ref=search-standalone#sol=f74962a8d43086c15ff9d215b62d1eee83d23e29",
    "raw_data_path": "data\\raw\\Unknown_Company_Junior Database  Application D_87407795_20250926_133525",
    "parsed_data": {
      "seek_url": "https://www.seek.com.au/job/87407795?type=standard&ref=search-standalone#sol=f74962a8d43086c15ff9d215b62d1eee83d23e29",
      "job_detail_title": "Junior Database & Application Developer",
      "job_detail_location": "Brisbane QLD(Hybrid)",
      "job_detail_classifications": "Database Development & Administration (Information & Communication Technology)",
      "job_detail_work_type": "Full time",
      "job_detail_salary": "",
      "jobAdDetails": "About the roleAre you a recent graduate or early-career developer with a passion for databases and automation? We’re seeking a Junior Database & Application Developer to join our team and contribute to the maintenance and evolution of our legal document automation systems.This is a fantastic opportunity to work in a forward-thinking law firm, where your enthusiasm for SQL, relational data design, and application development will be nurtured through hands-on experience and mentorship from highly experienced Developers.Key responsibilitiesAssist in the design, maintenance and implementation of relational databases and automation tools.Write efficient SQL queries and support data-driven document generation.Collaborate with senior developers and stakeholders to enhance existing systems.Support the development of web-based applications using C#, Blazor SSR, HTML, CSS, and XML/XSLT.Participate in testing, troubleshooting, and documentation of solutions.Contribute to the ongoing improvement of automation workflows for legal document preparation.About youBachelor’s degree in Engineering (preferred) or Computer Science.Strong interest in SQL, relational data design, and application development.Familiarity with C#, Blazor SSR, HTML, CSS, XML, and XSLT is advantageous.Demonstrated experience in building applications using relational databases.A keen interest in document automation and merging documents with data.Strong analytical and problem-solving skills.Strong communication and teamwork abilities.Eagerness to learn and grow in a collaborative environment.About usAt Green Mortgage Lawyers, we’re not just any law firm; we’re aTop Tier Independent Legal Firm built on 40 years of excellence in the banking and finance sector, proudly partnering with other Top Tier clients and brands. With over 160 talented lawyers, paralegals, and support professionals spanning Brisbane and Manila, we pride ourselves on offering a vibrant, inclusive culture. Here, you'll benefit from comprehensive training, professional development and mentoring from seasoned professionals while enjoying a work-life balance that truly values your well-being.Why choose GML?At Green Mortgage Lawyers, we’re not just offering a job; we’re providing an opportunity to elevate your career in a thriving legal environment. Here’s what sets us apart:Empowerment: Take charge of your legal career with opportunities for leadership, ownership of projects, and the chance to make a real impact from day one.Growth and Development: Benefit from tailored training programmes, mentorship from some of the best most respected professionals in the industry, and pathways for career advancement. Your success is our priority.Inclusivity: Join a diverse team of brilliant lawyers, paralegals, and support staff who are passionate about excellence and your growth, celebrates different perspectives and encourages collaboration. Your voice matters here!Stability and Reputation: Join a respected and high profile law firm celebrated for its excellence in commercial and retail legal mortgage services. Collaborate with top-tier clients and brands to enhance your personal brand and expand your professional capabilities.Client Support Focus: Engage directly with clients to sharpen your communication style and build meaningful relationships. This hands-on experience will enhance your professional network and position you as a trusted advisor in the legal field.Community Impact: Contribute to meaningful work that helps our clients and their borrowers to secure their financial futures, making a positive impact on the lives of others.How to applyTo apply, please submit your cover letter and CV via the link. If you have any questions about the role, please contact Sophie Sheather – Operations Manager on07 3052 9058.Websitehttps://greenmortgagelawyers.com/"
    },
    "extraction_time": "2025-09-26T13:35:31.406954"
  },
  {
    "job_url": "https://www.seek.com.au/job/86938576?type=standard&ref=search-standalone#sol=4c97efd06edd5e65fba5183290b151ff0e941b3d",
    "raw_data_path": "data\\raw\\Unknown_Company_Graduate Web Developer_86938576_20250926_133546",
    "parsed_data": {
      "seek_url": "https://www.seek.com.au/job/86938576?type=standard&ref=search-standalone#sol=4c97efd06edd5e65fba5183290b151ff0e941b3d",
      "job_detail_title": "Graduate Web Developer",
      "job_detail_location": "Cannon Hill, Brisbane QLD(Hybrid)",
      "job_detail_classifications": "Web Development & Production (Information & Communication Technology)",
      "job_detail_work_type": "Full time",
      "job_detail_salary": "",
      "jobAdDetails": "Permanent | Full-Time | Hybrid - Cannon Hill Office + WFHMichael Hill? Is that a tech company? They sell jewellery, right?We do! But there’s a lot more to it!In 1979, Sir Michael Hill started a journey with a simple vision: to make fine jewellery accessible to everyone.Join Michael Hill’s dynamic Digital Engineering team as a Web Developer and help shape the future of our eCommerce experience. You’ll work in an agile environment, building and enhancing digital assets that power our global online presence.Whether it’s in-person, online or virtual, we’re looking for ways to give our customers the best possible experience regardless of how or where they choose to interact with us.Why You’ll Love It Here:Flexibility:Hybrid working with WFH and brand-new offices at Cannon HillPerks:Discounts across our stunning product range and hundreds of retailersGrowth:Real opportunities for development and career impactBrand:Be part of a global business with bold plans and a brilliant futureWhat You’ll Do:Develop and maintain modern, scalable web applicationsCollaborate with UX, product, and backend teamsEnsure high standards in code quality, accessibility, and performanceContribute to solution design, integration, and DevOps practicesChampion security, privacy, and continuous improvementWhat You’ll Bring:Working experience in web development technologies and frameworks (HTML/CSS/JS/Node.js/TypeScript/Vue.js/React preferred)Experience with GIT, CMS, Restful APIs, and backend tech (Node.js, .NET)Familiarity with CI/CD, SDLC, and agile methodologiesFoundational understanding of Headless (MACH) web-application infrastructure designA solid understanding of software excellence design principles. Uses AI tools like Github Copilot to level-up not replace these learned skillsA passion for clean code, collaboration, and innovationTertiary qualification in Computer Science or related Software Development fieldBonus Points:TypeScript and headless architecture knowledgeWorking knowledge of Azure Dev OpsReady to build something brilliant? Apply now and help us deliver exceptional digital experiences at Michael Hill."
    },
    "extraction_time": "2025-09-26T13:35:51.355683"
  },
  {
    "job_url": "https://www.seek.com.au/job/87375571?type=standard&ref=search-standalone#sol=9009db6facb51c307c727a4e8618eb056989130d",
    "raw_data_path": "data\\raw\\Unknown_Company_Graduate DevOps Engineer_87375571_20250926_133624",
    "parsed_data": {
      "seek_url": "https://www.seek.com.au/job/87375571?type=standard&ref=search-standalone#sol=9009db6facb51c307c727a4e8618eb056989130d",
      "job_detail_title": "Graduate DevOps Engineer",
      "job_detail_location": "Brisbane QLD",
      "job_detail_classifications": "Developers/Programmers (Information & Communication Technology)",
      "job_detail_work_type": "Full time",
      "job_detail_salary": "",
      "jobAdDetails": "The company: HaultraxAt Haultrax, we believe in challenging the operational paradigms that have kept the mining industry in a state of productivity stagnation. As a team, our passion is to leverage technology and innovation to make the lives of individuals easier, safer and more productive.We do this through:The correct strategy, evaluation and selection of technologyPeople and process focused operational readiness, implementation and change managementDigital applications focused on productivity improvement through deep data analysisAs TeamHX, we seek to nurture a culture that is extremely dedicated, highly energetic and dynamic. We are looking for multifaceted people who are keen to learn – and teach – to join our team and journey to reach new heights.The opportunity | Graduate DevOps EngineerWe are seeking a Graduate DevOps Engineer to join our Haultrax Digital team in a full-time role. At Haultrax, you’ll support the design, implementation, and maintenance of infrastructure that keeps our digital products running smoothly. You’ll collaborate closely with cross-functional teams to streamline development processes, automate deployment pipelines, and embed strong security practices. With guidance and mentoring from experienced engineers, you’ll gain hands-on exposure to continuous integration and delivery (CI/CD), cloud technologies, and modern DevOps tools.Responsibilities:Design, implement, and manage scalable and secure cloud infrastructure. Familiarity with Azure preferredDevelop and maintain CI/CD pipelines to automate software deployments, testing, and monitoring (GitHub)Collaborate with software development teams to enhance application performance, reliability, and scalabilityWork with our site teams and customers to support Haultrax Digital products / services and deploymentsSupport and manage containerisation technologies (e.g., Docker, Kubernetes) for deployment and orchestrationBuild awareness of and apply security best practices across infrastructure and processesMonitor system performance, troubleshoot issues, and ensure high availability of servicesAssess new technologies and tools for improvements in infrastructure and processesAssist UAT and QA alongside site teamsWhat you will need for this role:Traits of those successful in this role are integrity, strong communication skills, a sharp analytical mind, creativity and a team-orientated mentality.We don’t expect you to know it all yet — but we’d love you to bring:A degree in Computer Science, Engineering, IT, or a related fieldInterest in cloud platforms - AzureSome exposure to scripting or coding (Python, Bash, PowerShell, JavaScript, etc.)Understanding of CI/CD pipelines, version control systems (e.g., GitHub), and infrastructure as code (e.g., Terraform, Ansible)Eagerness with containerisation tools like Docker, Kubernetes, etcAwareness of the importance of security in DevOps and a willingness to build knowledge in this areaExcellent problem-solving skills and the ability to work in a fast-paced, collaborative environmentRelevant certifications (e.g., Azure Certification, Certified Kubernetes Administrator) are a plus"
    },
    "extraction_time": "2025-09-26T13:36:29.608273"
  },
  {
    "job_url": "https://www.seek.com.au/job/87278332?type=standard&ref=search-standalone#sol=c64795b7405e6cff3ffcfa3cfd7231aec3a16bec",
    "raw_data_path": "data\\raw\\Unknown_Company_AI Co-Pilot Full Stack Develop_87278332_20250926_133558",
    "parsed_data": {
      "seek_url": "https://www.seek.com.au/job/87278332?type=standard&ref=search-standalone#sol=c64795b7405e6cff3ffcfa3cfd7231aec3a16bec",
      "job_detail_title": "AI Co-Pilot Full Stack Developer",
      "job_detail_location": "Brisbane QLD(Remote)",
      "job_detail_classifications": "Developers/Programmers (Information & Communication Technology)",
      "job_detail_work_type": "Full time",
      "job_detail_salary": "",
      "jobAdDetails": "At Forwood Safety, we’re on a mission to make every shift safer and every workplace fatality-free. We’re seeking aSoftware Engineerwho can combine strong engineering skills with AI-assisted development to deliver high-quality software at speed.Deliver Life-Saving SoftwareShip high-impact features across ourReact/Remix + TypeScript front endandNestJS/AWS microservices back end—building tools that directly help safety teams spot and eliminate critical risks before they turn deadly.Work Smarter with AIUse tools likeCursor, GitHub Copilot, and other AI copilotsas part of your daily workflow to accelerate delivery. You’ll know how to get the most out of them—structuring prompts, validating outputs, and ensuring the code you ship is robust, clean, and production-ready.Raise the Bar on QualityApply strong engineering discipline:Write and maintainunit tests (Jest or equivalent)andend-to-end tests (Playwright)Use static analysis, peer reviews, and continuous improvement of AI promptsBuild software that is secure, maintainable, and enterprise-readyShape the Future of Safety TechShare your knowledge by mentoring teammates in AI-driven workflows and contributing to a culture that values quality, velocity, and innovation.Why Forwood?Mission-Driven Impact:Your code will directly enable safety leaders to protect their people.AI-First Workflow:We embrace AI tooling as a core part of how we work—accelerating development without compromising quality.Cutting-Edge Stack:React, Remix, NestJS, TypeScript, Terraform, Docker, AWS ECS/RDS, and AI copilots.Collaborative Environment:A tight-knit, remote-first team that values mentorship, continuous learning, and open communication.What We’re Looking ForStrong experience withReact/Remix, NestJS, and TypeScriptDaily use ofAI copilotsto ship faster, safer, and cleaner codeProven ability to validate and secure AI-assisted code with testing and reviewsA production mindset: everything you build isrobust, maintainable, and enterprise-readyBased inAustralia(remote role, with AU timezone collaboration)If you’re excited to combine solid engineering practices with AI-assisted workflows—and to use that capability to help prevent workplace fatalities—we’d love to hear from you.This role is 100% remote but must be based in Australia."
    },
    "extraction_time": "2025-09-26T13:36:13.254419"
  },
  {
    "job_url": "https://www.seek.com.au/job/86826701?type=standard&ref=search-standalone#sol=4eefcd60bdc062fbb49c96934508503b03eb1fff",
    "raw_data_path": "data\\raw\\Unknown_Company_Software Developer_86826701_20250926_133658",
    "parsed_data": {
      "seek_url": "https://www.seek.com.au/job/86826701?type=standard&ref=search-standalone#sol=4eefcd60bdc062fbb49c96934508503b03eb1fff",
      "job_detail_title": "Software Developer",
      "job_detail_location": "Brisbane QLD(Remote)",
      "job_detail_classifications": "Developers/Programmers (Information & Communication Technology)",
      "job_detail_work_type": "Full time",
      "job_detail_salary": "",
      "jobAdDetails": "Software Developer - C#, .Net 8, Angular/React 19, Azure - $80,000 - $90,000+ Super - Brisbane - Company Paid Certifications - Trips around Australia - Remote.The CompanyWe're looking for a Software Developer to join an award-winning tech consultancy working on Ai Software and workforce solutions. They started around 8 years ago and class themselves as a distinguished Microsoft partner, specialising in Digital Applications innovation on Azure. They thrive off a flat hierarchy so be prepared to have a seat at the table as soon as you arrive (their inclusive culture is a massive plus). As a business they're always looking for ways to upskill their Developers this includes 7 Personal Development days per year & company paid for exams in YOUR chosen technology PLUS if you pass the exam the company will reward you with $1500 to say well done!The RoleAs a Developer, you'll be developing work products, lead specific project initiatives and act as a subject matter on consulting projects. You'll be working in a team to develop software solutions using the most cutting-edge technology to meet customer expectations in line with current trends (.Net Core, React/Angular, Azure). You'll also be involved in the development of solutions and ensuring best practices are met across the board. This role is purely about your development as they'll be looking for you to step up into a more mid-senior role within 2-3 years. The best thing about them, they reward you for your effort and dedication to your work - you won't need to wait for an annual pay increase, every ¼ when the audit is done, if you've hit your targets and overachieved you will automatically receive a pay increase.For this role, ideally you'll have a minimum of 2 years' experience, from a .Net background with Angular or React experience and are based around Queensland, even though this role is fully remote.SkillsC#, .NETANGULAR OR REACTAZUREAGILEMICROSERVICE ARCHITECTUREIf you're interested in the above role, please apply below or email me directly tokate@justdigitalpeople.com.aufor consideration.Interviews are being held as early as next week.Software Developer - C#, .Net 8, Angular/React 19, Azure - $80,000-$90,000 + Super - Brisbane - Company Paid Certifications - Trips around Australia - Remote."
    },
    "extraction_time": "2025-09-26T13:37:05.390685"
  },
  {
    "job_url": "https://www.seek.com.au/job/87264152?type=standard&ref=search-standalone#sol=158d850390f32ac5deb5ceac18b8e61b80f05c16",
    "raw_data_path": "data\\raw\\Unknown_Company_Backend Software Developer_87264152_20250926_133658",
    "parsed_data": {
      "seek_url": "https://www.seek.com.au/job/87264152?type=standard&ref=search-standalone#sol=158d850390f32ac5deb5ceac18b8e61b80f05c16",
      "job_detail_title": "Backend Software Developer",
      "job_detail_location": "Brisbane QLD(Hybrid)",
      "job_detail_classifications": "Developers/Programmers (Information & Communication Technology)",
      "job_detail_work_type": "Full time",
      "job_detail_salary": "",
      "jobAdDetails": "Backend Developer – Python$140k + super | Brisbane | Flexible workingDo you enjoy solving problems most engineers haven’t even seen? Our client builds software powered bymathematics and optimisation, used by professionals in healthcare, logistics, and infrastructure. The code you write here will actually change the way people work.Why This Role Is DifferentYou won’t be following a playbook. Each project bringsfresh, complex problems.Your work impactsreal users who rely on the software every day.You’ll join a small team where ideas matter, not titles.What You’ll DoWrite and maintainbackend systems in Python/Django, with opportunities to touch front-end features in React/TypeScript.Translatemathematical models and algorithmsinto practical tools.Solvescalability and performance puzzlesthat challenge even experienced engineers.Share knowledge and support teammates in alearning-focused environment.What We’re Looking ForExperienced withPython/Django, comfortable in Postgres and CI/CD workflows.Curious, adaptable, and driven tomake software that users actually rely on.Collaborative communicator who enjoysworking in a small, high-performing team.Perks:Flexible working, supportive team culture, and projects that constantly challenge you.If you want tocode, learn, and see tangible impact, this is your chance to join a company doing something different."
    },
    "extraction_time": "2025-09-26T13:37:05.254195"
  },
  {
    "job_url": "https://www.seek.com.au/job/86997440?type=standard&ref=search-standalone#sol=1ece5177de73fba4631c8e7080b990751c00400b",
    "raw_data_path": "data\\raw\\Unknown_Company_Senior Software Engineer ASPNE_86997440_20250926_133658",
    "parsed_data": {
      "seek_url": "https://www.seek.com.au/job/86997440?type=standard&ref=search-standalone#sol=1ece5177de73fba4631c8e7080b990751c00400b",
      "job_detail_title": "Senior Software Engineer (ASP.NET Core, Microservices, Azure)",
      "job_detail_location": "Brisbane QLD(Remote)",
      "job_detail_classifications": "Developers/Programmers (Information & Communication Technology)",
      "job_detail_work_type": "Full time",
      "job_detail_salary": "$130,000 – $150,000 per year",
      "jobAdDetails": "About CareviewCareview is at the forefront of disability software solutions in Australia, revolutionizing care with our comprehensive web and mobile platforms. Trusted by over 700 organizations nationwide to support more than 140,000 NDIS Participants, we are deeply committed to enhancing service delivery for Australians living with disabilities through innovative technology.The RoleThis full-time position is entirely focused on backend development using .NET Core, with a particular emphasis on Entity Framework. We are looking for someone who can not only take over an existing codebase but also mentor junior developers and help drive our technology forward. Whether you're in Brisbane or the Gold Coast, we provide flexibility to suit your lifestyle, with occasional in-person collaboration at our Gold Coast office.What You'll DoLead the development and enhancement of our platform's backend services using .NET Core, with a strong focus on Entity Framework.Take ownership of an existing codebase, ensuring its ongoing scalability, performance, and maintainability.Mentor and guide junior developers, fostering a collaborative and growth-oriented environment.Build robust APIs that enable seamless communication with front-end applications and integration with our microservices architecture.Collaborate closely with the requirements team and front-end developers to ensure seamless integration and optimal application performance.Leverage Azure SDKs to develop secure, scalable, and maintainable backend features that interact with Azure services.Write clean, maintainable code supported by comprehensive unit and integration tests, ensuring high standards of quality.Use tools like ReSharper to enhance code quality and development efficiency.About YouA seasoned technology professional with a passion for solving complex business challenges.Proven ability to lead and mentor junior developers, and guide teams in adopting best practices.Strong expertise in navigating and enhancing modern codebases, taking full ownership of backend solutions.Highly proficient in ASP.NET Core, C#, and Entity Framework with a deep understanding of SQL queries and Azure cloud services.Eager to learn, adapt, and continuously improve the development process, with a strong foundation in test-driven development.A collaborative team player with excellent communication skills who thrives in working with both technical and non-technical stakeholders.Legally entitled to work in Australia, with a preference for candidates who can flexibly work between home and our Gold Coast office when needed.Experience Required5+ Years of experience in .NET development (ASP.NET Core and C#).5+ Years of experience with Entity Framework (Core).3+ Years of experience developing APIs (RESTful APIs).Experience leading backend development and mentoring junior developers.Experience with test-driven development, including unit and integration tests.Extensive experience working with Azure cloud resources and distributed architecture.Unlimited full working rights in Australia are required.Join UsAt Careview, you’ll join a supportive community that values your contributions and is eager to see you grow. If you’re ready to make a tangible difference in the lives of Australians living with disabilities, we’d love to hear from you.Please note that recruitment agencies will not be considered."
    },
    "extraction_time": "2025-09-26T13:37:04.929892"
  }
]