[
  {
    "job_url": "https://www.seek.com.au/job/87420230?type=standard&ref=search-standalone#sol=a78651c9948e71c9375350bfdbbd02e0bb4effd0",
    "raw_data_path": "data\\raw\\Unknown_Company_Business Analyst - Healthcare_87420230_20250926_163221",
    "parsed_data": {
      "seek_url": "https://www.seek.com.au/job/87420230?type=standard&ref=search-standalone#sol=a78651c9948e71c9375350bfdbbd02e0bb4effd0",
      "job_detail_title": "Business Analyst - Healthcare",
      "job_detail_location": "Perth WA(Hybrid)",
      "job_detail_classifications": "Business/Systems Analysts (Information & Communication Technology)",
      "job_detail_work_type": "Contract/Temp",
      "job_detail_salary": "$120k - $150k p.a. + Salary Sacrificing Benefits",
      "jobAdDetails": "The CompanyWell known healthcare organisation that is focused on the community.Sites based across Australia & New Zealand, this role is based within 15 minutes of Perth's CBD and offers hybrid working.The RoleAs an experiencedBusiness Analystwith a passion for digitising healthcare processes, in this role you'll play a key part in designing and delivering streamlined digital workflows that improve efficiency and effectiveness across the organisation.Working in a fast-paced healthcare environment, you'll collaborate with clinical, technical, and operational teams to create solutions that optimise workflows, enhance the patient experience, and support a modern, connected workplace.Skills & ExperienceDemonstrated experience as a Business Analyst within a medical / healthcare or clinical environmentKnowledge and experience working with clinical applications and/or systemsStrong background in analysing and documenting clinical and administrative workflows (BPMN, Visio or similar).Proven ability to map system interfaces, data flows, and application dependencies across multiple systems.Skilled in producing clear, concise documentation for both technical and non-technical audiences.Hands-on experience developing test scenarios, validating functionality and supporting UAT.Excellent problem-solving, critical thinking and communication skills, with the ability to engage senior stakeholders.Collaborative team player with strong time management and organisational skills.(Desirable) Understanding of usability, human-centred design principles, and integration technologies (middleware, APIs).Familiarity with hospital information systems, clinical applications and digital transformation in healthcare is highly advantageousTertiary Degree in IT or other relevant disciplineIndustry Certifications, where relevant, may be advantageous, e.g. Agile etc.INTERESTED? You MUST have appropriate work rights for Australia to be considered for this position.Please APPLY ONLINE. Cover letter not necessary."
    },
    "extraction_time": "2025-09-26T16:32:29.543318"
  },
  {
    "job_url": "https://www.seek.com.au/job/87454139?type=standard&ref=search-standalone#sol=6e400ae577f5748f5ccfa78372ab13ba813f7041",
    "raw_data_path": "data\\raw\\Unknown_Company_Business Systems Analyst_87454139_20250926_163221",
    "parsed_data": {
      "seek_url": "https://www.seek.com.au/job/87454139?type=standard&ref=search-standalone#sol=6e400ae577f5748f5ccfa78372ab13ba813f7041",
      "job_detail_title": "Business Systems Analyst",
      "job_detail_location": "Perth WA(Hybrid)",
      "job_detail_classifications": "Business/Systems Analysts (Information & Communication Technology)",
      "job_detail_work_type": "Full time",
      "job_detail_salary": "Not for profit benefits including salary packaging",
      "jobAdDetails": "We have an opportunity for aBusinessSystems Analystto join our Digital Enablement team to enhance the suite of software applications used across Bethanie, driving innovation and continuous improvement in our digital capabilities.Reporting to the Manager – Digital Enablement this is a permanent role available full-time or part-time (0.8FTE) based at our Hay Street office in West Perth. We work flexibly, and attend the office minimum three times per week.About the role:Working closely with our Digital Enablement and ICT teams, duties in this hands-on role include:Drive continuous improvement initiatives and innovation in system designFeature development, upgrades and fixes (in conjunction with System Owners and/or Vendors as relevant)Ensure business requirements for new tech solutions are clear, and solutions developed in line with endorsed directionsProvide technical leadership in data integration and platform interoperability; supporting the design and development of integrationsDeliver prioritised sprint activities that support the Bethanie Strategy, Digital Enablement Plan and Strategic Project activitiesAbout youYou are a detail-oriented problem solver with strong communication skills and a passion for digital transformation. You thrive in collaborative environments and are confident in leading technical discussions and driving system improvements. You will also bring:Excellent communication and interpersonal skills – in particular, the ability to connect the understanding of technical and non-technical colleaguesAbility to translate business needs into technical solutionsProven experience structuring business requirements and systems architectureSound knowledge of the software development lifecycle and process improvement methodologiesAttention to detail and critical thinking ability, finding innovative solutionsExperience with Azure integration solutions and Microsoft Power PlatformProgramming skills, including in SQLWorking with BethanieAt Bethanie, we are committed to being an employer of choice by creating a supportive and compassionate environment for our people and customers. As well as being part of a stimulating and nurturing work environment, you will also have access to the following benefits:Financial benefits: Salary Packaging up to $15,899 of life expenses per annum, $2,650 per annum for meals and entertainment and additional benefits for parking – increasing your take home pay.Wellbeing benefits: a comprehensive mental health and wellbeing program and free flu vaccinations each year.Culture benefits: welcoming team with a supportive culture; team events and an annual awards night.A focus on flexibility and work life balance.To ApplyPlease click on apply to upload your resume and brief cover letter before the closing date of 10th October. Our application process will include a questionnaire to finalise your application.If you require any further information, please contact our Talent Acquisition team for a confidential discussion on131 151."
    },
    "extraction_time": "2025-09-26T16:32:29.117957"
  },
  {
    "job_url": "https://www.seek.com.au/job/87424790?type=standard&ref=search-standalone#sol=3d3f09d447646f63721c278c670a74323c3df9b1",
    "raw_data_path": "data\\raw\\Unknown_Company_Data Analyst_87424790_20250926_163221",
    "parsed_data": {
      "seek_url": "https://www.seek.com.au/job/87424790?type=standard&ref=search-standalone#sol=3d3f09d447646f63721c278c670a74323c3df9b1",
      "job_detail_title": "Data Analyst",
      "job_detail_location": "Perth WA(Hybrid)",
      "job_detail_classifications": "Business/Systems Analysts (Information & Communication Technology)",
      "job_detail_work_type": "Full time",
      "job_detail_salary": "",
      "jobAdDetails": "The RoleWe’re seeking a skilled and curiousData Analystto join our team and help drive data-led decision-making across the business. You’ll work closely with the business to explore complex datasets, build reports, uncover actionable insights, and deliver high-impact analytics solutions that improve business performance.Main Duties & ResponsibilitiesPerform exploratory analysis of complex datasets to identify trends, patterns, and opportunities for improvement.Collaborate with stakeholders to understand business challenges and translate them into data-driven solutions.Collect, clean, and model data from multiple sources to support strategic decision-making.Design, build and deliver interactive dashboards and visualisations using Power BI and other tools.Monitor and optimise the performance of productionised datasets and analytics models.Create and maintain comprehensive documentation of data models, transformation logic, dataset architecture, and report design to ensure transparency, reproducibility, and effective knowledge sharing.Address ad-hoc data requests and incidents with high-quality, complete and timely solutions.Leverage DBT (Data Build Tool) to design and implement robust data models to transform raw data into structured, analysis-ready datasets that support accurate reporting and decision-making.Collaborate effectively within a team of data analysts to share knowledge, align on best practices, follow processes and deliver cohesive, high-quality analytical outputs that support business objectives.Skills and ExperienceThe successful candidate will be able to demonstrate the following skills and experience:Tertiary qualifications in Data Science, Statistics, Computer Science, or a related discipline.Minimum 2 years’ experience in data analysis or a related field.Proficiency in SQL for data manipulation, querying, and modelling.Proficiency in data visualisation tools such as Power BI.Experience with cloud-based solutions such as Snowflake.Strong analytical and problem-solving skills.Ability to manage multiple priorities and deliver high-quality work in a fast-paced environment.Ability to communicate insights clearly to technical and non-technical audiences.Desirable:Experience with programming languages such as R and Python.Familiarity with structured and semi-structured data formats (e.g., JSON, XML).Experience with statistical analysis and/or machine learning techniques.About AFG:Australian Finance Group (ASX:AFG) is one of Australia's largest mortgage broking groups, founded back in 1994 and now employing 300+ staff across Australia. As a category leader, AFG has some 4,000 finance brokers in its network with access to over 10,000 financial products from more than 80 of Australia's leading lenders.Through our broker network, AFG processes around one in 10 of all Australian residential mortgages and manages over $214 billion in residential and commercial finance.In addition to our broker network, AFG has a rapidly growing home loan business, and an expanding footprint in the provision of business lending solutions.At AFG our purpose is to create a fairer financial future for all. Our business prides itself its innovative, entrepreneurial and collaborative culture, which is underpinned by our values of integrity, accountability, customer-centric and team player (IACT). Our teams are intricately engaged across the business, and we encourage people with ideas and a willingness to learn to join us.AFG is committed to our culture. We provide an inclusive workplace where all are welcomed and recognised for their unique ability, regardless of gender, race, religion, disability, orientation, or other identity attribute."
    },
    "extraction_time": "2025-09-26T16:32:29.291982"
  },
  {
    "job_url": "https://www.seek.com.au/job/87289430?type=standard&ref=search-standalone#sol=fc6ac1c5f91dc23788e24bf3b82f6605dcb77c52",
    "raw_data_path": "data\\raw\\Unknown_Company_Business Intelligence Analyst_87289430_20250926_163246",
    "parsed_data": {
      "seek_url": "https://www.seek.com.au/job/87289430?type=standard&ref=search-standalone#sol=fc6ac1c5f91dc23788e24bf3b82f6605dcb77c52",
      "job_detail_title": "Business Intelligence Analyst",
      "job_detail_location": "Perth WA(Hybrid)",
      "job_detail_classifications": "Business/Systems Analysts (Information & Communication Technology)",
      "job_detail_work_type": "Full time",
      "job_detail_salary": "$116,000 - $132,000 + super",
      "jobAdDetails": "About the OrganisationJoin a well-established ASX 300 listed business with strong growth forecasts. This is an environment where you can make a real impact and help shape the future of data and analytics across the organisation.The RoleWe are seeking a proactive Business Intelligence Analyst to take ownership of the data and BI function. This is a stand-alone role, meaning there is no dedicated internal data team, but you will work closely with external vendors for support and learning.Reporting directly to the CIO, you will work within a flat, collaborative technology team and partner closely with stakeholders across Finance, Marketing, HR, and other business areas.This role offers the chance to shape and grow a mature data practice while driving initiatives that enable informed business decisions. The position is open to candidates based in Melbourne or Brisbane, as well as Perth.Key ResponsibilitiesOwn the organisation’s BI and data function as a stand-alone analystContinue development of a Microsoft Fabric-based data warehouse (currently 80–90% complete)Design and deliver new reports and datasets based on business needsCollaborate with stakeholders to translate data requirements into actionable solutionsManage and partner with external vendors, overseeing delivery and deciding on outsourcing needsAct as the internal subject matter expert on data and BI, supporting business-wide decision makingGain exposure to multiple business areas, setting yourself up for future leadership opportunitiesSkills & ExperienceExperience with Microsoft Fabric and data warehouse developmentStrong knowledge of ETL processesProficiency in Microsoft Power Platform (Power BI, Power Apps, Power Automate)Exposure to Boomi or other integration toolsAbility to gather and translate business requirements into technical solutionsVendor management experience and confidence in driving project deliveryProject management or leadership experienceWhat’s on OfferA permanent, hands-on role with autonomy and ownership of BI and dataStand-alone role with access to vendors for support and learningWork closely with a lean, collaborative tech team, reporting directly to the CIOSignificant vendor budget and the ability to shape project deliveryFlexible working arrangements: one day per week from home and parent-friendly hoursCompetitive salary package: $116,000 - $132,000 + super, + $8K performance bonus"
    },
    "extraction_time": "2025-09-26T16:32:53.127997"
  },
  {
    "job_url": "https://www.seek.com.au/job/87323656?type=standard&ref=search-standalone#sol=8c0297dfe6e7afd99f9908fb4202680f9591e061",
    "raw_data_path": "data\\raw\\Unknown_Company_Business Analyst - Information_87323656_20250926_163245",
    "parsed_data": {
      "seek_url": "https://www.seek.com.au/job/87323656?type=standard&ref=search-standalone#sol=8c0297dfe6e7afd99f9908fb4202680f9591e061",
      "job_detail_title": "Business Analyst - Information Management",
      "job_detail_location": "Perth WA",
      "job_detail_classifications": "Business/Systems Analysts (Information & Communication Technology)",
      "job_detail_work_type": "Contract/Temp",
      "job_detail_salary": "",
      "jobAdDetails": "Contract opportunity to support a major information management transitionYour new companyJoin a dynamic public sector organisation undergoing a major transformation in its information management systems. This is a fantastic opportunity to contribute to a high-impact project focused on transitioning legacy systems and enhancing governance frameworks.Location: Perth CBDContract duration: 6 month with potential for further extensionYour new roleAs an Information Management Specialist, you will play a key role in supporting the transition from a bespoke in-house record-keeping system to a modern, compliant framework. You'll work closely with stakeholders to ensure data integrity, system alignment, and successful delivery of project components.Key ResponsibilitiesDevelop and execute data migration plans for legacy systems and repositories.Assist in remapping the Functional Thesaurus to the Business Classification Scheme.Support the implementation of the Information Management Governance Framework.Contribute to the development of test plans, test cases, and transition documentation (e.g. implementation, backout, and support plans).Engage with stakeholders to gather requirements and conduct impact assessments.Ensure solution designs align with business needs and compliance standards.Perform data analysis, mapping, and modelling to support system transition.Identify interdependencies across systems and processes.What you'll need to succeedProven experience in information management, data migration, or system transition projects.Strong stakeholder engagement and communication skills.Familiarity with governance frameworks and classification schemes.Experience with data analysis, mapping, and documentation.Ability to work collaboratively in a project-driven environment.What you'll get in returnA 6-month contract with a reputable public sector organisation.Opportunity to contribute to a strategic transformation initiative.Competitive daily rate and flexible working arrangements.What you need to do nowIf you're interested in this role, click 'apply now' to forward an up-to-date copy of your CV toLovlin.Rashmi@Hays.com.au, or call us now.If this job isn't quite right for you, but you are looking for a new position, please contact us for a confidential discussion on your career."
    },
    "extraction_time": "2025-09-26T16:32:52.404364"
  },
  {
    "job_url": "https://www.seek.com.au/job/87444221?type=standard&ref=search-standalone#sol=75d008671178b240f5d695491ce79f0fa4c2db9b",
    "raw_data_path": "data\\raw\\Unknown_Company_Analyst_87444221_20250926_163247",
    "parsed_data": {
      "seek_url": "https://www.seek.com.au/job/87444221?type=standard&ref=search-standalone#sol=75d008671178b240f5d695491ce79f0fa4c2db9b",
      "job_detail_title": "Analyst",
      "job_detail_location": "Perth WA(Hybrid)",
      "job_detail_classifications": "Analysts (Consulting & Strategy)Government - Federal (Government & Defence)",
      "job_detail_work_type": "Full time",
      "job_detail_salary": "",
      "jobAdDetails": "At ASIC, you can be the change that ensures a fair, strong and efficient financial system for the benefit of all Australians. Contribute to delivering on ASIC's purpose, vision, and strategic priorities to help maintain the integrity of the financial system and protect consumers from harm.ASIC is seeking an Analyst - Business Engagement & Enquiries to join the Digital Team.  This role has a strong customer service focus combined with general troubleshooting skills and acts as a liaison point between business units, project teams, and IT to resolve customer issues.Sydney, Melbourne or Perth. Open to other locations$81,396 - $85,659 (depending on experience) + 15.4% superannuationPermanent PositionApplications close at 11:59pmAEDT,Thursday 9 October 2025The teamThe Digital team supports business systems and processes that build excellence in regulatory operations.The team provides the user-centred design service and manages the ongoing development of the key platform underpinning the regulatory workflows across ASIC - the ASIC CRM, ASIC Regulatory Portal, ASIC Search and related data and document repositories, as well as ASIC's key externally facing digital channels such as the corporate website.The roleThe purpose of the Analyst within the Digital team is to manage enquiries related to OneASIC Regulatory systems, providing expert troubleshooting support.Responsibilities will include:Act as liaison between business units, project teams, and IT to resolve customer issuesEfficiently resolve or escalate issues with strong verbal communicationDocument technical issues and solutions clearlyManage external stakeholder interactions via the ASIC Regulatory PortalSupport stakeholder training and update learning materialsDrive process improvement and innovationAssist with system enhancements, new products, and releasesCreate clear, user-friendly release communications for non-technical audiencesBuild and maintain relationships with subject matter experts and stakeholdersAbout youA successful applicant should possess many or all of the following:Relevant degree or experience in customer and stakeholder engagementStrong stakeholder management and influencing skillsExcellent communication and issue resolution abilitiesSkilled in multitasking and prioritising in fast-paced settingsUnderstanding of business processes and user reviewsExperience analysing database information and providing solutionsEffective problem-solving and issue triage skillsTeam-oriented with strong collaboration experienceProficient in Microsoft Dynamics CRM, SharePoint, and similar systemsStrong customer service and issue resolution skillsEfficient task management with timely, quality outcomesView the position description for more information or click ‘apply' to start your application.Applications close at 11:59pm AEDT,Thursday 9 October 2025About ASICASIC's remit is one of the broadest of regulators across the world. ASIC regulates corporations, markets, financial services and consumer credit and monitors and promotes market integrity and consumer protection in the Australian financial system. Through our enforcement work, we hold to account those who contravene the law, working to achieve strong outcomes that address the greatest consumer and investor harms.ASIC is committed to providing a diverse and inclusive workplace where the very best talent in Australia chooses to work. Indigenous Australians are encouraged to apply as well as applicants from all backgrounds and with different abilities.We offer a range ofemployee benefitsincluding:Attractive superannuationAdditional leave entitlements50/50 hybrid work-from home modelFlexible work arrangementsAssistance for study and professional developmentClick here to view ASIC's salary and benefits guide.To read more about ASIC, you can visit our website or review our Corporate Plan.To work with us, you need to be an Australian citizen and be prepared to complete an ASIC Suitability and Baseline Assessment."
    },
    "extraction_time": "2025-09-26T16:32:54.004273"
  },
  {
    "job_url": "https://www.seek.com.au/job/87435704?type=standard&ref=search-standalone#sol=a50877dbf8183257e20bc8683deb5fc171bc3342",
    "raw_data_path": "data\\raw\\Unknown_Company_Product Business Analyst_87435704_20250926_163313",
    "parsed_data": {
      "seek_url": "https://www.seek.com.au/job/87435704?type=standard&ref=search-standalone#sol=a50877dbf8183257e20bc8683deb5fc171bc3342",
      "job_detail_title": "Product Business Analyst",
      "job_detail_location": "Perth WA(Hybrid)",
      "job_detail_classifications": "Business/Systems Analysts (Information & Communication Technology)",
      "job_detail_work_type": "Full time",
      "job_detail_salary": "",
      "jobAdDetails": "Want to deliver tech with purpose, with people who care?Join us in our mission to create solutions that help keep children safe online.Who we are?Headquartered in Perth, Australia, with offices globally, Qoria is an ASX listed global leader in child digital safety technology and services. We are a purpose-driven business, operating under the ‘Linewize’ brand in North America and Asia Pacific, the ‘Smoothwall’ brand in the UK, and the ‘Qoria’ brand in EMEA and Sri Lanka. Our solutions are utilised by schools, school districts, and parental communities to protect children from seeing harmful content online, identify children at risk based on their digital behaviours and ensure teachers maintain focus and safe learning in the digital classroom. 30.000 schools and 7 million parents depend on our solutions to keep 25 million children safe in 180 countries around the world.What’s the opportunity:We’re looking for aProduct Business Analystto help unify Qoria’s platform and deliver a seamless experience for our users. You’ll work across product, engineering, and operations to align priorities, streamline user journeys, and extend platform capabilities — ensuring every initiative delivers measurable business value.Here’s how you’ll do it:Act as a bridge between business goals and technical execution across squads in Australia, Sri Lanka, and beyond.Support product discovery, backlog management, and delivery planning for shared services and unified platform initiatives.Collaborate with stakeholders to validate needs, align workflows, and consolidate insights into actionable recommendations.Map systems and design user flows to simplify complex journeys across multiple products.Define success metrics, analyse impact, and share clear documentation to drive adoption of shared components across teams.Track and manage dependencies across product, operations, and engineering squads.What Success Looks LikeStakeholders trust you to turn complex challenges into clear, actionable solutions.You thrive in fast-paced environments and adapt quickly to change.You’re curious about user needs and outcomes, not just data flows.You’re proactive in exploring new tools (especially AI) to improve workflows.Teams adopt platform components with less ambiguity and friction.You spot risks and gaps early, keeping delivery on track.Every outcome maps to a measurable business or user need.What you’ll bring:5+ years’ experience as a Business Analyst, ideally in product, technical, or transformation roles.Strong collaboration skills with cross-functional and cross-regional teams.Proven stakeholder negotiation and conflict resolution experience.Confidence working with ambiguity, shifting requirements, and emerging technologies.Familiarity with agile methods (Scrum, Kanban, or hybrid).Ability to translate between business flows and technical systems.Excellent communication, documentation, and stakeholder management skills.Bonus: experience with platform teams, tools like Miro/Lucidchart, and systems like Jira, Confluence, or Airtable.Why Qoria?At Qoria, you’ll work on meaningful challenges that improve user experiences across our ecosystem. You’ll collaborate with talented teams across regions, grow your skills in product discovery and systems thinking, and make a real impact by driving unification and innovation at scale.In this role, you can expect:Employee stock optionsEnhanced holiday & family leaveTech Allowance.... and much moreMore importantly, you'll:Support tech with purpose...As a Product Business Analyst at Qoria, your work truly matters. With every customer interaction, you’ll be helping children stay safe online. It feels good to do good.With people who care...One of our values is ‘Care, Always’. Our Support Team lives and breathes that, every day. We also look after each other and help create a supportive environment for all.Through work that you love...Being a Business Analyst takes skill, energy and resilience. It can also be incredibly rewarding. Here, your efforts will be visible and you’ll love the impact you have.And a career that you own...A proven career path forward, with real opportunities to progress your career into other teams and departments within the company. Exposure to industry leading tech, developed in-house by an amazing engineering team. Regular company wide lunch and learn sessionsWe'd love to hear from you. Please submit your application if you would like to be considered for this opportunity."
    },
    "extraction_time": "2025-09-26T16:33:20.637771"
  },
  {
    "job_url": "https://www.seek.com.au/job/87440130?type=standard&ref=search-standalone#sol=d8826d41d2fdb08c3a50df2b1862af621b0e285b",
    "raw_data_path": "data\\raw\\Unknown_Company_Analyst_87440130_20250926_163312",
    "parsed_data": {
      "seek_url": "https://www.seek.com.au/job/87440130?type=standard&ref=search-standalone#sol=d8826d41d2fdb08c3a50df2b1862af621b0e285b",
      "job_detail_title": "Analyst",
      "job_detail_location": "Perth WA(Hybrid)",
      "job_detail_classifications": "Analysts (Consulting & Strategy)Government - Federal (Government & Defence)",
      "job_detail_work_type": "Contract/Temp",
      "job_detail_salary": "",
      "jobAdDetails": "At ASIC, you can be the change that ensures a fair, strong and efficient financial system for the benefit of all Australians. Contribute to delivering on ASIC's purpose, vision, and strategic priorities to help maintain the integrity of the financial system and protect consumers from harm.ASIC is seeking an Analyst - Business Engagement & Enquiries to join the Digital Team.  This role has a strong customer service focus combined with general troubleshooting skills and acts as a liaison point between business units, project teams, and IT to resolve customer issues.Sydney, Melbourne or Perth. Open to other locations$81,396 - $85,659 (depending on experience) + 15.4% superannuation12-month Fixed Term Contract positionApplications close at 11:59pmAEDT,Thursday 9 October 2025The teamThe Digital team supports business systems and processes that build excellence in regulatory operations.The team provides the user-centred design service and manages the ongoing development of the key platform underpinning the regulatory workflows across ASIC - the ASIC CRM, ASIC Regulatory Portal, ASIC Search and related data and document repositories, as well as ASIC's key externally facing digital channels such as the corporate website.The roleThe purpose of the Analyst within the Digital team is to manage enquiries related to OneASIC Regulatory systems, providing expert troubleshooting support.Responsibilities will include:Act as liaison between business units, project teams, and IT to resolve customer issuesEfficiently resolve or escalate issues with strong verbal communicationDocument technical issues and solutions clearlyManage external stakeholder interactions via the ASIC Regulatory PortalSupport stakeholder training and update learning materialsDrive process improvement and innovationAssist with system enhancements, new products, and releasesCreate clear, user-friendly release communications for non-technical audiencesBuild and maintain relationships with subject matter experts and stakeholdersAbout youA successful applicant should possess many or all of the following:Relevant degree or experience in customer and stakeholder engagementStrong stakeholder management and influencing skillsExcellent communication and issue resolution abilitiesSkilled in multitasking and prioritising in fast-paced settingsUnderstanding of business processes and user reviewsExperience analysing database information and providing solutionsEffective problem-solving and issue triage skillsTeam-oriented with strong collaboration experienceProficient in Microsoft Dynamics CRM, SharePoint, and similar systemsStrong customer service and issue resolution skillsEfficient task management with timely, quality outcomesView the position description for more information or click ‘apply' to start your application.Applications close at 11:59pm AEDT,Thursday 9 October 2025About ASICASIC's remit is one of the broadest of regulators across the world. ASIC regulates corporations, markets, financial services and consumer credit and monitors and promotes market integrity and consumer protection in the Australian financial system. Through our enforcement work, we hold to account those who contravene the law, working to achieve strong outcomes that address the greatest consumer and investor harms.ASIC is committed to providing a diverse and inclusive workplace where the very best talent in Australia chooses to work. Indigenous Australians are encouraged to apply as well as applicants from all backgrounds and with different abilities.We offer a range ofemployee benefitsincluding:Attractive superannuationAdditional leave entitlements50/50 hybrid work-from home modelFlexible work arrangementsAssistance for study and professional developmentClick here to view ASIC's salary and benefits guide.To read more about ASIC, you can visit our website or review our Corporate Plan.To work with us, you need to be an Australian citizen and be prepared to complete an ASIC Suitability and Baseline Assessment."
    },
    "extraction_time": "2025-09-26T16:33:20.255748"
  },
  {
    "job_url": "https://www.seek.com.au/job/86839469?type=standard&ref=search-standalone#sol=ed7f8af5ea532ccc46f3dce71a1c3f531173432b",
    "raw_data_path": "data\\raw\\Unknown_Company_Business Analyst_86839469_20250926_163309",
    "parsed_data": {
      "seek_url": "https://www.seek.com.au/job/86839469?type=standard&ref=search-standalone#sol=ed7f8af5ea532ccc46f3dce71a1c3f531173432b",
      "job_detail_title": "Business Analyst",
      "job_detail_location": "Perth WA",
      "job_detail_classifications": "Business/Systems Analysts (Information & Communication Technology)",
      "job_detail_work_type": "Full time",
      "job_detail_salary": "$100k-$120k+Super",
      "jobAdDetails": "Business Analyst opportunity offering great career progression in a meaningful organisationYour new companyJoin a respected not-for-profit organisation with a long-standing presence in Western Australia, known for its commitment to community impact and operational excellence. Based close to Central Perth, this organisation is undergoing a digital transformation and is seeking a skilled Business Analyst to support strategic initiatives and drive process innovation.Your new roleAs a Business & Process Analyst, you will play a pivotal role in bridging business needs with technology solutions. You'll work across departments to analyse current processes, identify inefficiencies, and implement improvements that enhance system usage and user experience. This role offers a unique opportunity to contribute to meaningful change in a purpose-driven environment.Key Responsibilities:Analyse and improve business processes in collaboration with cross-functional teams.Enhance digital systems, including CRM, HR, and finance platforms.Deliver insights through data analysis and reporting (e.g., Power BI).Facilitate stakeholder workshops and gather business requirements.Support project tracking, reporting, and risk management.Provide executive-level reporting and strategic analysis.What you'll need to succeedEssential:3+ years' experience in business analysis, working across the full project lifecycleStrong skills in process modelling, system analysis, and stakeholder engagement at all levels of the businessDesirable:Experience with Power BI, Tableau, or similar tools.Familiarity with a variety of IT platforms such as CRMs, CMS & HCMBusiness Analysis certification (e.g., CBAP, PMI-PBA).Exposure to Agile/Scrum methodologies.What you'll get in returnIn return, you will receive a salary of $100k-$120k+Super alongside great additional benefits, and a role offering great career progression within a meaningful organisation.What you need to do nowIf you're interested in this role, click 'apply now' to forward an up-to-date copy of your CV, or call us now.If this job isn't quite right for you, but you are looking for a new position, please contact us for a confidential discussion on your career."
    },
    "extraction_time": "2025-09-26T16:33:17.211259"
  },
  {
    "job_url": "https://www.seek.com.au/job/87296353?type=standard&ref=search-standalone#sol=589784c5cb23ab0236132a5c86c419e6644a072b",
    "raw_data_path": "data\\raw\\Unknown_Company_Business Intelligence Analyst _87296353_20250926_163340",
    "parsed_data": {
      "seek_url": "https://www.seek.com.au/job/87296353?type=standard&ref=search-standalone#sol=589784c5cb23ab0236132a5c86c419e6644a072b",
      "job_detail_title": "Business Intelligence Analyst - Splunk",
      "job_detail_location": "Perth WA",
      "job_detail_classifications": "Business/Systems Analysts (Information & Communication Technology)",
      "job_detail_work_type": "Contract/Temp",
      "job_detail_salary": "plus super",
      "jobAdDetails": "A leading mining organisation is seeking a Business Intelligence Analyst with strong Splunk expertise to join their team on a 12-month contract. This role is focused on delivering meaningful insights to business functions by monitoring, analysing, and reporting on data through Splunk.About the RoleMonitor and respond to Splunk alerts, logs, and data outputs.Develop and maintain dashboards, reports, and visualisations to support business decision-making.Partner with operations, commercial, and functional teams to understand reporting requirements.Translate data into actionable business intelligence and recommendations.Contribute to continuous improvement of BI processes and data quality.About YouProven experience in business intelligence, data analysis, or reporting.Strong hands-on knowledge of Splunk for analytics, dashboards, and alerting.Ability to engage with stakeholders across multiple business units.Excellent problem-solving skills and attention to detail.Strong communication and presentation abilities.What's on Offer12-month contract with potential for extension.Work with a major mining organisation on enterprise-scale initiatives.Competitive daily rate.Perth-based role with exposure to leading-edge data environments.If you are an experienced Business Intelligence Analyst with Splunk expertise and are looking to contribute to a high-profile mining project, we encourage you to apply.Apply now to register your interest."
    },
    "extraction_time": "2025-09-26T16:33:47.456724"
  },
  {
    "job_url": "https://www.seek.com.au/job/86778065?type=standard&ref=search-standalone#sol=b4e09985462494a819591fd411297d270fae6737",
    "raw_data_path": "data\\raw\\Unknown_Company_Business Analyst_86778065_20250926_163339",
    "parsed_data": {
      "seek_url": "https://www.seek.com.au/job/86778065?type=standard&ref=search-standalone#sol=b4e09985462494a819591fd411297d270fae6737",
      "job_detail_title": "Business Analyst",
      "job_detail_location": "Osborne Park, Perth WA",
      "job_detail_classifications": "Business/Systems Analysts (Information & Communication Technology)",
      "job_detail_work_type": "Full time",
      "job_detail_salary": "",
      "jobAdDetails": "IMC is a diversified contractor to the WA resources market with, offering Civil, Mining and Crushing and Screening products to a diverse range of Tier 1 clients across the commodities spectrum including Oil and Gas, Iron Ore and Gold.THE ROLEAs a Business Analyst at IMC, you will lead improvement projects, streamline data recording, and design analytics to drive better business outcomes. Working closely with the Manager – Systems & Innovation, you will play a key role in boosting overall business performance.IMC fosters continual development of technical abilities, project management skills and business improvement knowledge. We are determined to be an organisation with a difference. Apply now to be part of our innovative, growing organisation that thrives on moving fast and thinking outside the box.Primary ActivitiesProject Management:Task coordination: Organizing and assigning tasks across functional groups, tracking completion and alignment with project goals.Progress tracking: Monitoring project milestones, updating stakeholders, and addressing any issues that arise to keep the project on schedule.Resource management: Allocating resources efficiently, managing project budgets, and ensuring optimal use of available tools and personnel.Data Analytics:Data collection and analysis: Designing and improving our systems that collect, collate and analyse information.Reporting: Creating detailed reports and visualizations to communicate findings to stakeholders and support strategic planning.Tool utilisation: Using data analytics tools and software to automate processes, enhance accuracy, and streamline data workflows.ERP Optimisation:System optimisation: Enhancing the use of our ERP Pronto by identifying and implementing improvements and building consensus for change.Data integration: Ensuring seamless data flow between Pronto modules and other systems to provide comprehensive insights and support decision-making.User training and support: Providing training and ongoing support to users to maximize the effectiveness of Pronto.Requirements:Degree in a relevant discipline (e.g. Project Management, Commerce, Computer Science)Experience with ERPs, auxiliary platforms and reporting software.Experience leading small to mid-scale software improvement projects.Strong problem-solving abilities.Excellent communication skills.Desirable:Experience with Pronto Xi, Sharepoint and/or PowerBi App/Report Development.Advanced degrees or certifications in Business Analysis, Data Analytics, or Project Management (e.g., Prince2, CBAP, PMP, Agile methodologies).Experience in the Mining or Construction Industry."
    },
    "extraction_time": "2025-09-26T16:33:45.264805"
  },
  {
    "job_url": "https://www.seek.com.au/job/87357567?type=standard&ref=search-standalone#sol=ba06260a80e29e566b0156651200ae7304aa7a44",
    "raw_data_path": "data\\raw\\Unknown_Company_Digital Business Analyst_87357567_20250926_163339",
    "parsed_data": {
      "seek_url": "https://www.seek.com.au/job/87357567?type=standard&ref=search-standalone#sol=ba06260a80e29e566b0156651200ae7304aa7a44",
      "job_detail_title": "Digital Business Analyst",
      "job_detail_location": "Perth WA",
      "job_detail_classifications": "Business/Systems Analysts (Information & Communication Technology)",
      "job_detail_work_type": "Full time",
      "job_detail_salary": "$120457 - $132753 p.a.",
      "jobAdDetails": "Our client GESB is seeking a skilled and proactive Digital Business Analyst to join their Digital team; part of the Member Experience business unit. This is an opportunity to directly contribute to a positive member experience by providing members with relevant information, products, and tools to help them on their retirement journey.The mission of the Digital team is to provide solutions that prioritise usability across all digital channels, helping members effortlessly find information, interact and transact, and make informed decisions to achieve a quality retirement. As part of this team, you will drive continuous improvement by building strong, trust-based relationships with diverse stakeholders, collaborating effectively in agile, cross-functional teams, and taking ownership of tasks to deliver accurate outcomes with initiative and sound judgement.As the Digital Business Analyst, you will bring:A strong understanding of modern digital frameworks and methodologies, including Scrum, Kanban, Lean, Design Thinking, Human-Centred Design, multivariate testing, process mapping, flow charting, continuous improvement, test automation and moreA proven ability to communicate requirements clearly and effectively- both verbally and through user stories - with logical and clear acceptance criteria, that are easily understood by developers, testers and stakeholdersLead digital product and journey optimisation:analyse data, translate business needs into actionable digital solutions, and ensure products meet high standards of qualityEnhance user experience:use your knowledge of UI/UX, accessibility standards (like WCAG), and modern digital frameworks (like Design Thinking and Human-Centred Design) to improve the member experienceDrive data-informed decisions:use digital analytics to identify opportunities for improvement and inform product developmentStrong problem-solving skills,with the ability to lead the resolution of complex strategic challenges, work autonomously, and proactively communicate with stakeholdersSolid experience in digital analytics or business intelligence (BI) tools, including the ability to generate and interpret reports, compare data sets, and extract meaningful insightsExperience with content management systems(CMS),mobile app ecosystems(IOS/Android), and a solid understanding ofSearch Engine Optimisation (SEO), App StoreOptimisation (ASO)and web/mobile analytics toolsWork-Related Requirementsz:Experience:4+ years as a Digital Business Analyst or in a similar role. Experience in financial services is desirableTechnical skills:a strong understanding of modern digital frameworks like Scrum and Kanban. You should have solid experience with digital analytics or business intelligence tools and practical knowledge of CMS, mobile app ecosystems, SEO, and ASOProblem-solving:proven ability to solve complex strategic challenges and work autonomouslyCommunication:excellent verbal and written communication skills, including the ability to write clear user stories with logical acceptance criteriaCollaboration:demonstrated ability to build strong, trust-based relationships with a diverse range of internal and external stakeholders, supporting effective collaboration within cross-functional agile teams to deliver value iteratively and in alignment with business prioritiesMindset & Initiative:proactive, personable, and solutions-focused, with a well-rounded knowledge base and a strong sense of ownership-consistently delivering accurate outcomes with minimal supervision through sound judgment and initiative is essentialAt Randstad Digital, we are passionate about providing equal employment opportunities and embracing diversity to the benefit of all. We actively encourage applications from any background."
    },
    "extraction_time": "2025-09-26T16:33:44.405618"
  },
  {
    "job_url": "https://www.seek.com.au/job/87448506?type=standard&ref=search-standalone#sol=12d4c7056a948c7cf9bf5a6edf0740800b463edf",
    "raw_data_path": "data\\raw\\Unknown_Company_IT Business Analyst_87448506_20250926_163405",
    "parsed_data": {
      "seek_url": "https://www.seek.com.au/job/87448506?type=standard&ref=search-standalone#sol=12d4c7056a948c7cf9bf5a6edf0740800b463edf",
      "job_detail_title": "IT Business Analyst",
      "job_detail_location": "Welshpool, Perth WA",
      "job_detail_classifications": "Business/Systems Analysts (Information & Communication Technology)",
      "job_detail_work_type": "Full time",
      "job_detail_salary": "",
      "jobAdDetails": "Title: Drive Your Career with Centurion:Seeking IT Business AnalystCompany Overview:Centurion is a premier logistics company with a long-standing reputation for excellence in transportation services across Australia. Founded in 1971, our business provides nationwide service with 34 branches across Western Australia, Queensland, Northern Territory, South Australia and Victoria.We’re currently expanding our team and looking forIT Business Analystto join us in delivering quality service to our customers.PositionAvailable: IT Business AnalystLocation: Welshpool , WAAbout the Role:We are seeking a dedicated professional to manage incoming and outgoing communications, provide exceptional customer service, and direct administrative activities in the IT team while learning and growing their experience in the transport and logistics industry. If you’re ready to contribute to a dynamic team, we want to hear from you!Key Responsibilities:Map out existing business processes and identify opportunities for improvement with a focus on efficiency.Develop and maintain a detailed understanding of our systems, processes, and data requirements.Analyse current business processes to identify areas for improvement, focusing on streamlining workflows and boosting efficiency.Maintain in-depth understanding of systems, processes, and data requirements, ensuring documentation is up-to-date.Reverse engineer software to refine logic and enhance system performance and reliability.Act as a liaison for new feature requests, prioritizing and communicating requirements to development teams.Evaluate off-the-shelf and custom solutions to meet business needs, considering cost and scalability.Drive adoption of new processes and systems, addressing concerns and providing support during implementation.Skills and Experience:Previous experience in a similar IT Business Analyst role (5 years minimum)Tertiary degree level qualifications in IT or related fieldAdvanced knowledge & troubleshooting of networking and systemsProcess mapping and Business Process ImprovementChange Management and Stakeholder CommunicationsExcellent verbal and written communication skills, essential for interacting with various stakeholders.Aptitude for identifying issues and developing solutions to address challenges in day-to-day operations.Why Join Centurion?Competitive pay rates and benefits packageOpportunities for career advancement and professional development.Supportive and collaborative team environment.Benefits including health insurance discounts.Be part of a company that values safety, integrity, and excellence.How to Apply:Ready to drive your career forward with Centurion? If you feel you have the experience, ability, and skills to take the next step with your career within Centurion, we want to hear from you. Click Apply now. For more information, please contactrecruitment@centurion.net.auDon't miss out on this exciting opportunity to join a leader in the transportation industry! We are an Equal Opportunity employer, and we encourage applications from women and First Nations People.Please note that we do not accept applications from recruitment agencies. Direct applicants only."
    },
    "extraction_time": "2025-09-26T16:34:13.186319"
  },
  {
    "job_url": "https://www.seek.com.au/job/87432760?type=standard&ref=search-standalone#sol=381b05434a390ed32f81c053fe0bd7d832ac3b18",
    "raw_data_path": "data\\raw\\Unknown_Company_Graduate Analyst_87432760_20250926_163407",
    "parsed_data": {
      "seek_url": "https://www.seek.com.au/job/87432760?type=standard&ref=search-standalone#sol=381b05434a390ed32f81c053fe0bd7d832ac3b18",
      "job_detail_title": "Graduate Analyst",
      "job_detail_location": "Bentley, Perth WA",
      "job_detail_classifications": "Analysts (Consulting & Strategy)Other (Education & Training)",
      "job_detail_work_type": "Full time",
      "job_detail_salary": "",
      "jobAdDetails": "Reference Number:1093136About the Role:Curtin University has a great opportunity for a passionate graduate analyst to join theOffice of Strategy and Planning. This will support the delivery of strategic planning and projects, market analysis, performance reporting, market research, and other analytics-related activities.As a Graduate Analyst, you will play a key role in supporting the University’s strategic decision-making processes. You'll work across various high-impact projects and initiatives that shape Curtin's direction and enhance our performance. This role is perfect for graduates who are curious, analytical, and eager to contribute to projects that make a difference.Your responsibilities will include:Conducting market reviews and environmental scans to understand customer behaviour and support targeted decision-making.Analysing performance data to uncover trends, patterns, and key insights.Supporting faculties, schools, and other stakeholders with strategic planning and reporting.Collaborating on cross-functional projects to address strategic priorities.Identifying and recommending opportunities for continuous improvement to enhance service delivery and the student experience.Who we are looking for/Selection Criteria:A recently completed degree in Commerce, Data Science or a related field.Strong analytical and critical thinking skills, with the ability to interpret and triangulate data from multiple sources.Excellent research capabilities and attention to detail.A flexible, proactive approach and a willingness to learn.Outstanding communication and stakeholder engagement skills.A genuine interest in strategy, planning, and data-driven decision-making.Role Requirements:As this is a fixed-term contract, you will require current work rights in Australia that match the tenure of this role.Successful applicants are subject to a National Police Clearance, and background, integrity, and reference checks to Curtin’s satisfaction.About Curtin UniversityCurtin University proudly stands among the top one percent of global universities according to the ARWU 2024 rankings. We are an energetic, dedicated team of academics and professionals working together to provide global solutions through quality graduates and innovative research. Curtin is a welcoming space where integrity, respect for one another, courage, excellence, and impact are essential to everyday life. First Nations people, those identifying as LGBTQIA+, parents, carers, people of all ages, abilities and genders, and people of diverse ethnicity, nationality and faith are encouraged to apply. Our aim is to create a workforce that reflects the diversity of the community in which we live. For more information, please visit our Diversity and Inclusion page - https://staff.curtin.edu.au/discover-curtin/diversity-equity-and-inclusion-at-curtin/What We Offer You:Situated on Whadjuk Nyungar Country, our vibrant Bentley campus includes an art gallery, gym, childcare and medical centre, bus station, accessible parking and endless food options including a supermarket. Aside from the vibrant campus life, we offer more than just a job. Curtin offers a wide range of generous benefits, including additional leave, salary packaging, health and wellbeing services and an array of discounts for retail, travel and much more.For more reasons to work at Curtin, please visit https://staff.curtin.edu.au/discover-curtin/Join Us!If this sounds like your next role, please click APPLY NOW ensuring to attach the following documents:Up to date resumeCover Letter outlining your interest, experience and addressing the selection criteria for the role(no more than two pages)If you have any queries in relation to this opportunity or the application process, please contact our careers team onCurtinCareers@curtin.edu.auor08 9266 9000(option 3,1), quoting the reference number. Please note applications will not be accepted via this email address.Applications close: Wednesday, 8th October 2025.Disclaimer: Please note that there is no standardised time for the closing of adverts on the specified date. Therefore, we recommend submitting your application ahead of this deadline. Late applications will not be considered, and only successful candidates will be contacted.Please note we are not accepting applications from recruitment agencies at this time.Curtin reserves the right at its sole discretion to withdraw from the recruitment process, not to make an appointment, or to appoint by invitation, at any time. We reserve the right to remove the advert earlier than the date on the advert."
    },
    "extraction_time": "2025-09-26T16:34:13.373349"
  },
  {
    "job_url": "https://www.seek.com.au/job/87160424?type=standard&ref=search-standalone#sol=9b58bc321f31e62e709b09b3d2bc29e5d8846be1",
    "raw_data_path": "data\\raw\\Unknown_Company_Senior Business Analyst_87160424_20250926_163407",
    "parsed_data": {
      "seek_url": "https://www.seek.com.au/job/87160424?type=standard&ref=search-standalone#sol=9b58bc321f31e62e709b09b3d2bc29e5d8846be1",
      "job_detail_title": "Senior Business Analyst",
      "job_detail_location": "West Perth, Perth WA(Hybrid)",
      "job_detail_classifications": "Business/Systems Analysts (Information & Communication Technology)",
      "job_detail_work_type": "Contract/Temp",
      "job_detail_salary": "",
      "jobAdDetails": "We are seeking a Senior Business Analyst to join our dynamic and collaborative Business analysis team. You will be supporting the successful management and delivery of complex projects and initiatives including the identification, assessment, implementation and embedding of fit-for purpose solutions. This role is initially being offered as a 12-month max term contract. We recognise the value of and embrace flexible and hybrid work arrangements.What will you be doing?Collaborating with external or group wide specialists to facilitate ideation, requirement gathering, design and delivery of initiatives.Generating insights, identifying key and emerging trends and issues relating to delivering strategy and underpinning capabilities.Analysing, modelling and determining appropriate approaches to improve member experience and operational efficiency.Providing data-driven recommendations on the improvement of systems and processes, measuring success of implementation and sharing key lessons learned.Supporting the capability uplift of in relation to regulation changes across the business.Developing and expanding continuous improvement toolkit and collateral to ensure reusability and adoption across the business.What are we looking for in you?Experience with business requirements elicitation, analysis, workshop facilitation and supporting business case development.Significant Business Analyst experience, ideally within a similar size organisation.Experience working on compliance focused projects, highly advantageous.Proven track record of translating highly technical and detailed data into user-friendly documentation and recommendations based on the data.Excellent commercial acumen and the ability to think strategically and identify and mitigate risks to the program as well as opportunities.Strong conceptual, financial, analytical, interpretive and problem-solving skills.Collaborates effectively with other teams across the organisation, demonstrating understanding around what motivates and challenges colleagues in different areas.Demonstrated experience establishing and working in small, multidisciplinary, entrepreneurial and adaptive teams of internal and external resources.Ability to build rapport and maintain professional relationships with all stakeholders.Strong ability to generate data insights and translate into practical business recommendations.Analytical and creative problem-solving skills, with keen attention to detail.Experience working in a team-oriented and collaborative project delivery environment.What can we offer you?A workplace culture where our people feel valued, respected and empowered.Work in flexible ways that meet work/life commitments and support wellbeing.Join a connected and engaged Project delivery team, that shares best practise.Be part of a purpose led organisation that gives back to the WA communityAn environment that values ongoing career development.Free Roadside Assistance and discounts on RAC products and services including Insurance, Holiday Parks and Resorts, Security, Finance and Auto Services.Opportunities for community engagement and corporate volunteering."
    },
    "extraction_time": "2025-09-26T16:34:13.048206"
  },
  {
    "job_url": "https://www.seek.com.au/job/87005107?type=standard&ref=search-standalone#sol=fd5eba0a195299aa51c5aabb3d0ef3f64bbf8fd4",
    "raw_data_path": "data\\raw\\Unknown_Company_Functional Analyst_87005107_20250926_163431",
    "parsed_data": {
      "seek_url": "https://www.seek.com.au/job/87005107?type=standard&ref=search-standalone#sol=fd5eba0a195299aa51c5aabb3d0ef3f64bbf8fd4",
      "job_detail_title": "Functional Analyst",
      "job_detail_location": "Perth WA",
      "job_detail_classifications": "Business/Systems Analysts (Information & Communication Technology)",
      "job_detail_work_type": "Contract/Temp",
      "job_detail_salary": "",
      "jobAdDetails": "We are seeking an experiencedFunctional Analystto lead the documentation and analysis of business operations for a large organization preparing to adopt HubSpot CRM.This contract role will be responsible for conducting in-depth discovery with department heads and operational staff, mapping current processes and systems, and designing a future-state operational blueprint aligned with the client's digital transformation goals.You will collaborate with a remote Business Analyst and report directly to the project director. Your work will directly contribute to the solution architecture and phased implementation roadmap.🛠️Key Responsibilities:Lead structured interviews and discovery sessions across all dealership departments (sales, service, finance, admin, marketing)Document current-state business processes, including workflows, applications used, reports generated, and approval flowsCollect artefacts such as report samples, system screenshots, and data collection formsMap business processes to current applications and identify pain points or automation opportunitiesValidate findings with department heads and executive stakeholdersCollaborate with the remote Business Analyst to assemble a comprehensive Business Process Documentation PackProvide insights and input into the solution architecture and CRM planning team✅Key Deliverables:Process maps (as-is) and departmental workflowsFunctional overview of applications and reports per processDepartmental summaries (objectives, KPIs, systems used)Gap analysis highlighting inefficiencies or manual workaroundsContribution to a final business process documentation and CRM readiness report👤About You:Demonstrated experience in business process consulting, business analysis, or ERP/CRM transformation projectsPrior experience in automotive, retail, franchise, or dealership environments highly desirableStrong ability to engage stakeholders from front-line staff to executive levelExpertise in business process mapping using BPMN, flowcharts, or similar methodologiesConfident facilitating interviews and workshops in live environmentsFamiliarity with CRM platforms (HubSpot, Salesforce, etc.) is a strong advantageExcellent verbal and written communication skillsSelf-driven and comfortable working independently with remote supportMinimum 3-5 years of demonstrated experience in business process consulting, business analysis, or ERP/CRM transformation projectsEssential: Business process mapping expertise. Desirable: CRM platform familiarity and automotive industry experience🎓Qualifications:Tertiary qualifications in Business, Information Systems, or related fieldFormal training in business process modelling (BPMN, Lean Six Sigma, etc.) is a plusFull working rights in Australia (citizenship, permanent residency, or valid work visa)Tertiary qualifications in Business, Information Systems, or related field (or equivalent professional experience)💼Contract Details:Duration: 3 - 5 weeksStart Date: Immediate or within 2 weeksLocation: Primarily On-site at client premises (travel within metro area may be required)Competitive daily rate based on experienceABN contractors welcome📩How to Apply:Submit your CV and a short cover letter outlining your relevant experience and availability."
    },
    "extraction_time": "2025-09-26T16:34:36.050991"
  },
  {
    "job_url": "https://www.seek.com.au/job/87457596?type=standard&ref=search-standalone#sol=8bafa66afa2d6267e15b89b29df596e4a3b6d2b9",
    "raw_data_path": "data\\raw\\Unknown_Company_Business Analyst_87457596_20250926_163431",
    "parsed_data": {
      "seek_url": "https://www.seek.com.au/job/87457596?type=standard&ref=search-standalone#sol=8bafa66afa2d6267e15b89b29df596e4a3b6d2b9",
      "job_detail_title": "Business Analyst",
      "job_detail_location": "Fremantle, Perth WA",
      "job_detail_classifications": "Business/Systems Analysts (Information & Communication Technology)",
      "job_detail_work_type": "Contract/Temp",
      "job_detail_salary": "Market rates",
      "jobAdDetails": "Business AnalystHRMIS and  Payroll Systems Implementation6 months contractTwo roles availableAre you an experienced Business Analyst with a passion for delivering impactful payroll and HRIS transformation projects? We’re seeking a proactive and detail-oriented professional to join a high-performing team driving the successful implementation of a new payroll system.About the RoleReporting to the Projects & Business Systems Manager, you will play a pivotal role in the Payroll Replacement Project. This is a hands-on position focused on gathering and analysing business requirements, evaluating existing payroll processes, and supporting the configuration and rollout of a new payroll solution.Key Responsibilities:Lead business analysis activities across HR, Payroll and HRMIS transformation initiatives.Collaborate with HR  and Payroll teams to understand current workflows and identify improvement opportunities.Document business requirements, process maps, and functional specifications.Support the implementation of HR for Dynamics and other HRIS platforms.Ensure alignment between business needs and technical solutions.Facilitate workshops, interviews, and focus groups to elicit and validate business requirements.Translate high-level business concepts into actionable technical workplans.Document business processes using BPMN and BABOK-aligned frameworks.Support UAT planning, defect management, and production rollout activities.Provide expert advice on system options and enhancements to meet business needs.Key Experience:Proven experience as a Business Analyst in HR, ERP, or payroll-related projects.Strong understanding of business analysis methodologies (BABOK) and process mapping (BPMN).Proficient in data analysis using Excel, SQL, and reporting tools such as Power BI.Exceptional documentation skills – BRDs, FRDs, SOPs, UAT scripts.Excellent stakeholder engagement and communication capabilities.Experience working in Agile environments and supporting change management initiatives.What’s on OfferOpportunity to lead a high-impact HRMIS and payroll transformation project.Collaborative team environment with strong leadership support.If you possess the required experience and are interested, please apply now via the link below to be considered.Contact: Lisa Williams -(08) 9423 1429- (Job reference: 268316)"
    },
    "extraction_time": "2025-09-26T16:34:35.837164"
  },
  {
    "job_url": "https://www.seek.com.au/job/87472204?type=standard&ref=search-standalone#sol=8eb1a960c2b09fd10fdf4b2ce7e825a8d0d201df",
    "raw_data_path": "data\\raw\\Unknown_Company_Business Analyst_87472204_20250926_163428",
    "parsed_data": {
      "seek_url": "https://www.seek.com.au/job/87472204?type=standard&ref=search-standalone#sol=8eb1a960c2b09fd10fdf4b2ce7e825a8d0d201df",
      "job_detail_title": "Business Analyst",
      "job_detail_location": "Osborne Park, Perth WA",
      "job_detail_classifications": "Business/Systems Analysts (Information & Communication Technology)",
      "job_detail_work_type": "Full time",
      "job_detail_salary": "",
      "jobAdDetails": "About the RoleWe are seeking a highly experienced and results-driven Senior Business Analyst with experience in Project Management to lead and support our end-to-end Human Capital Management (HCM) transformation initiatives. This dual-role position is ideal for a professional who thrives in dynamic environments, combining strategic business analysis with hands-on project management to deliver scalable and effective HCM solutions.What you’ll do:Lead the planning, execution, and successful delivery of all HCM transformation & supporting projects.Partner with HR, IT, and business stakeholders to gather, define, and validate requirements that align with strategic objectives.Conduct current-state assessments and gap analyses to inform future-state process design.Translate business needs into clear functional and technical specifications.Manage project timelines, budgets, milestones, risks, and interdependencies.Facilitate workshops, design sessions, and steering committee updates to drive alignment and decision-making.Drive organizational change management efforts to ensure smooth adoption of new systems and processes.Coordinate and oversee user acceptance testing (UAT) and training efforts.Maintain accurate and up-to-date project documentation, process maps, and business cases.Ensure all transformation efforts meet compliance, data governance, and security requirements.About YouA number of years experience  in business analysis and project management, with a strong focus on HCM systems and transformations.Proven success in leading full-cycle HRIS implementations or enhancements.Expertise in leading HCM platforms such as Workday, SAP SuccessFactors, or Oracle HCM Cloud.Strong understanding of core HR functions including talent management, payroll, learning, and workforce planning.Outstanding communication and stakeholder management abilities.Relevant qualifications in Project ManagementAbility to manage competing priorities and adapt to changing project demands.Experience with HRIS configuration, testing, data migration, and troubleshooting.What's on offer:Exposure to cutting-edge technologies and forward-thinking solutionsA results-driven, dynamic technology team environmentOngoing opportunities for professional development and growthApply nowShortlisting will begin immediately, hit 'Apply Now' or email a copy of your CV."
    },
    "extraction_time": "2025-09-26T16:34:33.986116"
  },
  {
    "job_url": "https://www.seek.com.au/job/86958103?type=standard&ref=search-standalone#sol=f7b56099249a39fb7be92ce0c876031fba9a1ad0",
    "raw_data_path": "data\\raw\\Unknown_Company_Technical Business Analyst_86958103_20250926_163455",
    "parsed_data": {
      "seek_url": "https://www.seek.com.au/job/86958103?type=standard&ref=search-standalone#sol=f7b56099249a39fb7be92ce0c876031fba9a1ad0",
      "job_detail_title": "Technical Business Analyst",
      "job_detail_location": "Perth WA",
      "job_detail_classifications": "Business/Systems Analysts (Information & Communication Technology)",
      "job_detail_work_type": "Full time",
      "job_detail_salary": "$143,170 per year",
      "jobAdDetails": "About Southern PortsSouthern Ports manages the three gateway ports of Albany, Bunbury and Esperance, and facilitates trade through the commercial management of efficient, safe, sustainable, and customer-focused ports. Our three regional ports play a vital role in connecting Western Australia with world markets. It is our belief that strong regional ports lead to strong regions, and that results in economic and social benefits for the communities across the regions we serve. Our people are our greatest asset, and we are committed to supporting our teams and building a diverse and capable workforce that is geared to meet the current and future needs of our customers and the sustainability of our ports.Benefits of Joining Southern PortsJoining Southern Ports Authority comes with numerous benefits that cater to a wide range of professional and personal needs, some examples being:Flexible Working Arrangements: Enjoy a work-life balance that suits your lifestyle and personal commitments.Annual Health and Well-being Benefits: Take advantage of programs and resources aimed at maintaining your physical and mental health.Salary Sacrificing Options: Maximise your take-home pay through tailored salary packaging arrangements such as Novated Car Leasing and SuperannuationOpportunity to Travel: Experience different geographical regions in Western Australia, enhancing your professional and personal growth.Generous Purchase Leave Options: Gain additional leave options to suit your personal needs and preferences.Salary range:$143,170 + superannuation + regional allowance if based regionally.The RoleSouthern Ports is recruiting a Technical Business Analyst for a fixed term period of 12 months to join their team in Perth, Bunbury, Albany or Esperance. Reporting to the Business Systems Lead, the Technical Business Analyst will be responsible for leading complex business analysis, managing enterprise systems, and supporting the implementation of technology solutions through configuration and administration. The role works closely with stakeholders to ensure systems meet business needs, facilitates change management activities, and drives process improvements. It combines strong analytical skills with technical expertise to deliver practical, high-impact outcomes across the organisation.Key Duties and ResponsibilitiesLead the identification, analysis, and documentation of business requirements across multiple business unitsTranslate business needs into technical specifications and solution designsFacilitate workshops and stakeholder interviews to elicit high-level and detailed requirementsConfiguration, administration, support and optimisation of business systems and platformsDevelop and execute change management plans including communications, training, and stakeholder engagementPerform data analysis to support business decisions and identify trends, risks, and opportunitiesIdentify inefficiencies in business processes and recommend improvementsSupport project planning, scoping, and delivery within project frameworksEnsure business analysis deliverables meet governance and compliance standardsThe ExpertiseMinimum five years’ in business analysis roles, with at least 2 years in a technical or systems-focused capacityDemonstrated experience in configuring and administering enterprise systems or platformsProven track record in leading business analysis activities across multiple projects or programsExperience supporting change management and business readiness activitiesUnderstanding of data structures, reporting tools, and business intelligence conceptsExperience with WHSE systems (user, configuration, administration, and reporting)Understanding of WHSE processes, including hazard management, incident reporting, and investigation workflowsTo see the PD for this role, please copy and paste the below link into your browser:https://www.dropbox.com/scl/fi/q7bdhmabdbmhmdghpm42u/Technology-Technical-Business-Analyst-Position-Description.pdf?rlkey=furm313ikit0pmbw5xnyn0734&st=e63o0y68&dl=0https://www.dropbox.com/scl/fi/5n4q812x3w52d4qwfrgk1/Southern-Ports-Administration-and-Specialist-Services-Agreement.pdf?rlkey=hor30z9u0ae54qtyonli0uaxj&st=a4vutnwj&dl=0RequirementsTo apply, please submit your application through our advertisement. Ensure you include an up-to-date resume with a one-page cover letter.To be eligible for this role, applicants must provide proof of Australian citizenship or permanent residency.The successful applicant must:Have a current Australian driver’s licenceBe able to obtain and maintain a Maritime Security Identification CardPass a pre-employment medical assessment including drug and alcohol testingProvide a National Police Certificate that is within a 6-month period.Southern Ports is proud to be an Equal Employment Opportunity employer and does not discriminate against race, gender, age, religion, sexual preference or disability. We encourage applications from all culturally diverse backgrounds, Indigenous Australians and Non-Indigenous Australians. Southern Ports is committed to creating and maintaining an inclusive and impartial workplace with equal opportunities for all employees.Applications close COB 4th October 2025. We reserve the right to commence the recruitment process during the application period."
    },
    "extraction_time": "2025-09-26T16:35:01.014303"
  },
  {
    "job_url": "https://www.seek.com.au/job/87228805?type=standard&ref=search-standalone#sol=6b16ae781110513c89c8eb69979e63dbf1cf39f9",
    "raw_data_path": "data\\raw\\Unknown_Company_Experienced Data Analyst  Pyth_87228805_20250926_163507",
    "parsed_data": {
      "seek_url": "https://www.seek.com.au/job/87228805?type=standard&ref=search-standalone#sol=6b16ae781110513c89c8eb69979e63dbf1cf39f9",
      "job_detail_title": "Experienced Data Analyst – Python, Snowflake, Power BI, SQL, Automation",
      "job_detail_location": "Perth WA",
      "job_detail_classifications": "Analysis & Reporting (Banking & Financial Services)",
      "job_detail_work_type": "Full time",
      "job_detail_salary": "",
      "jobAdDetails": "Drive smarter decision-making through data and automation. Deliver real impact. Own your craft.Are you a technically skilled analyst who thrives on solving complex problems with data and automation? At Pioneer Credit, we’re on a mission to transform how data powers our business  and we’re looking for a curious, driven Data Analyst to join our dynamic Data & Analytics team.We’re not looking for someone to learn the ropes — we need someone who already knows them. If you’re a technically strong, commercially minded analyst who thrives on autonomy, problem-solving, and turning data into action — this is your moment.AtPioneer Credit, we’re transforming how data powers our business. Join our high-performing Data & Analytics team and help us scale smarter, faster, and with purpose.What You Will Do.Analyse business and customer data to uncover actionable insights, test hypotheses, and support continuous improvement.Collaborate across departments to embed data-led thinking into everyday decision-making.Build and maintain dashboard in Power BI to keep results front and centre – or, if schema design and shaping datasets is more your strength, we still want to hear from you.Design, build, and automate data workflows using platforms and tools like Snowflake, SQL Server, Microsoft Azure and CRM platforms.Own your work — from scoping to delivery — with minimal direction.What You Will Bring.Demonstrated skills in most of the following: SQL, Python, Power BI, and automation tools (e.g. Power Automate) – or similar tools with the ability to upskill quickly.Experience  integrating CRM and third-party data with hands-on experience   in cloud platforms such as Snowflake and Microsoft Azure.Proficient in designing and utilising structured data models and optimizing data flows and structures to support reporting and automation - we expect you to shape datasets, not just use them.Got Snowflake migration experience? Not essential, but call it out in your cover letter.Proven experience working in fast-paced, customer-focussed environments (contact centre or financial services experience a plus).A strong understanding of segmentation, and lifecycle analytics.Ability to translate business needs into technical solutions and communicate insights clearly to stakeholders.Why You Will Love Working At Pioneer.Our purpose is to put an end to debt stress. We’re a fast-paced, inclusive organisation where your ideas and contributions matter. Here’s what we offer:A collaborative, high-energy team environment that values innovation and impact.Opportunities to grow your skills and career through coaching and diverse project exposure.Wellbeing support including EAP, discounted gym memberships, and health insurance.A culture that values celebrates individuality, creativity, and continuous improvement.This Role Is For You If…You’re confident in your technical skills and want to make a real impact.You’re proactive, curious, and thrive in environments where you’re trusted to deliver.You’re ready to turn data into decisions that shape customer experiences and business outcomes.Please note: This advert may be closed early if the position is filled prior to the listed closing date."
    },
    "extraction_time": "2025-09-26T16:35:25.328237"
  },
  {
    "job_url": "https://www.seek.com.au/job/87036393?type=standard&ref=search-standalone#sol=8530d3c592c4154aaf36c57273dd4549be09ac95",
    "raw_data_path": "data\\raw\\Unknown_Company_Business Intelligence Analyst_87036393_20250926_163455",
    "parsed_data": {
      "seek_url": "https://www.seek.com.au/job/87036393?type=standard&ref=search-standalone#sol=8530d3c592c4154aaf36c57273dd4549be09ac95",
      "job_detail_title": "Business Intelligence Analyst",
      "job_detail_location": "Perth Airport, Perth WA",
      "job_detail_classifications": "Business/Systems Analysts (Information & Communication Technology)",
      "job_detail_work_type": "Full time",
      "job_detail_salary": "",
      "jobAdDetails": "Perth Airport is Australia’s Western Hub connecting the people, businesses and communities of Western Australia with the rest of Australia and the world. Operating 24 hours a day, seven days a week throughout the year, Perth Airport plays a significant role in providing economic, social and cultural benefits to West Australians.Perth Airport is investing more than $5 billion in new infrastructure so we can support our airline partners to grow, offering more services to new destinations and an improved customer experience. This will be the largest funded private equity build in Western Australia for the last 30 years.Over the coming decade we will expand T1 International, and build new domestic terminal facilities, a parallel runway, two multi-storey carparks and our first airport hotel. This will deliver one airport for the people of Western Australia which will host all flight services in a central location giving passengers a seamless, world-class travel experience.The Perth Airport estate is spread over 2100 hectares and has developed a $1.5 billion portfolio of existing industrial premises and significant vacant land holdings.We service a truly diverse community and play an important role in strengthening cultural, family and social bonds while supporting business, tourism and leisure travel.What you'll do:Our team is now looking for aBusiness Intelligence Analystto join us on this journey. In this role, you’ll enable data-driven decision-making across the airport by developing and maintaining business intelligence (BI) and data products, along with the following:Collaborate with business stakeholders to capture requirements and translate them into BI solutionsAnalyse data to identify trends and deliver actionable insights that support business strategiesDesign, build and maintain BI reports, dashboards, and data products to deliver timely, accurate informationPartner with Data Engineers, Platform Engineers and Governance teams to ensure models and insights are scalable, reliable, and consistentProvide training, mentoring, and support to users to grow BI and analytics capability across the airportProactively improve BI processes and adopt modern technologies, including AI, to enhance ways of workingAbout you:You are passionate about all things business intelligence and thrives in a decision-making setting that brings a proactive, solutions-focused mindset. To succeed in this role, you’ll have:A relevant tertiary qualification or equivalent experience5+ years of experience designing, building and managing BI and data productsProficiency in BI tools and techniques such as Power BI, SQL, Python, R, and strong knowledge of data modelling (Kimball, Inmon, Star, Snowflake)Experience working with Microsoft Azure technologies (Fabric, SQL Server, OneLake, Synapse, Data Factory, DevOps)Strong analytical and problem-solving skills, with the ability to troubleshoot and optimise workloadsExcellent communication skills to collaborate across teams and translate technical insights for non-technical audiencesA proactive mindset with the ability to adapt quickly in a dynamic environmentAbout Us:We offer a dynamic and supportive team culture, a contemporary workplace with great facilities and a modern approach to work/life integration. Our competitive remuneration package comes with additional company benefits including free parking.Perth Airport is an Equal Opportunities Employer. We are committed to building an equitable and diverse workforce representative of the community we serve. We encourage and welcome applications from all communities and backgrounds.Doing the right thing by the planet and future generations is important to us. At PAPL we place a strong emphasis on embedding sustainability throughout our business strategy and operations. We remain steadfast in our commitment to driving ESPG (Environmental, Social, People, Governance) performance across our value chain and areas that have material environmental and social impact.If this sounds like you please get in touch."
    },
    "extraction_time": "2025-09-26T16:35:01.716273"
  },
  {
    "job_url": "https://www.seek.com.au/job/87328949?type=standard&ref=search-standalone#sol=8ba066bd4d32fb16a37241d44e9b22af9d5c17d0",
    "raw_data_path": "data\\raw\\Unknown_Company_Data Analyst_87328949_20250926_163540",
    "parsed_data": {
      "seek_url": "https://www.seek.com.au/job/87328949?type=standard&ref=search-standalone#sol=8ba066bd4d32fb16a37241d44e9b22af9d5c17d0",
      "job_detail_title": "Data Analyst",
      "job_detail_location": "Perth WA",
      "job_detail_classifications": "Business/Systems Analysts (Information & Communication Technology)",
      "job_detail_work_type": "Full time",
      "job_detail_salary": "",
      "jobAdDetails": "Company DescriptionThis is your opportunity to join our team of forward-thinking, change-making individuals. Operating at the intersection of health and tech, you'll help us shape the future of healthcare.Our MissionHealthengine’s mission is to improve access to healthcare by helping Australians find and connect with all primary care providers. We strive to achieve this through Australia’s leading healthcare marketplace, bringing together over 4 million active Australians, and more than 10 thousand practitioners that are powered by our technology - and growing.We’re all patients, right? So, it’s easy to get behind a mission that seeks to improve the healthcare experience for all Australians.Job DescriptionThe GigWe’re searching for a Data Analyst to apply their exceptional problem solving, research and data analysis capabilities to identify meaningful insights that drive business decisions within Healthengine. Working closely with the management team and within our systems and data function, this role will take ownership and be accountable for our reporting and insights capability.Responsibilities:Extract, manipulate and interpret data from our customer databasesProvide insightful reporting, analysis and key metric dashboarding that assists marketing, sales and customer success teams understand results and guide performanceConduct regular trend analysis and provide in-depth insight for management within the sales organisationProactively analyse and report on customer profiles to identify opportunities for action that align with the business strategyOngoing maintenance & cleansing of customer databases to ensure existence of high quality dataSupport development work required to maintain the integrity of our data and dataflowsDeliver insights through written and verbal communication including formal reports and dashboards to senior management and relevant stakeholdersCare and commitment to information security practices to protect Healthengine and its customersAbout YouYou're the kind of person who takes accountability in a fast-paced, autonomous and flexible environment. Fast may be your default (like us!) but you never, ever compromise on what’s important, willing to take a steady, more informed approach when it comes to maintaining the trust of our team and customers. You handle change like a pro, and continuous improvement is a way of life. You are not afraid to speak up and share your thoughts respectfully, with the intention of making positive change. You take initiative and drive your own learning journey without waiting for someone to point you in the right direction. And ultimately, you care: about people, health and innovation.Experience you’ll bring:Experience working in central data teamDemonstrated capability with advanced SQL and ExcelExperience working with Salesforce is desirableExposure to Amazon Redshift, PostgreSQL, Python, dbt, git, Tableau or AWS QuickSight is advantageousJira ticket management and Confluence experience is desirableRelevant tertiary qualifications and experience in an analytical discipline (e.g. statistics, computer science)Additional InformationThe perks behind the workHealthengine is where you’ll be your best self. You’ll collaborate with smart, interesting people who will challenge you to be better. You will learn a lot and grow even more. Healthengine is the ideal workplace to bring ideas, make change and leave a lasting impact on your team and the industry.In addition to an array of growth opportunities, we also offer:A hybrid workplace that offers flexibility to balance work and lifeA vibrant social calendar of events, quarterly team-building activities and moreUnlimited coffee and snacks, and a subsidised vending machine in our Perth officeAwesome discounts and salary packaging options through our benefit partner, MaxxiaAccess to learning resources to develop your personal and professional skillsWorkplace wellness program, including extra leave and access to EAP and other wellbeing resourcesExtra leave so you can recharge and focus on your wellbeingSupport for you when it comes time to grow your family with paid parental leaveWe're proud to share that Healthengine ranked 13th Best Workplace in Technology 2023 and are a certified Great Place to Work in Australia 2025/26.Diversity and inclusionAt Healthengine, we believe in the power of a diverse work environment to fulfil our mission and better serve our providers and patients. We’ve created a culture that genuinely values diverse perspectives and backgrounds, knowing that our differences can inspire new ideas. We are fully committed to building and maintaining our inclusive environment where all voices are respected and heard. If you think you have what it takes but don't check all the boxes, reach out anyway - we’d love to hear from you."
    },
    "extraction_time": "2025-09-26T16:35:46.882175"
  }
]