[
  {
    "job_url": "https://www.seek.com.au/job/87195137?type=standard&ref=search-standalone#sol=b754c1e4f9151390456f5fe968b0efae17ec3adf",
    "raw_data_path": "data\\raw\\Unknown_Company_Junior Data Analyst_87195137_20250926_132529",
    "parsed_data": {
      "seek_url": "https://www.seek.com.au/job/87195137?type=standard&ref=search-standalone#sol=b754c1e4f9151390456f5fe968b0efae17ec3adf",
      "job_detail_title": "Junior Data Analyst",
      "job_detail_location": "Melbourne VIC",
      "job_detail_classifications": "Business/Systems Analysts (Information & Communication Technology)",
      "job_detail_work_type": "Full time",
      "job_detail_salary": "$60-75K + Super",
      "jobAdDetails": "Location:Toorak, Melbourne | In-office Monday-FridaySalary:$60k–$75k + super (depending on your experience)Is this you?You want to take the first real step in your career.You take pride in getting the details right, even when the task is repetitive.You’re eager to learn, open to feedback, and keen to grow over timeThis opportunity might be for you…Join one of Australia’s fastest-growing fintechs in a supportive team that needs someone who loves getting the details right. You’ll start by owning the foundations (keeping our data clean, fixing errors, and checking reports). Nail that, and you’ll grow into bigger projects that add real value.This role will suit you ifyou are open to new ways of doing things - we don’t want a robot!you want to be part of an supportive team that enjoys getting things done together.you want to work hard and have an impact.What’s on offer:A role that builds your career step by step - start with the foundations and grow into bigger projects.A great workplace culture (we have won awards for it!) where the value you create is what counts.A manager who backs you with feedback, coaching and opportunities to grow.Personal and professional development, we’re committed to supporting our people with coaching and programs.A fun, energetic office environment in Toorak (you should see the views!)Regular company events, activities and weekly company-wide lunches.Who are we looking for?We’re looking for passionate, ambitious individuals who want to contribute to big things. Years of experience are just a number. Contribution and dedication are what matter.Must-havesOpen-minded and curiousReliable, detail-oriented, and thorough in your work.Egoless and collaborativeAction-oriented and great at getting things doneNice to have:This role requires baseline comfort with spreadsheets and data operations.Graduate in Data/Business/Science fields OR relevant work experience.Competence in Excel/Google Sheets.Exposure to reporting tools (Looker, Quicksight).Curiosity about Python or other scripting languages.What you’ll be doing:Keeping our data cleanand useful by uploading leads, fixing errors, and removing duplicates.Cross-checking and maintaining operational reportsand dashboards.Working with internal teamsto fill in missing info and fix inconsistencies.Helping document and implement business rulesas we roll out our new data warehouse.Raising issueswhen things don’t look right - and helping to fix them.Over time, usingQuicksight to build new dashboardsand support decision-making.About BizcapBizcap is one of the world's fastest-growing Fintech companies. With just over 100 people in their agile, diverse and high-performing team, they've funded over $1.5b in loans and are rapidly expanding internationally. They have won a range of awards for their workplace and culture, from Best for Small Business Loans, Best Workplace Diversity, Best Employee Culture and Diversity, and Outstanding Customer Service.How to ApplyWe use a reflective exercise to understand how you think, what you care about, and how you approach work - it's not a test, and there's no ‘right' answer; it's a way for us to understand you beyond your CV.Once you apply, you'll receive an invitation to complete the 15-minute exercise. If we feel it's a good fit, we'll be in touch to set up a conversation to get to know you better."
    },
    "extraction_time": "2025-09-26T13:25:35.378223"
  },
  {
    "job_url": "https://www.seek.com.au/job/86932068?type=standard&ref=search-standalone#sol=5ee20f599a0e036def27bdc5d765dcb7b9b0ece0",
    "raw_data_path": "data\\raw\\Unknown_Company_Data Scientist_86932068_20250926_132529",
    "parsed_data": {
      "seek_url": "https://www.seek.com.au/job/86932068?type=standard&ref=search-standalone#sol=5ee20f599a0e036def27bdc5d765dcb7b9b0ece0",
      "job_detail_title": "Data Scientist",
      "job_detail_location": "Docklands, Melbourne VIC(Hybrid)",
      "job_detail_classifications": "Developers/Programmers (Information & Communication Technology)",
      "job_detail_work_type": "Full time",
      "job_detail_salary": "$80,000 + superannuation",
      "jobAdDetails": "Company:MarshDescription:Permanent, Full-time opportunity (37.5 hours per week)Convenient Docklands Location – 727 Collins StBase salary of $80,166We are seeking a talentedData Scientistto join ourJLTteam atMarsh.This role will be based in theMelbourneoffice. This is a hybrid role that has a requirement of working at least three days a week in the office.As aData Scientistyou will develop BI and Data models with emphasis on QlikView data models and dashboards to support internal and external client needs. The role requires complete comprehension of enterprise data models and utilization of both relational and dimensional data sources.We will count on you to:Perform detailed analysis of source systems and source system data and model that data in QlikView;Design, develop, and test QlikView scripts to import data from source systems and test QlikView dashboards to meet customer requirements;Interpret written business requirements and technical specification documents;Create and maintain technical design documentation;Perform quality coding to business and technical specifications;Work directly with business units to define and prototype QlikView Applications;Extracting, transforming and loading data from multiple sources into QlikView applications Monitoring and maintenance of all components that make up the Data Warehouse and Business Intelligence infrastructure;Act as evangelist for BI benefits across the organization; promote BI usage to relevant departments;Responsible for demonstrating software to internal users;Participate in design meetings;Create standards and prototypes;Prepare and maintain relevant technical documentation.What you need to have:Experience in developing / architecting BI Solutions supporting financial, sales and performance reporting;Experience in sourcing data from disparate systems with a good understanding of their Data Models;Hands-on professional with thorough knowledge of scripting, data source integration and advanced GUI development in QlikView;Full understanding of the processes of data quality, data cleansing and data transformation Ability to write complicated yet efficient SQL queries and stored procedures;Strong knowledge on QlikView server architecture and building qvd’s and qvw’s applying business rules and data validations;Experience in end-to-end implementation of Business Intelligence (BI) projects, especially in scorecards, KPIs, reports & dashboardsKnowledge of formal database architecture and design;Tertiary education with a degree in computer science, information technology, information systems, or a related discipline;Detail-oriented with strong organizational, analytical and communication skills;Results-driven with the ability to take initiatives, handle multiple tasks and shifting priorities and meet deadlines;Excellent problem solving skills, logical process thinking and end-to-end system conceptsThinks clearly and calmly under pressure;Places emphasis on client satisfaction;Promotes the mission and shared values of JLT and Marsh;Excellent interpersonal and organisational skills with a strong ability to articulate and communicate ideas, work requirements and performance based matters in an empathetic manner;Self-motivated and results driven with a consultative approach.Why join our team:We help you be your best through professional development opportunities, interesting work and supportive leaders.We foster a vibrant and inclusive culture where you can work with talented colleagues to create new solutions and have impact for colleagues, clients and communities.Our scale enables us to provide a range of career opportunities, as well as benefits and rewards to enhance your well-being.How to Apply:Follow the link to apply. Applications will be open from03 Septemberto01 October.Applications will only be considered from candidates who have the appropriate approval to work in Australia. Successful applicants will be required to complete a Criminal & Bankruptcy check prior to commencement of employment.About MarshMarsh, a business of Marsh McLennan (NYSE: MMC), is the world’s top insurance broker and risk advisor. Marsh McLennan is a global leader in risk, strategy and people, advising clients in 130 countries across four businesses: Marsh, Guy Carpenter, Mercer and Oliver Wyman. With annual revenue of $24 billion and more than 90,000 colleagues, Marsh McLennan helps build the confidence to thrive through the power of perspective. For more information, visit marsh.com, or follow on LinkedIn and X.Marsh McLennan is committed to creating a diverse, inclusive and flexible work environment. We aim to attract and retain the best people and embrace diversity of age, background, disability, ethnic origin, family duties, gender orientation or expression, marital status, nationality, parental status, personal or social status, political affiliation, race, religion and beliefs, sex/gender, sexual orientation or expression, skin color, or any other characteristic protected by applicable law.Marsh McLennan is committed to hybrid work, which includes the flexibility of working remotely and the collaboration, connections and professional development benefits of working together in the office. All Marsh McLennan colleagues are expected to be in their local office or working onsite with clients at least three days per week. Office-based teams will identify at least one “anchor day” per week on which their full team will be together in person."
    },
    "extraction_time": "2025-09-26T13:25:35.822592"
  },
  {
    "job_url": "https://www.seek.com.au/job/87173977?type=standard&ref=search-standalone#sol=4f451ff49b7d589e3cc39d7da8153cbc5addec7d",
    "raw_data_path": "data\\raw\\Unknown_Company_Blackbook AI Graduate Program _87173977_20250926_132530",
    "parsed_data": {
      "seek_url": "https://www.seek.com.au/job/87173977?type=standard&ref=search-standalone#sol=4f451ff49b7d589e3cc39d7da8153cbc5addec7d",
      "job_detail_title": "Blackbook AI Graduate Program, Early 2026",
      "job_detail_location": "Melbourne VIC(Hybrid)",
      "job_detail_classifications": "Developers/Programmers (Information & Communication Technology)",
      "job_detail_work_type": "Full time",
      "job_detail_salary": "",
      "jobAdDetails": "OverviewAre you a tech-savvy graduate looking to kickstart your career in the exciting world of artificial intelligence, automation, data or digital? Blackbook.AI, a leading technology consulting company, is seeking ambitious graduates to join us in early 2026.What you'll be doingAs part of our team, you'll have the opportunity to work within one or more of the following practices:Data Science:Our team leverages Classical ML, Deep Learning, Neural Networks to solve customer problems.Applied/Gen AI:Our team leverages cloud based services such as AI Foundry, Mosaic, Bedrock, Open AI, Copilot to craft solutions to solve customer problems.Data:Develop your data engineering and analytics skills, to extract, transform, merge, model, analyse and present insights for our customers.Automation:From Robotic Process to Agentic Automation, design, develop, manage automations for our customers.Digital:Develop, Integrate, Test and Support Digital Solutions.Participate in a our hands on driven training program to develop your technical and interpersonal skills.Collaborate with cross-functional teams to design and implement innovative AI solutions for our clientsContinuously learn and stay up-to-date with the latest advancements in technologyWhat we're looking forA recently completed bachelor's degree in Engineering, Computer Science, Data Science, or a related technical fieldStrong problem-solving and analytical skills, with a keen interest in AI and emerging technologiesA collaborative mindset and the ability to work effectively in a team environmentWhat we offerAt Blackbook.AI, we are committed to providing our employees with a supportive and stimulating work environment. As a Graduate Program participant, you'll have access to a range of benefits, including:Competitive salary and bonusesOngoing training and development opportunitiesMentorship from industry-leading expertsFlexible work arrangements and a focus on work-life balanceAccess to the latest AI technologies and toolsOpportunities for career progression and growth within the companyAbout usBlackbook.AI is a dynamic and innovative AI driven consulting company, dedicated to pushing the boundaries of what's possible with artificial intelligence. Our mission is to create transformative AI solutions that improve lives and drive positive change. We are a team of passionate and dedicated individuals, united by our shared love of technology and our commitment to making a difference.Locations we are hiringBrisbane, Melbourne and SydneyAbout youMandatory:Must have full Australian working rightsHave graduated 2023 to December 2025 and available to start in February 2026Apply nowto be a part of our exciting Blackbook.AI Graduate Program and embark on a rewarding career in the cutting-edge field of artificial intelligence leveraged solutions.Applications Close: 30 September 2025"
    },
    "extraction_time": "2025-09-26T13:25:35.660119"
  },
  {
    "job_url": "https://www.seek.com.au/job/86802471?type=standard&ref=search-standalone#sol=69d2dc9ed67e803cc414a8209d9c8beacad3b24e",
    "raw_data_path": "data\\raw\\Unknown_Company_Data Analyst_86802471_20250926_132558",
    "parsed_data": {
      "seek_url": "https://www.seek.com.au/job/86802471?type=standard&ref=search-standalone#sol=69d2dc9ed67e803cc414a8209d9c8beacad3b24e",
      "job_detail_title": "Data Analyst",
      "job_detail_location": "Melbourne VIC",
      "job_detail_classifications": "Analysis & Reporting (Banking & Financial Services)",
      "job_detail_work_type": "Full time",
      "job_detail_salary": "",
      "jobAdDetails": "NOW Finance is a purpose-driven fintech with a simple aim: to create simple and transparent financial solutions, empowering Aussies to live their dreams – now!We are seeking a Data Analyst who is passionate about numbers and data, and able to connect business drivers to data-driven recommendations that shape the future of finance. Leverage cutting edge tools to provide insights and build reports to support various parts of our business across Marketing, Treasury, Risk and Operations.NOW Finance offers flexibility of one day per week WFH on completion of probation.Key responsibilities include:Partner with internal stakeholders to solve business problems through data analysis and insights.Support strategic initiatives to drive business outcomes – includes data-driven strategies and data infrastructure work.Identify and interpret trends or patterns in complex data sets.Create and maintain dashboards in Power BI enabling business users to automate and improve current work processes.Build and deploy automated tasks to extract and transform data.Communicate findings, insights and recommendations to a range of stakeholders.Attributes, Experience & Qualifications:Solid programming skills in SQL is mandatory and Python is highly desirable.Experience with at least one data visualization tool (e.g. Power BI) is also mandatory.Degree qualified in a numerate discipline, i.e., relevant STEM, Actuarial or Econometrics degreeAn analytical mind that can balance detail with the big picture.Team player with sound organisational and prioritisation skills.Strong written and verbal communication.Ability to work in a dynamic environment and flex with changing pace.Up to 2 years’ work experience - preferably in the areas of credit risk/marketing analytics, data visualization or machine learning.Financial background and experience desirable.AtNOW Financewe support and encourage our employee's personal and professional development – What we can offer you is:A dynamic work culture, with the opportunity to develop.A career path within Data & AnalyticsThe opportunity to work within a fun and energetic team, alongside a supportive leadership teamA positive work environment, great office space, weekly fruit delivery and free coffee!NOW Finance BenefitsAn annual Wellness DayFlexibility post probationEntry to our Employee Benefit Portal offering discounts, perks, and wellness resourcesDiscounted health insuranceA substantial referral bonusEmployee Reward and Recognition"
    },
    "extraction_time": "2025-09-26T13:26:02.967193"
  },
  {
    "job_url": "https://www.seek.com.au/job/87231857?type=standard&ref=search-standalone#sol=43ca8aafb459f64bec4fae749117c5a2fc637d23",
    "raw_data_path": "data\\raw\\Unknown_Company_Lead Data Scientist_87231857_20250926_132604",
    "parsed_data": {
      "seek_url": "https://www.seek.com.au/job/87231857?type=standard&ref=search-standalone#sol=43ca8aafb459f64bec4fae749117c5a2fc637d23",
      "job_detail_title": "Lead Data Scientist",
      "job_detail_location": "Melbourne VIC(Hybrid)",
      "job_detail_classifications": "Mathematics, Statistics & Information Sciences (Science & Technology)",
      "job_detail_work_type": "Full time",
      "job_detail_salary": "",
      "jobAdDetails": "We are currently partnering with a well-known Australian organisation that is seeking a Lead Data Scientist to join their established data function. This role, reporting directly to the senior leader across AI, this role will be central in leading a small team of data scientists and executing the organisation’s AI strategy, with a strong focus on advanced ML techniques and large language models (LLMs).This role is a hands-on leadership opportunity where you will combine people leadership with deep technical expertise in designing, developing, and deploying ML, AI, and LLM-based solutions. You will be accountable for embedding best practices, ensuring production readiness, and driving real-world impact from advanced analytics initiatives.What you will be doing…..Lead and mentor a small team of data scientists to deliver innovative AI and ML solutions.Execute the organisation’s AI strategy, with a particular focus on LLM adoption and applied use cases.Design, develop, and deploy ML, AI, and LLM models into production environments.Establish and maintain best practices, frameworks, and standards for scalable AI delivery.Ensure the ethical and responsible use of data and AI in line with organisational policies.Drive model reliability, accuracy, and validation through robust testing and governance.Partner with business and technology stakeholders to maximise adoption, value creation, and impact.Your experience will include……4+ years of experience as a Data Scientist, with recent experience in a leadership or team management role.Proven success in executing AI and data science strategies within complex organisations.Strong expertise in designing, developing, and deploying ML, AI, and LLM-based models into production.Technical depth in Python, R, BI tools, Azure and ML/AI frameworks.Advocate for practical, ethical, and innovative applications of AI and LLMs.Excellent stakeholder engagement and communication skills, with the ability to influence across technical and business teams.To be considered for this role, you must be an Australian Permanent Resident or Australian Citizen.If this position is of interest to you, please click ‘Apply’ or you can just send your details toraed@konnexuscg.com.auKonnexus specialises in the recruitment of permanent and contract professionals within Data Analytics | AI/ML | Data & Platform Engineering. If this role is not right but you want a new position or a conversation about the market, please call us on03 9052 5900and we will pass you onto the right Consultant."
    },
    "extraction_time": "2025-09-26T13:26:09.206085"
  },
  {
    "job_url": "https://www.seek.com.au/job/86117190?type=standard&ref=search-standalone#sol=af44d89808d3d074f2aacc999deb8804a08dd6b2",
    "raw_data_path": "data\\raw\\Unknown_Company_Software Development Data Engi_86117190_20250926_132551",
    "parsed_data": {
      "seek_url": "https://www.seek.com.au/job/86117190?type=standard&ref=search-standalone#sol=af44d89808d3d074f2aacc999deb8804a08dd6b2",
      "job_detail_title": "Software Development Data Engineer",
      "job_detail_location": "Melbourne VIC(Remote)",
      "job_detail_classifications": "Developers/Programmers (Information & Communication Technology)",
      "job_detail_work_type": "Full time",
      "job_detail_salary": "$130,000 – $140,000 per year",
      "jobAdDetails": "About the RoleThe Data Acquisition Team is the entry point to WEX’s Data-as-a-Service (DaaS) platform responsible for ingesting, validating, and orchestrating raw data from dozens of internal systems and third-party providers.As a Software Engineer, you’ll play a key role in designing and building robust, scalable, and extensible pipelines that feed the entire data ecosystem at WEX. You’ll work across multiple data domains and ingestion patterns—batch, streaming, and event-driven—while ensuring quality, performance, and governance are embedded in every step.WEX is undergoing a data platform transformation—and this team builds the foundation. Every pipeline you create contributes directly to powering analytics, automation, and product intelligence across all business domains.If you’re passionate about scaling data platforms from the ground up, this is your chance to help shape how WEX ingests and leverages its most valuable asset: data.What You’ll DoBuild and maintain high-performance data acquisition pipelines that integrate with a variety of systems across WEX and third-party vendors.Contribute to the development of a modular ingestion platform that enables reusability, reliability, and observability at scale.Implement core pipeline components such as schema validation, transformation orchestration, error handling, and audit logging.Support batch and streaming ingestion flows, ensuring the platform meets varying latency and volume requirements across business units.Ensure traceability, lineage, and security through integration with control plane and governance systems.Participate in code reviews, design sessions, and incident resolution—promoting high standards for code quality and operational reliability.What You Bring4–8 years of experience as a software or data engineer, ideally in high-volume or distributed systems environments.Strong programming skills in Python, Java, Scala, or another systems-focused language.Experience with data integration and ingestion pipelines—you understand what it means to bring data in from source systems, transform it, and deliver it reliably downstream.Solid grasp of engineering fundamentals, including version control, modular design, testing, and performance tuning.Familiarity with concepts like schema evolution, event-driven architectures, observability, and role-based access control.A collaborative mindset—comfortable working across domains, products, and infrastructure layers.A strong sense of ownership and accountability—you care deeply about building systems that last."
    },
    "extraction_time": "2025-09-26T13:25:55.295174"
  },
  {
    "job_url": "https://www.seek.com.au/job/86940798?type=standard&ref=search-standalone#sol=345bddd1fe4611654cf6e5099a577d5a0aa06a4f",
    "raw_data_path": "data\\raw\\Unknown_Company_Data Scientist - Leading Gov H_86940798_20250926_132640",
    "parsed_data": {
      "seek_url": "https://www.seek.com.au/job/86940798?type=standard&ref=search-standalone#sol=345bddd1fe4611654cf6e5099a577d5a0aa06a4f",
      "job_detail_title": "Data Scientist - Leading Gov Health Agency",
      "job_detail_location": "Melbourne VIC(Hybrid)",
      "job_detail_classifications": "Government - Federal (Government & Defence)",
      "job_detail_work_type": "Contract/Temp",
      "job_detail_salary": "AUD 400 - 450 per day",
      "jobAdDetails": "Data Scientist - Lading Gov Health AgencyJoin a purpose-driven Analytics team of a leading Government health organisation, that is using data science to support and help deliver programs that change lives.This is a 12 months Day Rate Contract with strong possibility of extension for another 12 months. Candidates must be based in Melb or Brisbane, with hydrid work arrangements - 2-3 days in the office/ rest from home.Australian Citizenship a must.About the TeamThe Analytics, Data & Actuarial (ADA) Division drives insight, forecasting and evaluation to ensure long-term sustainability and impact.Actuarial Insights & Monitoring – providing trusted analysis and advice.Data & Analytics – turning complex data into actionable insights.Scheme Effectiveness & Forecasting – measuring outcomes, evaluating supports, and monitoring financial sustainability.From producing the Annual Financial Sustainability Report to delivering strategic modelling and policy advice, the team plays a pivotal role in shaping evidence-based decision-making and future outcomes.As aData Scientistyou’ll:Work with complex data to deliver reporting, analysis and performance monitoring.Extract, cleanse and prepare data from multiple sources, advising on quality and checks.Apply statistical and predictive modelling, scenario testing and data visualisation to inform decision-making.Contribute to critical reporting for leadership, Ministers and public data sharing.Communicate insights to stakeholders and provide advice on moderately complex enquiries.What we’re looking for:2-3 yearsof relevant analytics or data science experience in gov or other similar agencies with good analytical and data management skills.Hands-on skills and exp inR or Python programming, including data manipulation and analysis.Hands-on experience and skills inSQL / SAS programming.Understanding ofstatistical modelling (GLM, gradient boosting)ormachine learning techniquesa must.Experience in dashboards and visualisations for non-technical stakeholders a big plus.Familiarity with government processes (policy, budget, reporting) a plus.This is your chance to use your technical expertise to influence policy, support national reporting, and contribute directly to outcomes that make a difference for Australians."
    },
    "extraction_time": "2025-09-26T13:26:44.495964"
  },
  {
    "job_url": "https://www.seek.com.au/job/87119482?type=standard&ref=search-standalone#sol=779339e12692ec36be4cd538f9af385df0fa1206",
    "raw_data_path": "data\\raw\\Unknown_Company_Research Scientist  Computatio_87119482_20250926_132638",
    "parsed_data": {
      "seek_url": "https://www.seek.com.au/job/87119482?type=standard&ref=search-standalone#sol=779339e12692ec36be4cd538f9af385df0fa1206",
      "job_detail_title": "Research Scientist – Computational Biology",
      "job_detail_location": "Melbourne VIC",
      "job_detail_classifications": "Mathematics, Statistics & Information Sciences (Science & Technology)",
      "job_detail_work_type": "Full time",
      "job_detail_salary": "$120,000 – $180,000 per year",
      "jobAdDetails": "You are a high-achieving mathematics/computing graduate, eager to improve human health in partnership with a team of biologists. You are exceptional. You are conscientious, scientifically minded, intelligent and driven.What does the role involve?Our Mission: Meaningfully extend human health span by targeting the root causes of aging.Background:We are focused on genomic damage, which is well suited to analytical approaches including analysis of past data and computational modelling.We are studying the molecular damage that accumulates with age to develop strategies for slowing and reversing it.New high accuracy sequencing techniques are shining a light on these root causes of aging.We have found that to analyse this accumulation of damage, model it, design experiments and analyse the data requires advanced statistics and programming.Unlike many aspects of medicine, the genetic code is highly logical, enabling predictions through modelling.Exposure to the medical sciences is beneficial but not required.Contribute to experimental design and strategy development, using your modelling to guide and shape experiments - not just analysing data from others.You will not be expected to work in the lab and will work in partnership with our lab team.Why work at Systematic Medicine?Work on the most challenging problems. Our mission is harder than going to Mars!Problems that are meaningful.We are focused on meaningfully reducing the burden of disease. Almost all disease burden is age related.Not speeding up a trade by a nano second to squeeze out more money.Secure private funding.Work from our premium office locations in Melbourne. We are based in the new Jumar incubator at the new CSL building and have a non-lab site in a top floor office in Abbotsford.Flexible Hours. You are driven to work hard, but intelligence, mindset and strong adherence to the scientific method is more important. We expect dedicated focused time, but don't require long hours.No travel required. You're welcome to organise conference attendance or go visit other labs.Exceptional pay $120-180k (ex superannuation).What you need to applyCapabilitiesStrong stats, math and problem solving.Strong computer science and statistical coding skills in R and Python at least.ExperienceNot required, but ideally you have 2 years+ full time work experience post academia.EducationUnder grad degree in stats, math, computer science, bioinformatics, molecular biology or similar.Postgraduate studies in the above fields are useful but not required.You need to demonstrate a passion and excitement about our mission.Interview Requirements & TimelinesPlease provide a short cover letter explaining why you would be suitable for the role.The interview process is multi-stage and involved. We will provide you with documents and a question prior to interviews for you to study and ask that you provide a detailed response that will be discussed in the interview. This will require up to a couple of days work.Interviews will begin around the end of September."
    },
    "extraction_time": "2025-09-26T13:26:44.776366"
  },
  {
    "job_url": "https://www.seek.com.au/job/87307400?type=standard&ref=search-standalone#sol=72729a059d007b0567c89130be91bdb3b9279b16",
    "raw_data_path": "data\\raw\\Unknown_Company_Data Analyst_87307400_20250926_132711",
    "parsed_data": {
      "seek_url": "https://www.seek.com.au/job/87307400?type=standard&ref=search-standalone#sol=72729a059d007b0567c89130be91bdb3b9279b16",
      "job_detail_title": "Data Analyst",
      "job_detail_location": "Yarraville, Melbourne VIC(Hybrid)",
      "job_detail_classifications": "Business/Systems Analysts (Information & Communication Technology)",
      "job_detail_work_type": "Full time",
      "job_detail_salary": "",
      "jobAdDetails": "Are you enthusiastic about turning data into insights that drive innovation and real-world impact?As ourData Analyst, you will play a vital role in supporting the organisation through insightful reporting and data-driven analysis. Using a range of analytical tools and techniques, this role helps inform strategic decisions and improve operational efficiency.Working as part of the Applied Research and Innovation team, the Data Analyst will collaborate closely with internal stakeholders across various departments to understand business needs, identify trends, and deliver actionable insights. This position is also soon-to-be based in a new Melbourne CBD location as part of Foodbank Victoria’s site relocation.Why Foodbank?Whether it’s everyday emergencies or in times of crisis, Foodbank Victoria has been providing vital food relief to vulnerable Victorians for 95 years. We deliver food to people who need it in three different ways: in partnership with our charity partners, through schools and via our regional Community Food Centres.Across our network of over 470 charity partners and 1200 schools throughout Victoria, we have distributed over 25.1 million meals in the last 12 months and are currently feeding 69,000 Victorians a day.While supporting our charity and school partners is at the core of what we do, as the state’s dedicated emergency food relief organisation, we’re also here to assist Victorians through natural disasters, pandemics and the ‘invisible disaster’ caused by the ongoing cost of living crisis.Why we are right for you?Our people come for a career and stay for the mission!You will join an organisation full of passionate and creative people who champion and invest in the vision of helping to fight for a food secure future for all Australians.We strive for a diverse and inclusive workforce, fostering a culturally safe and supportive environment where everyone can bring their whole self to work.Our locations span across metro and regional Victoria including Yarraville, Brooklyn, Ballarat and Morwell but the warmth of our culture is unified across all sites.Imagine a future with us:• Demonstrate an understanding of ERP, CRM, and other business systems from a reporting and data integrity perspective.• Maintain systematic approach to producing reports using various packages, including Excel and BI tools.• Develop and maintain reports and dashboards to measure the success of departments, programs, and projects.• Liaise with departments across the business to identify opportunities for reporting/analysis.• Scope requirements for reports, analysis and dashboards with stakeholders from across the business.• Use research, data, analytics and a strong evidence base to inform decision-making for all FBV leaders.• Undertake data analysis to uncover trends, correlations, and insights using relevant data sources to influence business decisions.• Present findings of analysis back to key stakeholders, providing recommendations where applicable.• Extract and prepare data with strong attention to data accuracy.• Manage databases to ensure data meets agreed standards and conventions, applying data governance best practices.• Ensure compliance with Foodbank Victoria’s policies, including WHS, privacy, and financial delegations.• Actively contribute to a culture of inclusion, empowerment, and continuous improvement.Why you’re right for us:• You want to be a part of a brand that’s been around for 95 years and genuinely share our passion for our vision of healthy food for all.• Able to live and breathe our values of empowerment, accountability, integrity, respect, diversity and equality.• You have relevant tertiary qualifications and/or significant work experience.• Ideally you have previous experience in a similar data analyst role.• Experience in QlikSense, Power BI, Tableau, or other BI tools.• Knowledge of Python, R or SQL and strong MS Excel skills.• Experience working with CRM and ERP data and reports.• Proven ability to work in a collaborative and high-performing team.• Strong attention to detail and a ‘can-do’ attitude.We can offer you:• Access to salary packaging benefits to increase your take home pay.• Team member satisfaction rates above 83%.• An organisation focused on employee wellbeing.• Supportive team environment that embraces change and innovation.• Involvement in the charity work we do and volunteer opportunities.Keen to apply?• Please review the Position Description on our website in the ‘Careers’ section at Foodbank Victoria and get to know us before you apply.• Email your application toemployment@foodbankvictoria.org.au• Applications to include an up-to-date resume and cover letter."
    },
    "extraction_time": "2025-09-26T13:27:15.436424"
  },
  {
    "job_url": "https://www.seek.com.au/job/87094436?type=standard&ref=search-standalone#sol=1f85820ea0a5f70121353ac1089858ff3aaf76cf",
    "raw_data_path": "data\\raw\\Unknown_Company_Data Scientist_87094436_20250926_132742",
    "parsed_data": {
      "seek_url": "https://www.seek.com.au/job/87094436?type=standard&ref=search-standalone#sol=1f85820ea0a5f70121353ac1089858ff3aaf76cf",
      "job_detail_title": "Data Scientist",
      "job_detail_location": "Melbourne VIC(Hybrid)",
      "job_detail_classifications": "Developers/Programmers (Information & Communication Technology)",
      "job_detail_work_type": "Full time",
      "job_detail_salary": "",
      "jobAdDetails": "Company DescriptionFairness feels goodMake a real impact at AFCA. Where fairness drives every decision. Help us deliver world-class, independent complaints resolution for Australians. As a not-for-profit and progressive financial ombudsman, we’re championing positive change. Achieving our purpose takes progressive thinking, accountability and resilience. At AFCA, our inclusive leadership values every voice. We offer our people flexible work options, thoughtful benefits and opportunities to deepen expertise. Flourish in a diverse, caring culture. Feel the difference of belonging to an organisation intentionally designed to put people first.Job DescriptionTheData Scientistrole will be pivotal in ensuring the continuity and growth of AFCA’s AI services and AFCA achieving and implementing its future AI and data roadmaps. We’re looking for a Data Scientist to harness AFCA’s modern data platform and Microsoft services to uncover patterns, trends, and relationships across structured and unstructured data. You’ll build classification, prediction, and optimisation models that deliver tailored, actionable insights.Working with internal teams and external partners, you’ll help deliver sustainable, innovative, and ethical AI solutions that support AFCA’s strategic goals. We currently have two open positions, 1 x permanent and 1 x 12 month contract.Typically in this role, you will:Design, implement, and test analytical models using tools like Azure Databricks, Synapse Analytics, and AI FoundryLead experiments to compare analytical methods and refine performanceDeploy solutions within AFCA’s change management framework and monitor performance over timeParticipate in requirements workshops and contribute to solution designCollaborate with report developers to communicate insights through reports and visualisationsAct as a bridge between business needs and technical deliveryMaintain analytics workloads and support continuity of data science servicesRespond to alerts/outages and escalate as neededProvide project support, including coordination with third-party providersMaintain high-quality documentation (requirements, evaluations, code repositories)Build prompt libraries and guardrails in Azure AI FoundryDefine success metrics (accuracy, bias, hallucination rate) and run A/B testsLead design and evaluation of LLM and RAG-based solutions, including fine-tuning modelsQualificationsTo be successful, you will need:A degree in Computer Science, Information Technology, or a Data related field,Proven experience of relevant experience in working with advanced analytics platforms, data science and/or data and AI projects.Strong knowledge and experience in data science technologies including Databricks, Python, SQL, ML, AI and/or generative AI concepts/tools.Experience in deploying LLM-based solutions using Azure OpenAI or similar tools.Knowledge of data analysis, deep learning, statistics, artificial intelligence, and knowledge of relational and dimensional data models.Strong interpersonal skills including oral and written communication skills.Strong attention to detail, initiative and the ability to work unsupervised.The ability to adopt a flexible/ innovative approach to problems and opportunities.Additional InformationBOSS Best Places to Work 2024–credited for its culture, engagement and flexible working arrangements.Most Inclusive Workplace 2024– Australian HR Institute (AHRI) Awards.Employer of Choice Public Sector and NFP– Australian HR Awards 2023Silver AWEI Accreditation 2025– Recognised for LGBTQ+ workplace inclusion.Accredited Family Friendly Workplace– Supporting work-life balance and inclusivity.Hybrid working– Flexible arrangements with state-of-the-art offices designed for collaboration and wellbeing.Inclusive leave options– Flexible public holidays, 20 weeks paid parental leave, gender affirmation leave, women’s health leave, and paid time off over Christmas.Financial benefits– Not-for-profit salary packaging to boost take-home pay.Locations– A team of over 1,200 dedicated professionals based in modern Melbourne and Sydney CBD offices.To applyIf you’re passionate about fairness and believe your skills align with this role, we encourage you to apply even if you don’t meet every single criterion.We welcome applications from people of all backgrounds, cultures, abilities, sexual orientations, and gender identities. If you require any accessibility support during the recruitment process, please reach out to our team atCareers@afca.org.au.AFCA is a 2025 Circle Back Initiative Employer - we are committed to responding to every applicant."
    },
    "extraction_time": "2025-09-26T13:27:48.309826"
  },
  {
    "job_url": "https://www.seek.com.au/job/87023820?type=standard&ref=search-standalone#sol=c361a0af53c9c6941ec1329ef19d5a170bd1b82f",
    "raw_data_path": "data\\raw\\Unknown_Company_Graduate Data Analyst_87023820_20250926_132741",
    "parsed_data": {
      "seek_url": "https://www.seek.com.au/job/87023820?type=standard&ref=search-standalone#sol=c361a0af53c9c6941ec1329ef19d5a170bd1b82f",
      "job_detail_title": "Graduate Data Analyst",
      "job_detail_location": "Dandenong, Melbourne VIC",
      "job_detail_classifications": "Database Development & Administration (Information & Communication Technology)",
      "job_detail_work_type": "Full time",
      "job_detail_salary": "$70000 + super",
      "jobAdDetails": "About the RoleReporting to the Planning & Development Manager, you’ll play a key role in helping us make smarter decisions through data. You’ll work with internal teams and external stakeholders to analyse performance, identify trends, and support continuous improvement across our operations.What You'll Be Doing• Utilise software including Excel, PowerBI, BusMinder, Smartrak and Myki Analytics data to compile reports on KPI’s including allocation, on-time running and missed services.• Collaboration with Network Planners for data research and timetable analysis to identify improvement opportunities.• Providing analytical and reporting support to departments such as Fleet, HSEQ and Operations.• Extract, interpret and analyse data using statistical techniques to identify variances, trends and discrepancies.• Reporting on business KPI’s for compliance and performance to our stakeholders and regulatory bodies.• Develop and implement databases, data collection systems, data analytics and other strategies that optimize statistical efficiency and quality.About YouWe’re looking for someone who’s:• A demonstrated background in a similar position with a strong focus on data analytics and reporting.• Tertiary Qualifications in relevant discipline preferred, but not essential.• Previous experience with PowerBI, Tableau or Python.• Strong analytical skills with the ability to collect, organize, analyse, and disseminate significant amounts of information with attention to detail and accuracy.• Exceptional attention to detail and ability to deliver within defined regulatory deadlines.Why Join Ventura?What Ventura Can Offer You• Work within an established, inclusive, and supportive team.• An exciting, dynamic and ever evolving workplace providing opportunity to create content for various departments.• A secure, dependable and robust environment.• Excellent facilities, onsite parking and employee events.• Walking distance to a major public transport hub, Dandenong Railway Station.About Ventura Bus LinesVentura is Australia’s largest privately owned bus company, moving over 42 million passengers annually. With 1700+ employees and 900+ vehicles, we’re committed to delivering safe, sustainable and reliable transport across Melbourne.Ready to Apply?If you’re excited to launch your career in data analytics, we’d love to hear from you!?? Contact Emmy on(03) 9771 4363for more info or?? Click “Apply Now” to submit your application."
    },
    "extraction_time": "2025-09-26T13:27:46.794017"
  },
  {
    "job_url": "https://www.seek.com.au/job/87425061?type=standard&ref=search-standalone#sol=4d5f320bb2b03a8c6bdb6ca4892df90a23b5f14f",
    "raw_data_path": "data\\raw\\Unknown_Company_DATA  BUSINESS ANALYST  ENERGY_87425061_20250926_132740",
    "parsed_data": {
      "seek_url": "https://www.seek.com.au/job/87425061?type=standard&ref=search-standalone#sol=4d5f320bb2b03a8c6bdb6ca4892df90a23b5f14f",
      "job_detail_title": "DATA & BUSINESS ANALYST | ENERGY",
      "job_detail_location": "Melbourne VIC(Hybrid)",
      "job_detail_classifications": "Business/Systems Analysts (Information & Communication Technology)",
      "job_detail_work_type": "Full time",
      "job_detail_salary": "$90,000 - $120,000",
      "jobAdDetails": "About the companyThis role is working for a leading energy & sustainability consultancy that help large businesses decarbonise and cut energy costs. The organisation have a team across multiple states in Australia who are technical specialists providing energy engineering and technical services for the creation of carbon credits energy savings certificates for things like solar and energy reduction such as LGC's, STC's, VEEC's and much more.This brand combines deep technical expertise with a strong purpose: creating real impact on climate change.The positionWe’re looking for a Business/Data Analyst who loves solving complex problems, optimising processes, and building smart data tools, this role is for a doer who can interpret business processes and turn them in to automation.Reporting to the GM, you’ll streamline workflows, automate systems, and deliver insights through Power BI, Salesforce and other platforms. Your work will directly support smarter decision-making and measurable sustainability outcomes.In this role you will:Map, analyse and improve core business processesAutomate workflows to save time and cut errorsBuild dashboards and reporting tools to inform strategyIntegrate systems (Salesforce, Power BI, Mission Control, Xero) for seamless operationsTranslate data into insights that drive growth and efficiencyAbility to bring genAI or AI tools forward would be highly regardedExperience neededStrong skills in Excel especially,Skills in Power BI (or Tableau), driving integrations, and data analysisExperience with platforms like Salesforce or anything relatedExperienced with process automation and integration toolsBackground in business process optimisation and reportingBenefit but not essential to have exposure to energy, sustainability or environmental sectorsBenefit to come from the energy certificate market or an APSeveral years experience in a Business Analyst / Data Analyst roleAbility to bring genAI or AI tools for business improvement would be highly regardedBenefitsCompetitive salary + annual reviewsProfessional development supportFlexible work options after probation (up to 2 WFH days)Travel, phone, and expenses covered in line with company policyJoining a collaborative, high-performing team making real impactApply nowIf you’re ready to use your skills to help a business on a mission with clear purpose for decarbonisation and sustainability, we’d love to hear from you. Apply today!To apply for the job; do so with your Resume on this job page.For a confidential conversation or more info, please call Sean;0483 908 014, or(07) 3186 2106."
    },
    "extraction_time": "2025-09-26T13:27:46.545576"
  },
  {
    "job_url": "https://www.seek.com.au/job/86918346?type=standard&ref=search-standalone#sol=32f05a07fc065d31166916ee4b5202256014e4ff",
    "raw_data_path": "data\\raw\\Unknown_Company_Data Analyst_86918346_20250926_132804",
    "parsed_data": {
      "seek_url": "https://www.seek.com.au/job/86918346?type=standard&ref=search-standalone#sol=32f05a07fc065d31166916ee4b5202256014e4ff",
      "job_detail_title": "Data Analyst",
      "job_detail_location": "Derrimut, Melbourne VIC",
      "job_detail_classifications": "Business/Systems Analysts (Information & Communication Technology)",
      "job_detail_work_type": "Full time",
      "job_detail_salary": "",
      "jobAdDetails": "Who are we?Sterling Parts Australia is an established, national automotive parts distributor with distribution centres in Sydney, Melbourne, Brisbane and Adelaide. We are a forward thinking team who are not afraid to try new things. We are transforming our operations and building momentum to take our business forward to the next stage of growth.What’s involved?You will be the 'brains' to help analyse data and support management and business decisions. This may include identifying revenue growth opportunities and identifying market trends and breaking down inventory movements. Some key responsibilities include:Analyse trade, online and other channel data, creating revenue-driving recommendations in collaboration with the broader teamRecommend solutions that enhance effectiveness across teamsResearching, evaluating and reporting on up to date market trends and opportunitiesCollaborating with teams within the organisation to ensure best outcomes, particularly for sales and profit targetsCollaborating with leads in other branches to achieve broader organisational objectivesWhat are we looking for?You will be a highly details oriented and methodical data professional who is able to interpret facts and figures and translate that into a story which is fit for purpose for our industry. You will want to make a positive impact, leave your mark on the business and take pride in the quality of your work. The qualities which we are particularly looking for include:Proven experience in data analysis and evaluation roleHighly organised and details driven professionalAn excellent data driven storytellerA growth focused mindset who is always seeking new learning opportunities and growthExperience in the automotive and related supply chain industryExperience in consulting industryWe are a diverse and inclusive team and look forward to welcoming team members of all genders, religions and identifications.This role will require all days in the office.Are you ready to step up?We look forward to hearing from you soon - join us and grow with us!"
    },
    "extraction_time": "2025-09-26T13:28:08.932695"
  },
  {
    "job_url": "https://www.seek.com.au/job/87246833?type=standard&ref=search-standalone#sol=839aeda9fb502d336823915897283d3b16104069",
    "raw_data_path": "data\\raw\\Unknown_Company_Senior Data Scientist - GenAI_87246833_20250926_132807",
    "parsed_data": {
      "seek_url": "https://www.seek.com.au/job/87246833?type=standard&ref=search-standalone#sol=839aeda9fb502d336823915897283d3b16104069",
      "job_detail_title": "Senior Data Scientist - GenAI",
      "job_detail_location": "Cremorne, Melbourne VIC(Hybrid)",
      "job_detail_classifications": "Engineering - Software (Information & Communication Technology)",
      "job_detail_work_type": "Full time",
      "job_detail_salary": "",
      "jobAdDetails": "Company DescriptionAbout SEEKSEEK’s portfolio of diverse businesses make a positive impact on a truly global scale. Our purpose is to help people live more fulfilling and productive working lives and help organisations succeed. We create world-class technology solutions to connect more people to relevant employment, education, small business and volunteer opportunities. We have a culture of high-performance in our workplaces and celebrate the diversity of our employees who contribute to the success of our organisation.Life at SEEKSEEK’s purpose is at the centre of everything we do.Our SEEK, which defines the way we work, is all about what makes us unique and a little bit different. Passion, Team, Delivery and Future are our principles that drive innovation and creativity. SEEK strives to support employee wellbeing by providing an amazing experience at work which led us to being named AFR BOSS Top 10 Best Places to Work in Technology (2021-2024). We are proud to work in an environment that's inclusive where everyone's unique ideas, experiences and perspectives are valued.Our award-winning head office in Cremorne (just a 4 min walk from Richmond station) provides an exceptional space to collaborate with colleagues. The building provides sweeping views of the city, a games area, sit and stand desks at every workstation, modern end-of-trip facilities and Thursday night drinks which gives our people an opportunity to connect in a social setting.Job DescriptionThe RoleAs a Senior Data Scientist at SEEK, you'll be part of a fast-paced, supportive environment where you can make a real difference. You'll work on complex challenges that have a direct impact on people's lives, helping us evolve our business and reach new heights.You will report a Data Science Lead and work alongside other highly motivated Data Scientists in the Generative AI team. You will collaborate with product managers, designers, engineers, and others across multiple teams to design and develop Generative AI solutions for both internal and external (customer-facing) use cases.Key ResponsibilitiesIn this role, you will be expected to:Research, propose, and implement new AI solutions (and evolve existing ones) to improve a product or business outcome.Compile and develop datasets as appropriate to train or evaluate AI systems.Perform offline evaluation of AI systems and contribute to the design of online experiments.Evangelise appropriate AI methods and explain their benefits and limitations to various audiences, acting as a technical reference within the business on topics related to AI.Break down problems and projects, estimate and prioritise activities, and propose alternatives to overcome obstacles.Work together with Product Managers, Engineers, and other stakeholders to build relationships within the organisation based on trust.Mentor junior Data Scientists and share technical expertise with the DS team.The TeamSituated within the larger Artificial Intelligence & Analytics team at SEEK, the Generative AI team is a practice team focusing on GenAI. The GenAI team has two streams of work. TheApplicationsstream partners with SEEK product owners and may embed Data Scientists into the team to develop and test opportunities to build GenAI-based services. TheCapabilitiesstream builds early-stage prototypes to test the latest GenAI technology, and also develops core functionality into platform capabilities to enable sustainable scaling of GenAI services.We work on a quarterly planning cycle to develop our roadmap, which consists of internal R&D projects as well as partnerships with internal product teams, where we act as specialist consultants. As a Senior Data Scientist, you will work autonomously to deliver one or more initiatives for the team. The team runs various team rituals such as weekly stand-ups and knowledge sharing sessions, monthly team retrospectives, and others as needed. You will also attend project-related meetings as necessary.QualificationsEssential Qualifications, Skills, and ExperienceA MSc or PhD qualification in Computer Science, Data Science, Mathematics, Statistics, or equivalent experience.Professional experience developing and delivering AI/ML solutions.Deep understanding of the theory and practice of how to build, train, evaluate, and optimise AI/ML models.Excellent communication and interpersonal skills, including the ability to communicate complex ideas in simple language.Ability to adapt quickly and thrive in an environment of rapid change.The following are preferred but not essential:Demonstrated experience leading AI/ML projects and managing multiple stakeholders.Deep technical knowledge of the foundations of Generative AI: deep learning; transformers; encoder/decoder models; pre-training and post-training; RLFH; LORA.Hands-on experience training or adapting large language models.Hands-on experience building solutions with pre-trained LLMs, using techniques such as prompt engineering, RAG, agentic workflows, etc.Experience with conversational design and developing conversational AI systems.Additional InformationPermanent PerksAt SEEK we offer:Support of flexible working, including a mix of office and work from home days depending on your role.Paid and unpaid leave benefits including Personal Flexi Days and Volunteer Days, as well as the opportunity to purchase additional leaveSupport for parents with 14 weeks paid primary carers leave and 2 weeks paid leave for partnersSEEKer Support, a confidential service that offers employees up to six sessions with a mental health professional of your choiceTailored career development planning (including Education Assistance Program)At SEEK, we are passionate about fostering a culture of inclusion and wellbeing that embraces and values the diversity of our people. We are a purpose driven business that works with heart.We know teams with diverse ideas, experiences and perspectives are more creative and are critical to ensuring effective delivery and innovating to enable our future success. As such, we welcome applications from people with diverse backgrounds and life experiences, especially as they relate to gender, sexual identity, culture, faith, disability and life stages. If you have the skills, curiosity and an adaptable mindset but don't meet every responsibility or qualification listed in this advertisement, please still get in touch with us.Should you require any specific support or adjustments throughout the recruitment process and beyond, please advise us and we will be happy to assist.For this role, only those candidates with the eligible right to work will be considered.SEEK kindly requests no unsolicited resumes or approaches from recruitment agencies and will not be responsible for any associated fees."
    },
    "extraction_time": "2025-09-26T13:28:11.714084"
  },
  {
    "job_url": "https://www.seek.com.au/job/87229732?type=standard&ref=search-standalone#sol=bf4587ecb15d2678658b742dfe561dd9611849e4",
    "raw_data_path": "data\\raw\\Unknown_Company_Data Engineer_87229732_20250926_132806",
    "parsed_data": {
      "seek_url": "https://www.seek.com.au/job/87229732?type=standard&ref=search-standalone#sol=bf4587ecb15d2678658b742dfe561dd9611849e4",
      "job_detail_title": "Data Engineer",
      "job_detail_location": "Hawthorn, Melbourne VIC(Hybrid)",
      "job_detail_classifications": "Developers/Programmers (Information & Communication Technology)",
      "job_detail_work_type": "Full time",
      "job_detail_salary": "",
      "jobAdDetails": "Data Engineer – MAGIQ SoftwareAbout MAGIQAtMAGIQ Software, we build smart, cloud-based applications that help local governments and public sector organisations deliver for their communities. With over600 customersacross Australia, New Zealand, and the USA, our product suite includesMAGIQ Cloud ERP, MAGIQ Performance (budgeting & reporting), and MAGIQ Documents.We’re a team of80+ professionalspassionate about delivering great software and outstanding customer service - and we want you to join us.About the RoleWe’re looking for anexperienced Data Engineerto join our growingData & Reporting team. You’ll design and maintaindata pipelines and ETL processesthat power the reporting and analytics capabilities of our MAGIQ Performance product.This role is hands-on withSQL, XML-based connectors, and diverse data sources(APIs, SQL system dumps, structured extracts). You’ll collaborate closely with product and consulting teams, ensuring customers have reliable and accurate data solutions that align with financial and operational needs such asGeneral Ledger, Payroll, and Labour Budgets.What You’ll DoDesign, build, and optimise ETL pipelines and SQL data models.Work withXML connectorsand schema management.Ingest and transform data from APIs, extracts, and SQL systems.Ensure data quality, consistency, and reliability.Collaborate with Product Owners and Consultants to deliver actionable reporting solutions.Troubleshoot escalated issues and provide long-term fixes.Contribute to Agile ceremonies and team collaboration.What You’ll BringBachelor’s in Computer Science, Information Systems, or equivalent experience.4+ years’ experiencein data engineering or related roles.Strong SQL skills across large and varied datasets.Experience withXML-based data connectors.Knowledge of APIs, SQL dumps, and structured extract transformations.Solid understanding of relational databases and schema design.Domain knowledge infinance-related data(GL, Payroll).Excellent troubleshooting, problem-solving, and communication skills.Agile or hybrid delivery experience.Bonus: Certifications or experience inbig data or financial data systems.Why Join MAGIQ Software?Work on impactful products that empower councils and the public sector.Join a supportive, collaborative team spread across AU, NZ, and the USA.Be part of a company that valuesinnovation, professionalism, and continuous improvement.Enjoy the chance to make a real difference in how communities are served.This is a hybrid role, requiring three days per week in the office.If you're passionate about innovation and customer success, we invite you to apply and become part of our Melbourne-based team.Learn more about MAGIQ Software at www.magiqsoftware.com.We look forward to receiving your application."
    },
    "extraction_time": "2025-09-26T13:28:10.743732"
  },
  {
    "job_url": "https://www.seek.com.au/job/87420715?type=standard&ref=search-standalone#sol=d3e6e5625e3b2b4274d2b1c25f3d1cbc08d0ad5b",
    "raw_data_path": "data\\raw\\Unknown_Company_Data Analyst_87420715_20250926_132834",
    "parsed_data": {
      "seek_url": "https://www.seek.com.au/job/87420715?type=standard&ref=search-standalone#sol=d3e6e5625e3b2b4274d2b1c25f3d1cbc08d0ad5b",
      "job_detail_title": "Data Analyst",
      "job_detail_location": "Melbourne VIC(Hybrid)",
      "job_detail_classifications": "Business/Systems Analysts (Information & Communication Technology)",
      "job_detail_work_type": "Full time",
      "job_detail_salary": "",
      "jobAdDetails": "About Us:We are proudly owned by Auto & General Insurance Company. The A&G group is made up of trusted and well-known brands such as iSelect, Compare the Market and Budget Direct. In late 2024, iSelect and Compare the Market formed a new aggregation business within the A&G group that continues to support millions of Australians to compare and buy their personal finance, and household products such as insurance, energy, and loans.The Opportunity:Are you ready to elevate your career to the next level?We're seeking a Data Analyst to analyse complex data sets to deliver actionable insights that drive business decisions and growth. You'll collaborate with stakeholders, business analysts, and data engineers to translate requirements into effective reporting solutions. A strong focus will be on understanding data structures and platforms to optimize analytics and performance.Data Analysis & Reporting:Collect and analyse large datasets to identify trends and insights. Develop clear reports, dashboards, and visualizations for stakeholders.Performance Measurement:Define and track KPIs aligned with business goals. Identify areas for improvement and recommend strategies.Business Insights:Collaborate with cross-functional teams to translate business needs into data-driven insights, driving process and revenue improvements.Data Modelling & Profiling:Work with data engineers to analyse and profile data for use in production models supporting analytics.Data Quality Assurance:Ensure data accuracy and integrity through validation checks and by resolving anomalies.Trend & Market Analysis:Monitor industry trends and emerging technologies to deliver innovative, competitive insights.Data Visualization:Build interactive dashboards and visualizations using BI tools (e.g., Power BI, Tableau) for clear communication of data insights.Benefits:At Compare the Market and iSelect we offer a dynamic and collaborative work environment where your talents will be recognised and rewarded. You’ll have the opportunity to make a meaningful impact and contribute to our continued success, we also provide:Vibrant and social community who have annual celebrations, family fun days and regular events.Enjoy flexible work arrangements, including the option of one day working from home each week or a 9-day fortnight.Enjoy additional leave days - ‘ME’ leave and ‘Volunteer Day’ leave.Employee discounts on Car, Home, Travel insurance.Income protection insurance provided to support you in the event of non-work-related illness or injury.About you:Bachelor’s or Master’s degree in Computer Science, Statistics, Mathematics, Engineering, or a related field2–5+ years of experience in data analytics, data science, or a related roleStrong proficiency in SQL and database systems; working knowledge of PythonExperience with data visualization tools such as Tableau, Power BI, Cognos, or LookerFamiliarity with cloud platforms such as AWS, GCP, or AzureExperience or knowledge of AI technologies such as Large Language Models (LLMs), Retrieval-Augmented Generation (RAG), or agent-based systemsWant to know more? apply now!At Compare the Market and iSelect and we’re proud to be an Equal Opportunity Employer and we embrace diversity.This role is available to candidates with unlimited Australian working rights only.Compare the Market and iSelect are committed to protecting your privacy. All applications and personal information are kept confidential and securely stored in line with Australian privacy laws, used only for recruitment purposes, and not shared with third parties outside the Auto & General Holdings Group without your consent."
    },
    "extraction_time": "2025-09-26T13:28:39.166476"
  },
  {
    "job_url": "https://www.seek.com.au/job/87320610?type=standard&ref=search-standalone#sol=27b795a2f841a90627af0b9343f8b8411e51726b",
    "raw_data_path": "data\\raw\\Unknown_Company_Data Analyst_87320610_20250926_132835",
    "parsed_data": {
      "seek_url": "https://www.seek.com.au/job/87320610?type=standard&ref=search-standalone#sol=27b795a2f841a90627af0b9343f8b8411e51726b",
      "job_detail_title": "Data Analyst",
      "job_detail_location": "Melbourne VIC(Hybrid)",
      "job_detail_classifications": "Business/Systems Analysts (Information & Communication Technology)",
      "job_detail_work_type": "Full time",
      "job_detail_salary": "",
      "jobAdDetails": "A bit about usAt Judo, we're more than just a business bank – we're pioneers in redefining business banking for the modern era. Rooted in timeless values such as integrity, trusted relationships, and a challenger spirit, we're dedicated to revolutionising business banking for Small to Medium Enterprises (SMEs) across Australia. Our journey began in 2016 with a bold vision and a PowerPoint slide, driven by a desire to challenge the status quo in an industry dominated by the major players. In just a few short years, we've grown exponentially, establishing ourselves as one of the fastest-growing new banks globally, with 27 offices spanning the nation.At the heart of our ethos lies a commitment to supporting Australian SMEs, placing our people and customers front and centre in everything we do. Our agility and adaptability enable us to say 'yes' when other banks say 'no', making it easier for our customers to secure the funding they need, precisely when they need it. We take immense pride in our personal approach to banking, fostering diverse relationships and cultivating a collaborative culture within our team.Our culture – come and join a multi-award-winning place to workWe firmly believe that culture eats strategy for breakfast, lunch, and dinner and the most important investment we can make is in our people. Our Values of trust, teamwork, accountability and performance underpin the foundation of our culture.We're not your average bank. Judo was built from the ground up, with one purpose: to be the most trusted SME business bank in Australia. We made sure to cultivate a space where bureaucracy is left at the door - where our customers come first with relationships at the core of what we do. We aspire to think differently, inviting new ideas, and creating a space where everyone feels like they belong because we know that it's our unique differences that make us collectively stronger.We are thrilled to be externally recognised for our unique culture too! We were awarded the #1 ranking in LinkedIn’s Top Companies in Australia list as well as named in the AFR’s BOSS Best Places To Work list for 3 years in a row. We’re also super proud to be included in the 2024 HRD Australia 5-Star Employers of Choice list and officially be Great Place To Work Australia certified!Our people and our culture are truly our secret sauce.Now, about this role…This role is about turning complex data into clear, actionable insights that help shape business decisions.You'll work closely with stakeholders to deliver meaningful reporting and drive continuous improvement across the bank.If you love:Collaboration and influence: Building and maintaining strong relationships with internal stakeholders to understand their needs and drive data-informed decisionsUncovering hidden patterns: Diving deep into data to solve business problems, identify opportunities and challenge conventional thinkingTransforming data into insights: Designing and developing insightful reports and dashboards that clearly communicate complex information and drive actionTurning data into action: Preparing data for use in predictive and prescriptive modelling to unlock the full potential of data-driven solutionsMaking a real-world impact: Applying your analytical skills to answer critical industry and business questions that contribute to the success of Australian SMEThen this just might be…your dream job:Empowerment and ownership: You'll have the autonomy to gather business requirements, translate them into analytical solutions and own the end-to-end data analysis processCollaboration and innovation: You'll work with Data Engineers and Subject Matter Experts in a modern, cloud-only technology stack, to build cutting-edge data solutionsData quality champion: You'll play a key role in improving data reliability, quality and efficiency, ensuring that our data is a trusted assetImpact and visibility: You’ll work with senior stakeholders in the bank to deliver insights that will contribute to the growth of one of Australia's fastest-growing banksContinuous learning: You'll have the opportunity to expand your skills in data analysis, visualisation and modelling and contribute to a data-driven cultureA little bit about you…We’re looking for someone who brings strong communication skills, a collaborative mindset and the ability to bridge the gap between technical detail and business needs.You’ll thrive here if you enjoy building connections, bring a positive energy and are ready to contribute to a supportive and high performing team.The skills you’ve picked up along the way:Advanced Power BI skills: Proven experience designing and building insightful dashboards that drive data-driven decision-makingStrong analytical foundation: Exceptional analytical, critical thinking and problem-solving abilities with a passion for uncovering insights from data. Experienced in statistical analysis.Programming proficiency: Proficiency in SQL for data analysis, manipulation and extractionData wrangling expertise: Medium-level SQL skills, including the ability to write, optimise and troubleshoot complex queriesData warehousing knowledge: Exposure to data warehousing concepts and dimensional modelling techniquesCollaboration with data science: Experience working with Data Scientists and Machine Learning Engineers, or prior experience in a data science roleYour life pre-Judo:Requirements gathering: You have worked in roles where gathering and documenting business requirements from stakeholders was a key aspect of your dutiesStakeholder management: You know how to effectively collaborate with and manage stakeholders across different teams, across the spectrum of business, operations, data and technologyExcellent communication: Your written and verbal communication skills are exceptional and you know how to present complex information clearly and concisely and translate business concepts into technical solutions - and vice versaThese would be a plus:Experience with Data Vault data modelsExperience in the Financial Services industryExperience working in an agile environmentAt Judo, our culture sets us apart.Our Values:Accountability: Make decisions and own them. Do what you say.Performance: Strive to improve each day, surpassing yesterday's achievements.Teamwork: We're not just a team; we're a champion team.Trust: The cornerstone of our purpose and relationships.We're seeking individuals who embody resilience, positivity, curiosity, hunger for success, adaptability, passion, courage, decisiveness, and a hands-on approach.What our team members say about us:Our people are empowered to make decisions, take ownership, and contribute to a collaborative environment. Bureaucracy is non-existent as we focus on collective success. At Judo, diversity isn't just valued; it's celebrated. We're committed to creating an inclusive environment where everyone thrives, making us collectively stronger. Our team works tirelessly towards our purpose while enjoying the journey of revolutionizing Australian SME business banking.Perks of joining us:Additional 2 weeks of leave annually (that’s 6-weeks per year!)Big life event leaveHome office setup allowanceAccess to CU HealthFlexible work options, embracing a true hybrid model.If this resonates with you, reach out - we'd love to hear from you.To learn more about how Judo manages your personal information during the recruitment process, please refer to our Privacy Statement. By providing your information, you consent to its collection, use, disclosure, and management as outlined therein.Please no agencies! We maintain a preferred panel, and kindly request no unsolicited contact. We do not hold any responsibility for dispute over candidate ownership if you have not been engaged directly."
    },
    "extraction_time": "2025-09-26T13:28:40.538617"
  },
  {
    "job_url": "https://www.seek.com.au/job/87389186?type=standard&ref=search-standalone#sol=1492ca44d185032fa8cb5da47b7abd725c69e797",
    "raw_data_path": "data\\raw\\Unknown_Company_Data Engineer_87389186_20250926_132834",
    "parsed_data": {
      "seek_url": "https://www.seek.com.au/job/87389186?type=standard&ref=search-standalone#sol=1492ca44d185032fa8cb5da47b7abd725c69e797",
      "job_detail_title": "Data Engineer",
      "job_detail_location": "Melbourne VIC",
      "job_detail_classifications": "Developers/Programmers (Information & Communication Technology)",
      "job_detail_work_type": "Full time",
      "job_detail_salary": "",
      "jobAdDetails": "About the RoleWe are seeking an experienced AzureData Engineerto join our team and play a pivotal role in designing, building, and maintaining high-performance data solutions on the Microsoft Azure platform. This role will focus on enabling enterprise-wide data accessibility and insights, working with Azure Synapse Analytics, SQL databases, and Power BI.The ideal candidate will be passionate about data, analytics, and reporting best practices, with strong SQL, Power BI, and data modelling skills. You will work collaboratively with business analysts, data scientists, and application developers to ensure accurate, high-quality, and actionable data solutions.Key ResponsibilitiesDesign and implement data models using fact and dimension tables, star and snowflake schemas; develop semantic layers and tabular models for reporting.Build, optimize, and maintain data pipelines, notebooks, and data flows using Azure Synapse Analytics, SQL databases, Python / PySpark. Integrate data from multiple sources ensuring accuracy and consistency.Develop and maintain Power BI datasets, dashboards, and reports; optimize data models for performance and usability.Implement best practices for data validation, cleansing, and transformation; ensure data accuracy, integrity, and compliance with governance standards.Tune SQL queries, indexes, and data models for maximum efficiency; monitor and improve ETL pipelines and reporting solutions.Work closely with stakeholders to support data-driven decision-making; provide guidance on Azure data services and data modelling best practices.What You’ll Bring:Minimum 3 years of experience in a Data Engineering or similar role.Retail industry experience is desirable.Bachelor’s degree in Computer Science, Information Systems, Data Engineering, or related field (or equivalent experience).Microsoft Azure certifications (e.g., Azure Data Engineer Associate) are highly desirable.Advanced SQL skills (query writing, stored procedures, performance tuning).Strong experience with Azure Data Factory, Azure Synapse Analytics, Azure SQL Database, serverless and dedicated pools, Spark transformations, PySpark.Proficient in Power BI (data modelling, DAX, reporting, optimization).Strong understanding of fact/dimension tables, star and snowflake schemas.Hands-on experience with ETL/ELT processes and data warehousing best practices.Familiarity with Azure Data Lake or similar big data tools.Knowledge of Dynamics 365 Commerce data model and Dataverse is a plus.Familiarity with Power Platform and Copilot Studio is advantageous.Excellent analytical, problem-solving, and communication skills.Why Join UsThis is a unique opportunity to work on large-scale data solutions and analytics projects that directly impact business decisions. You’ll be part of a collaborative team that values innovation, quality, and professional growth.Apply NowIf you are a driven Data Engineer passionate about Azure and data analytics, we want to hear from you."
    },
    "extraction_time": "2025-09-26T13:28:38.066420"
  },
  {
    "job_url": "https://www.seek.com.au/job/87262207?type=standard&ref=search-standalone#sol=f8e03bcaa35d9ea4e9b53a8594c2122d99fd1b4e",
    "raw_data_path": "data\\raw\\Unknown_Company_Data Insights Analyst_87262207_20250926_132859",
    "parsed_data": {
      "seek_url": "https://www.seek.com.au/job/87262207?type=standard&ref=search-standalone#sol=f8e03bcaa35d9ea4e9b53a8594c2122d99fd1b4e",
      "job_detail_title": "Data Insights Analyst",
      "job_detail_location": "East Melbourne, Melbourne VIC(Hybrid)",
      "job_detail_classifications": "Analysis & Reporting (Banking & Financial Services)",
      "job_detail_work_type": "Full time",
      "job_detail_salary": "",
      "jobAdDetails": "Gallagheris a global leader in Insurance broking, risk management and consulting, with over 53,000 employees worldwide in over 130 countries. We have a global reach with a local presence and pride ourselves on being a socially responsible and an ethical organisation expressed through our Shared Values, The Gallagher Way. We are proud to have been awarded one of Insurance Business AustraliaTop Insurance EmployersandForbes Best Employer for Women.The Data Insights Analyst supports internal stakeholders by transforming organisational data into actionable insights through reporting, dashboards, and ad hoc analysis. The role involves collecting, analysing, and modelling data, creating visualisations, and ensuring data accuracy and integrity. It also requires collaboration across teams, staying current with industry trends, and providing data-driven recommendations to support strategic decision-making.Some of key accountabilities include:Analyze data to identify trends, patterns, and correlations.Provide actionable insights and recommendations to support business needs.Assist in cleaning, organizing, and ensuring the accuracy and integrity of data.Define and document business data models and queries.Collaborate with cross-functional teams to understand business needs and provide data-driven solutions.Support business units and third-party tools like SmartMarket and Onesource.Create data visualizations and reports to effectively communicate insights.Find optimal solutions for data queries and presentation.Ensure adherence to company standards, security, and regulatory requirements.Stay updated with industry trends and best practices in data analysis and insights generation.Key to this role:Minimum 3 years’ experience in a similar data insights or analytics roleProficient in MSSQL, Python, R, Excel, Power BI; strong ETL/ELT, data modelling, and dashboarding skillsStrong analytical thinking, attention to detail, and clear communication across technical and non-technical audiencesExperience in a similar role in Insurance, Banking / Financial industry highly desiredGallagher Benefits – we offer great benefits and career development opportunitiesincluding tuition assistance; career development and training to build a personalised career pathway; wellbeing offerings; employee assistance program; additional weeks’ Lifestyle leave; Gallagher Rewards for discounts at 350+ major retailers; Employee Stock Purchase Plan to invest in the company's growth potential; paid Volunteering days; and salary sacrificed superannuation options.Apply nowvia our careers website, https://www.ajg.com/au/about-us/careers/ or for further information, please contact our Talent Acquisition team atcareers@ajg.com.auAny offer of employment and subsequent continuing employment is dependent upon the satisfactory completion of background checks by Gallagher or by an external third party provider.Gallagher is an Equal Employment Opportunity (EEO) employer committed to the principles of workplace diversity and inclusion. We welcome all people regardless of ethnicity, faith, sexual orientation, gender identity and lifestyle choices. We are committed to providing a working environment that embraces and values diversity, equity and inclusion."
    },
    "extraction_time": "2025-09-26T13:29:05.048847"
  },
  {
    "job_url": "https://www.seek.com.au/job/86779758?type=standard&ref=search-standalone#sol=ed847aaacd6c7d6cc1cc254e0ae79984a993e916",
    "raw_data_path": "data\\raw\\Unknown_Company_Senior Data Engineer Azure  Po_86779758_20250926_132903",
    "parsed_data": {
      "seek_url": "https://www.seek.com.au/job/86779758?type=standard&ref=search-standalone#sol=ed847aaacd6c7d6cc1cc254e0ae79984a993e916",
      "job_detail_title": "Senior Data Engineer (Azure & Power BI)",
      "job_detail_location": "Melbourne VIC(Hybrid)",
      "job_detail_classifications": "Engineering - Software (Information & Communication Technology)",
      "job_detail_work_type": "Contract/Temp",
      "job_detail_salary": "",
      "jobAdDetails": "About the RoleWe're looking for an experienced Senior Data Engineer who can combine strong engineering expertise with analytical and data modelling skills to deliver high-quality solutions across our data platforms. This is a hands-on role working closely with stakeholders, where you'll shape, design and deliver end-to-end data solutions.What you'll be doingDesigning, building and maintaining robustETL pipelinesusing Azure Data Factory and related tools.Developing and optimisingdata lakes and data warehouse solutionsin Azure.Working closely with analysts and business teams to understand requirements and deliverfit-for-purpose data models.SupportingPower BI developerswith efficient data structures, DAX modelling and best practices.Driving data quality, performance optimisation, and governance across platforms.Collaborating with Product Owners, Testers, and other Engineers in an agile environment.What we're looking forProven experience as aData Engineer(5+ years ideally in enterprise environments).Strong skills in:Azure Data FactoryAzure Data LakeAzure Synapse / SQL Data WarehousingETL / ELT design and optimisationSolid understanding ofPower BI data modelling(DAX, star/snowflake schema, measures, relationships).Proficiency inSQLand performance tuning.Strong stakeholder engagement skills - able to translate technical detail into business outcomes.Bonus: experience withPython, Databricks or Sparkfor data processing.Job reference number: 06810-0013287805 HSBy clicking 'apply', you give your express consent that Robert Half may use your personal information to process your job application and to contact you from time to time for future employment opportunities. For further information on how Robert Half processes your personal information and how to access and correct your information, please read the Robert Half privacy notice: https://www.roberthalf.com/au/en/privacy. Please do not submit any sensitive personal data to us in your resume (such as government ID numbers, ethnicity, gender, religion, marital status or trade union membership) as we do not collect your sensitive personal data at this time."
    },
    "extraction_time": "2025-09-26T13:29:11.209114"
  }
]